/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : BSPQueue.h
** @Founder      : ZSY342
** @Date         : 2019.10.1
** @Function     : BSP通用队列函数模块
** @Instructions :
**===========================================================================================*/
#ifndef _BSPQUEUE_H
#define _BSPQUEUE_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define         QUE_SIZEOF(size,num)        (size*num+6)
#define         QUE_CTRLFLAG(P)             (*((u8*)P))             /*队列标志*/
#define         QUE_UNITSIZE(P)             (*((u8*)P+1))           /*队列元素长度标志*/
#define         QUE_UNITNUM(P)              (*((u8*)P+2))           /*当前最大元素成员数目标志*/
#define         QUE_INPOINT(P)              (*((u8*)P+3))           /*插入点*/
#define         QUE_OUTPOINT(P)             (*((u8*)P+4))           /*取出点*/
#define         QUE_CURNUM(P)               (*((u8*)P+5))           /*当前队列成员数目*/
#define         QUEP_UNIT(P)                ((u8*)P+6)              /*第一个元素地址指针*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : u8 QueInit(void *pQ, u8 unitSize, u8 unitNum)
** @Input     : pQ:队列地址指针，unitSize:单元大小，unitNum:单元数目
** @Output    : TRUE OR FALSE
** @Function  : 将pQ指向的地址初始化为队列
** @The notes : pQ分配的空间要和参数符合
**===========================================================================================*/
u8 QueInit(void *pQ, u8 unitSize, u8 unitNum);

/*=============================================================================================
** @Name      : u8 QueIn(void *pQ, void *pU)
** @Input     : pQ:队列指针，pU:待写入单元指针
** @Output    : TRUE OR FALSE
** @Function  : 将pu指向单元压入pQ队列
** @The notes :
**===========================================================================================*/
u8 QueIn(void *pQ, void *pU);

/*=============================================================================================
** @Name      : u8 QueInDiff(void *pQ, void *pU)
** @Input     : pQ:队列指针，pU:待写入单元指针
** @Output    : TRUE OR FALSE
** @Function  : 将pu指向单元与队列中现有单元对比，如果没有则压入pQ队列
** @The notes : 仅用于u8单位成员
**===========================================================================================*/
u8 QueInDiff(void *pQ, void *pU);

/*=============================================================================================
** @Name      : u8 QueOut(void *pQ, void *pU)
** @Input     : pQ:队列指针，pU:读出单元写入指针
** @Output    : TRUE OR FALSE
** @Function  : 将pQ中数据读出到pU中
** @The notes :
**===========================================================================================*/
u8 QueOut(void *pQ, void *pU);

/*=============================================================================================
** @Name      : u8 QueGetUnit(void *pQ, void *pU, u32 index)
** @Input     : pQ:队列指针，pU:读出单元写入指针
** @Output    : TRUE OR FALSE
** @Function  : 将pQ中数据读出到pU中,但是队列中不取消
** @The notes :
**===========================================================================================*/
u8 QueGetUnit(void *pQ, void *pU, u32 index);

/*=============================================================================================
** @Name      : u8 QueClear(void *pQ)
** @Input     : pQ:队列指针
** @Output    : TRUE OR FALSE
** @Function  : 清零队列
** @The notes :
**===========================================================================================*/
u8 QueClear(void *pQ);

/*=============================================================================================
** @Name      : u8 QueGetUnitNum(void *pQ)
** @Input     : pQ:队列指针
** @Output    : TRUE OR FALSE
** @Function  : 获得当前队列长度
** @The notes :
**===========================================================================================*/
u8 QueGetUnitNum(void *pQ);

#endif
