/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : DEVGPIO.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 输入输出IO管理函数模块
** @Instructions : 根据PCB外围设备编写管理函数
**===========================================================================================*/
#ifndef _DEVGPIO_H
#define _DEVGPIO_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define IO_MUL_CTRL_TYPE        1               //输入输出复用IO控制方式 0:单次触发控制 1:定时周期控制

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
/*输入端口序号*/
typedef enum
{
    ePIn_DRY0     = 0,      	/*输入干接点1(无源,外接信号与电源+串联接入,COM接电源-)*/
    ePIn_DRY1     = 1,      	/*输入干接点2(无源,外接信号与电源+串联接入,COM接电源-)*/
    ePIn_DRY2     = 2,      	/*输入干接点3(无源,外接信号与电源+串联接入,COM接电源-)*/
    ePIn_DRY3     = 3,      	/*输入干接点4(无源,外接信号与电源+串联接入,COM接电源-)*/
    ePIn_DRY4     = 4,      	/*输入干接点5(无源,外接信号与电源+串联接入,COM接电源-)*/
    ePIn_DRY5     = 5,      	/*输入干接点6(无源,外接信号与电源+串联接入,COM接电源-)*/
    
    ePIn_HWVER0   = 6, 			/*硬件版本号端口1*/
    ePIn_HWVER1   = 7, 			/*硬件版本号端口2*/
    ePIn_HWVER2   = 8, 			/*硬件版本号端口3*/

    ePIn_128EWM   = 9, 			/*KEA128心跳信号检测*/

    ePIn_HALFAU   = 10, 		/*电流霍尔电源过载故障状态,复用管脚*/
    ePIn_LK1_Sta  = 11, 		/*K1-低边开关控制回检状态检测,复用管脚*/
    ePIn_LK3_Sta  = 12, 		/*K3-低边开关控制回检状态检测,复用管脚*/
    ePIn_K9_Sta   = 13, 		/*K9高边开关控制回检状态检测,复用管脚*/

}e_INPUTPORT;

/*输出端口序号*/
typedef enum
{
    ePOut_LED      	= 0, 		/*板上LED*/
    ePOut_PwHold   	= 1, 		/*自身电源保持使能*/
    
    ePOut_485EN0   	= 2, 		/*485-1接收使能*/
    ePOut_485EN1   	= 3, 		/*485-2接收使能*/
    ePOut_485EN2   	= 4, 		/*485-3接收使能*/
    
    ePOut_EepWPr   	= 5, 		/*外部EEP 写保护(低电平)*/
    ePOut_LTC2949CS	= 6, 		/*LTC2949片选*/
    
    ePOut_FlaWPr   	= 7, 		/*外部FLASH 写保护(低电平)*/
    ePOut_FlaCS    	= 8, 		/*外部FLASH SPI片选*/

	ePOut_LTC6820_CS1= 9,		/*菊花链LTC6820_1 SPI片选*/
	ePOut_LTC6820_CS2= 10,		/*菊花链LTC6820_2 SPI片选*/

    ePOut_DEC_SIO  	= 11,		/*管脚复用功能译码器片选(低有效)*/
    ePOut_DEC_A0   	= 12,		/*管脚复用功能译码器编码1*/
    ePOut_DEC_A1   	= 13,		/*管脚复用功能译码器编码2*/
    ePOut_DEC_A2   	= 14,		/*管脚复用功能译码器编码3	*/

	ePOut_ISO_PGND  = 15,		/*绝缘检测低压侧PGND控制信号(Rly6/Rly7常闭),复用管脚*/

	ePOut_DRVK0    	= 16,		/*高边开关1,复用管脚*/
	ePOut_DRVK1    	= 17,		/*高边开关2,复用管脚*/
	ePOut_DRVK2    	= 18,		/*高边开关3,复用管脚*/
	ePOut_DRVK3    	= 19,		/*高边开关4,复用管脚*/
	ePOut_DRVK4    	= 20,		/*高边开关5,复用管脚*/
	ePOut_DRVK5    	= 21,		/*高边开关6,复用管脚*/
	ePOut_DRVK6    	= 22,		/*高边开关7,复用管脚*/
	ePOut_DRVK7    	= 23,		/*高边开关8,复用管脚*/
	ePOut_DRVK8    	= 24,		/*高边开关9,复用管脚*/

	ePOut_DRVK1K2EN = 25,		/*高边开关1\2使能管脚,复用管脚*/
	ePOut_DRVK3K4EN = 26,		/*高边开关3\4使能管脚,复用管脚*/
	ePOut_DRVK5K6EN = 27,		/*高边开关5\6使能管脚,复用管脚*/
	ePOut_DRVK7K8EN = 28,		/*高边开关7\8使能管脚,复用管脚*/

	ePOut_LDRVK0    = 29,		/*低边开关1,复用管脚*/
	ePOut_LDRVK2    = 30,		/*低边开关2,复用管脚*/

	ePOut_DRVDSELALL= 31,		/*高边开关1\2\3\4\5\6\7\8回采电流选通,复用管脚*/

    ePOut_STADRY0  	= 32,		/*系统状态输出干接点1(继电器无源开闭信号,复用管脚)*/
    ePOut_CHGDRY1  	= 33,		/*充电允许输出干接点2(继电器无源开闭信号,复用管脚)*/
    ePOut_DHGDRY2  	= 34,		/*放电允许输出干接点3(继电器无源开闭信号,复用管脚)*/

	ePOut_LTC6820EN1 = 35,		/*菊花链LTC6820_1芯片激活管脚,复用管脚*/
	ePOut_LTC6820EN2 = 36,		/*菊花链LTC6820_2芯片激活管脚,复用管脚*/
	ePOut_K4Second   = 37,		/*低压电源K4第2路控制输出,复用管脚*/
	ePOut_SimIIC_SCL = 38,		/*模拟IIC时钟线*/
	ePOut_SimIIC_SDA = 39,		/*模拟IIC数据线*/

	ePOut_SBCFS65_CS = 40,		/*FS6503片选信号*/

	ePOut_128EWM_OUT = 41,		/*到KEA128心跳信号*/
	ePOut_128SPI_CS  = 42,		/*到KEA128 SPI片选信号*/

}e_OutputPort;

//复用端口序号
typedef enum
{
    ePMul_D0 = 0,       		/*复用端口D0*/
    ePMul_D1 = 1,       		/*复用端口D1*/
    ePMul_D2 = 2,       		/*复用端口D2*/
    ePMul_D3 = 3,       		/*复用端口D3*/
    ePMul_D4 = 4,       		/*复用端口D4*/
    ePMul_D5 = 5,       		/*复用端口D5*/
    ePMul_D6 = 6,       		/*复用端口D6*/
    ePMul_D7 = 7,       		/*复用端口D7*/

}e_MULPORT;

/*输入输出端口状态(闭合/断开)*/
typedef enum
{
    ePSTATE_OFF  = 0,
    ePSTATE_ON   = 1,
    ePSTATE_NUM
    
}e_GPIOState;

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : u8 DEVGPIOInit(void)
** @Input     : void
** @Output    : TRUE:成功 FALSE:失败
** @Function  : GPIO端口初始化
** @The notes : 只初始化板级提供的资源
**===========================================================================================*/
u8 DEVGPIOInit(void);

/*=============================================================================================
** @Name      : void DEVGPIOMulPortManagTask(void)
** @Input     : void
** @Output    : void
** @Function  : GPIO复用端口管控任务
** @The notes : 10ms
**===========================================================================================*/
void DEVGPIOMulPortManagTask(void);

/*=============================================================================================
** @Name      : void DEVGPIOCheckHSCurrState(u8 channel, u16 curr)
** @Input     : channel:高边驱动通道序号 curr:回检电流 0.01A
** @Output    : void
** @Function  : 检测高边驱动电流状态状态
** @The notes : 高边驱动电流判断接触器状态
**===========================================================================================*/
void DEVGPIOCheckHSCurrState(u8 channel, u16 curr);

/*=============================================================================================
** @Name      : u8 DEVGPIOGetInPortState(e_INPUTPORT port)
** @Input     : port:输入端口号
** @Output    : 端口状态[0:断开 1:闭合]
** @Function  : 获取GPIO输入端口状态
** @The notes :
**===========================================================================================*/
u8 DEVGPIOGetInPortState(e_INPUTPORT port);

/*=============================================================================================
** @Name      : u8 DEVGPIOSetPortState(e_OutputPort port, e_GPIOState state)
** @Input     : port:输出端口号 state:输出状态[0:断开 1:闭合]
** @Output    : TRUE:成功 FALSE:失败
** @Function  : 设置GPIO输出端口状态
** @The notes :
**===========================================================================================*/
u8 DEVGPIOSetPortState(e_OutputPort port, e_GPIOState state);

/*=============================================================================================
** @Name      : u8 DEVGPIOGetOutPortState(e_OutputPort port)
** @Input     : port:输出端口号
** @Output    : 端口状态[0:断开 1:闭合]
** @Function  : 获取GPIO输出端口状态
** @The notes :
**===========================================================================================*/
u8 DEVGPIOGetOutPortState(e_OutputPort port);

/*=============================================================================================
** @Name      : u16 DEVGPIOGetInputDryState(void)
** @Input     : void
** @Output    : 按位表示各输入干接点端口状态[0:断开 1:闭合]
** @Function  : 获取所有输入干接点端口状态
** @The notes : 共6路
**===========================================================================================*/
u16 DEVGPIOGetInputDryState(void);

/*=============================================================================================
** @Name      : u8 DEVGPIOGetHWVersion(void)
** @Input     : void
** @Output    : 按位表示硬件版本号
** @Function  : 获取硬件版本号
** @The notes : 共3路
**===========================================================================================*/
u8 DEVGPIOGetHWVersion(void);

/*=============================================================================================
** @Name      : u8 DEVGPIOGetSwhBackState(void)
** @Input     : void
** @Output    : 按位表示回检信号状态
** @Function  : 获取高低边开关回检信号状态
** @The notes : 共3路(2路低边1路高边K9)
**===========================================================================================*/
u8 DEVGPIOGetSwhBackState(void);

/*=============================================================================================
** @Name      : u8 DEVGPIOGetOutputDryState(void)
** @Input     : void
** @Output    : 按位表示出干接点当前状态[0:断开 1:闭合]
** @Function  : 获取输出干接点状态
** @The notes : 共3路
**===========================================================================================*/
u8 DEVGPIOGetOutputDryState(void);

/*=============================================================================================
** @Name      : u16 DEVGPIOGetCtrlHSwitchState(void)
** @Input     : void
** @Output    : 按位表示高边开关当前控制状态[0:断开 1:闭合]
** @Function  : 获取控制接触器高边开关状态
** @The notes : 共9路
**===========================================================================================*/
u16 DEVGPIOGetCtrlHSwitchState(void);

/*=============================================================================================
** @Name      : u16 DEVGPIOGetCtrlLSwitchState(void)
** @Input     : void
** @Output    : 按位表示低边开关当前控制状态[0:断开 1:闭合]
** @Function  : 获取控制接触器低边开关状态
** @The notes : 共2路
**===========================================================================================*/
u16 DEVGPIOGetCtrlLSwitchState(void);

#endif
