/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : DEVADC.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : ADC采样通道管理函数模块
** @Instructions : 根据PCB外围设备编写管理函数
**===========================================================================================*/
#ifndef _DEVADC_H
#define _DEVADC_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPADC.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
/*AD通道序号*/
typedef enum
{
    eADC_HalSIG   = 0,    	/*霍尔电流信号采集*/
	eADC_PwrV,    			/*输入供电电源信号*/
    eADC_ACCV,    			/*输入电源ACC激活信号*/
    eADC_Hal5V,    			/*霍尔供电电压采样(5V)*/
    eADC_CdcV,    			/*快充充电枪供入电压采样*/
    eADC_CC2V,    			/*充电枪CC2信号电压采样*/
    eADC_MCU5V,    			/*MCU5V电源信号*/
    eADC_Aux5V,    			/*SBC芯片6503输出信号AUX(5V)*/
	eADC_MUXOut,			/*SBC芯片MUX通道电压检测*/
	eADC_PWMV,				/*PWM电压采样*/
	eADC_TEMP1,	  			/*环境温度1*/
	eADC_TEMP2,				/*环境温度2*/
    eADC_HS_AD,    			/*高边开关控制回检电流采集*/

    eADC_IdLen            	/*设备ADC通道序号长度*/
}e_DevADCId;

/*ADC模块类型定义*/
typedef enum
{
    eDEVADC_MOD0 = 0,    	/*ADC模块1*/
    eDEVADC_MOD1 = 1,    	/*ADC模块2*/

    eDEVADC_MODNUM
}e_DEVADCMod;

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : u8 DEVADCInit(void)
** @Input     : void
** @Output    : TRUE:成功 FALSE:失败
** @Function  : ADC端口初始化
** @The notes : 只初始化板级提供的资源
**===========================================================================================*/
u8 DEVADCInit(void);

/*=============================================================================================
** @Name      : void DEVADCStart(e_DEVADCMod module, e_DevADCId channel)
** @Input     : channel:ADC通道序号
** @Output    : TRUE:成功 FALSE:失败
** @Function  : 启动ADC通道转换
** @The notes : 用户调用
**===========================================================================================*/
void DEVADCStart(e_DEVADCMod module, e_DevADCId channel);

/*=============================================================================================
** @Name      : u16 DEVADCGetSampAD(e_ADCModule module, e_DevADCId channel)
** @Input     : channel:ADC通道序号
** @Output    : 采样值
** @Function  : 获取ADC采样AD值(已滤波)
** @The notes : 用户调用
**===========================================================================================*/
u16 DEVADCGetSampAD(e_DEVADCMod module, e_DevADCId channel);

#endif
