/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : DEVSCI.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : RS485通讯管理函数模块
** @Instructions :
**===========================================================================================*/
#ifndef _DEVSCI_H
#define _DEVSCI_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPUART.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : u8 DEVSCIResetInit(e_SCINUM sciNum)
** @Input     : sciNum:SCI通道号
** @Output    : TRUE:成功 FALSE:失败
** @Function  : 串口复位重新初始化
** @The notes : 用户调用
**===========================================================================================*/
u8 DEVSCIResetInit(e_SCINUM sciNum);

/*=============================================================================================
** @Name      : u8 DEVSCISendDataOnISR(e_SCINUM sciNum, u8 *sendbuf, u8 size)
** @Input     : sciNum:SCI通道号 *sendbuf:发送的数据 size:数据长度
** @Output    : TRUE:成功 FALSE:失败
** @Function  : RS485中断方式发送串口数据
** @The notes : 直接发送,暂不实现
**===========================================================================================*/
u8 DEVSCISendDataOnISR(e_SCINUM sciNum, u8 *sendbuf, u8 size);

/*=============================================================================================
** @Name      : u8 DEVSCISendDataOnAsk(e_SCINUM sciNum, u8 *sendbuf, u8 size)
** @Input     : sciNum:SCI通道号 *sendbuf:发送的数据 size:数据长度
** @Output    : TRUE:成功 FALSE:失败
** @Function  : RS485询问方式发送串口数据
** @The notes : 直接发送,用户调用
**===========================================================================================*/
u8 DEVSCISendDataOnAsk(e_SCINUM sciNum, u8 *sendbuf, u8 size);

#endif



