/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : CurrIntegral.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 电能量SOE计算模块
** @Instructions :
**===========================================================================================*/
#ifndef _ENERINFOCALC_H
#define _ENERINFOCALC_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define ENER_ZERO_POINT             1000000     //电能计算的零点值(底端容量)
#define ENER_CHANG_TO_WRITE_EEP     500         //电能进行写EEP变化值(单位:1WH)
 
/*=============================================================================================
** @Data type definition
**===========================================================================================*/
//能量计算结构体
typedef struct
{
    u32 nowEner;                //当前能量(单位:1WH)
    u32 remEner;                //剩余能量(单位:1WH)
    u32 baseEner;               //底端能量(单位:1WH)
    u32 topEner;                //顶端能量(单位:1WH)
    u32 standEner;              //标称能量(单位:1WH)
}t_ENERFORM;

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void GroupEnerSoeInit(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组当前电能SOE计算初始化
** @The notes :
**===========================================================================================*/
void GroupEnerSoeInit(void);

/*=============================================================================================
** @Name      : void GroupEnerSoeCalcTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组当前电能SOE计算任务
** @The notes : 100ms调用,测算当前能量和SOE
**===========================================================================================*/
void GroupEnerSoeCalcTask(void);

/*=============================================================================================
** @Name      : void CorrGNowEnerBySoeAPI(u16 soe)
** @Input     : soe:目标SOE(0.1%)
** @Output    : void
** @Function  : 根据电池组SOE修正当前电能
** @The notes : 用户需要修正电池组当前电能时调用
**===========================================================================================*/
void CorrGNowEnerBySoeAPI(u16 soe);

/*=============================================================================================
** @Name      : void CorrGRemainEnerBySoeAPI(u16 soe)
** @Input     : soe:目标SOE(0.1%)
** @Output    : void
** @Function  : 根据电池组SOE修正剩余电能
** @The notes : 用户需要电池组修正剩余电能时调用
**===========================================================================================*/
void CorrGRemainEnerBySoeAPI(u16 soe);

/*=============================================================================================
** @Name      : void CorrGroupTotalEnerAPI(u32 ener)
** @Input     : ener:电池组总能量(单位:1Wh)
** @Output    : void
** @Function  : 修正电池组总能量
** @The notes :
**===========================================================================================*/
void CorrGroupTotalEnerAPI(u32 ener);

/*=============================================================================================
** @Name      : void CorrGroupStandEnerAPI(u32 ener)
** @Input     : ener:电池组标称能量(单位:1Wh)
** @Output    : void
** @Function  : 修正电池组标称能量
** @The notes :
**===========================================================================================*/
void CorrGroupStandEnerAPI(u32 ener);

/*=============================================================================================
** @Name      : u32 GetGroupNowEnerAPI(void)
** @Input     : void
** @Output    : 电池组当前电能,即可用电能(单位:1WH)
** @Function  : 获取电池组当前电能
** @The notes : 可以使用的电能
**===========================================================================================*/
u32 GetGroupNowEnerAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupRemainEnerAPI(void)
** @Input     : void
** @Output    : 电池组剩余电能 (单位:1WH)
** @Function  : 获取电池组剩余电能
** @The notes : 包括不能使用的电能
**===========================================================================================*/
u32 GetGroupRemainEnerAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupTotalEnerAPI(void)
** @Input     : void
** @Output    : 电池组总电能(单位:1WH)
** @Function  : 获取电池组总电能
** @The notes :
**===========================================================================================*/
u32 GetGroupTotalEnerAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupStandEnerAPI(void)
** @Input     : void
** @Output    : 电池组标称电能(单位:1WH)
** @Function  : 获取电池组标称电能
** @The notes :
**===========================================================================================*/
u32 GetGroupStandEnerAPI(void);

/*=============================================================================================
** @Name      : u16 GetGRealSoeTenThousAPI(void)
** @Input     : void
** @Output    : 电池组当前真实SOE值(0.01%)
** @Function  : 获取电池组当前真实SOE值
** @The notes : 实际可用值，分辨率万分之一
**===========================================================================================*/
u16 GetGRealSoeTenThousAPI(void);

/*=============================================================================================
** @Name      : u16 GetGRealSoeMilliAPI(void)
** @Input     : void
** @Output    : 电池组当前真实SOE值(0.1%)
** @Function  : 获取电池组当前真实SOE值
** @The notes : 实际可用值，分辨率千分之一
**===========================================================================================*/
u16 GetGRealSoeMilliAPI(void);

/*=============================================================================================
** @Name      : u16 GetGRemainSoeMilliAPI(void)
** @Input     : void
** @Output    : 剩余SOE值(0.1%)
** @Function  : 获取剩余SOE值
** @The notes : 相对总能量剩余值，分辨率千分之一
**===========================================================================================*/
u16 GetGRemainSoeMilliAPI(void);

#endif
