/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : GroupDebug.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 电池调试模式处理模块接口
** @Instructions : 
**===============================================================================================*/
#ifndef _GROUPDEBUG_H
#define _GROUPDEBUG_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void TacSetGroupDebugAffirmCmdAPI(u8 cmd)
** @Input     : cmd:调试确认命令 1:功能调试确认 2:EEPROM读调试确认 3:EEPROM写调试确认
** @Output    : void
** @Function  : 电池组调试确认命令处理函数
** @The notes : 通信口
**===============================================================================================*/
void TacSetGroupDebugAffirmCmdAPI(u8 cmd);

/*=================================================================================================
** @Name      : u8 TacDebugSlaveBalanDeal(void)
** @Input     : void
** @Output    : TRUE:调试成功 FALSE:调试失败
** @Function  : 调试模式控制从控均衡状态
** @The notes : 接收从控均衡调试确认命令时调用
**===============================================================================================*/
u8 TacDebugSlaveBalanDeal(void);

/*=================================================================================================
** @Name      : void TacDebugSlaveSwitchDeal(void)
** @Input     : void
** @Output    : TRUE:调试成功 FALSE:调试失败
** @Function  : 调试模式控制从控接触器状态
** @The notes : 接收从控接触器调试确认命令时调用
**===============================================================================================*/
u8 TacDebugSlaveSwitchDeal(void);

/*=================================================================================================
** @Name      : void TacDebugSlaveOutDryDeal(void)
** @Input     : void
** @Output    : TRUE:调试成功 FALSE:调试失败
** @Function  : 调试模式控制从控输出干接点状态
** @The notes : 接收从控输出干接点调试确认命令时调用
**===============================================================================================*/
u8 TacDebugSlaveOutDryDeal(void);

/*=================================================================================================
** @Name      : void DebugReadBmuEepData(void)
** @Input     : void
** @Output    : TRUE:调试成功 FALSE:调试失败
** @Function  : 调试模式读取BMUEEPROM参数值
** @The notes : 接收BMUEEPROM参数调试确认命令时调用
**===============================================================================================*/
u8 TacDebugSlaveReadEepDeal(void);

/*=================================================================================================
** @Name      : void TacDebugGroupOutPortDeal(void)
** @Input     : void
** @Output    : TRUE:调试成功 FALSE:调试失败
** @Function  : 调试模式控制主控内部输出端口状态
** @The notes : 接收主控内部输出端口调试确认命令时调用
**===============================================================================================*/
u8 TacDebugGroupOutPortDeal(void);

/*=================================================================================================
** @Name      : void TacDebugGroupSwitchDeal(void)
** @Input     : void
** @Output    : TRUE:调试成功 FALSE:调试失败
** @Function  : 调试模式控制主控接触器状态
** @The notes : 接收主控接触器调试确认命令时调用
**===============================================================================================*/
u8 TacDebugGroupSwitchDeal(void);

/*=================================================================================================
** @Name      : void TacDebugGroupOutDryDeal(void)
** @Input     : void
** @Output    : TRUE:调试成功 FALSE:调试失败
** @Function  : 调试模式控制主控输出干接点状态
** @The notes : 接收主控输出干接点调试确认命令时调用
**===============================================================================================*/
u8 TacDebugGroupOutDryDeal(void);

/*=================================================================================================
** @Name      : void TacDebugGroupReadEepDeal(void)
** @Input     : void
** @Output    : TRUE:读取成功 FALSE:读取失败
** @Function  : 调试模式读主控EEP参数值
** @The notes : 接收读主控EEP参数调试确认命令时调用
**===============================================================================================*/
u8 TacDebugGroupReadEepDeal(void);

/*=================================================================================================
** @Name      : void TacDebugGroupWriteEepDeal(void)
** @Input     : void
** @Output    : TRUE:写入成功 FALSE:写入失败
** @Function  : 调试模式写主控EEP参数值
** @The notes : 接收写主控EEP参数调试确认命令时调用
**===============================================================================================*/
u8 TacDebugGroupWriteEepDeal(void);

#endif
