/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : GroupProtect.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 电池组故障保护模块接口
** @Instructions : 
**===============================================================================================*/
#ifndef _GROUPPROTECT_H
#define _GROUPPROTECT_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/
#define ERR_PRO_RE_TIMES            2                       /*故障保护允许反复次数(防止接触器反复跳变)[0,10]*/
#define ERR_PRO_SWH_CURR_T          5                       /*故障保护回检电流延时(0.1s)*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/
/*故障保护类型值*/ 
typedef enum 
{
    eProSort_ChgLim = 0,                /*充电限制保护(充电限制仍继续充电,达到延时后请求停机保护)*/
    eProSort_DhgLim = 1,                /*放电限制保护(放电限制仍继续放电,达到延时后请求停机保护)*/
    eProSort_ChgPro = 2,                /*充电故障保护(产生充电保护故障仍继续充电,先请求保护达到延时后执行保护)*/
    eProSort_DhgPro = 3,                /*放电故障保护(产生放电保护故障仍继续放电,先请求保护达到延时后执行保护)*/
    eProSort_SysPro = 4,                /*充放电保护(产生充放电保护故障,先请求保护达到延时后执行保护[需要断接触器的充电保护或放电保护故障类型要设置成充放电保护])*/
    eProSort_SysErr = 5,                /*系统故障保护(产生系统保护故障或系统状态故障,先请求保护达到延时后执行保护)*/
    
    eProSort_Num
}e_ErrProSort;

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void GroupProtectInit(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组保护策略初始化
** @The notes :
**===============================================================================================*/
void GroupProtectInit(void);

/*=================================================================================================
** @Name      : void GroupProtectTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组保护策略执行任务
** @The notes : 100ms周期调用
**===============================================================================================*/
void GroupProtectTask(void);

/*=================================================================================================
** @Name      : void TacClrGroupProFlagAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除电池组故障保护标志
** @The notes :
**===============================================================================================*/
void TacClrGroupProFlagAPI(void);

/*=================================================================================================
** @Name      : u8 TacGetGAskChgProFlagAPI(void)
** @Input     : void
** @Output    : 电池组请求充电保护标志 0:未请求 1:请求
** @Function  : 获取电池组请求充电保护标志
** @The notes :
**===============================================================================================*/
u8 TacGetGAskChgProFlagAPI(void);

/*=================================================================================================
** @Name      : u8 TacGetGAskDhgProFlagAPI(void)
** @Input     : void
** @Output    : 电池组请求放电保护标志 0:未请求 1:请求
** @Function  : 获取电池组请求放电保护标志
** @The notes :
**===============================================================================================*/
u8 TacGetGAskDhgProFlagAPI(void);

/*=================================================================================================
** @Name      : u8 TacGetGAskSysProFlagAPI(void)
** @Input     : void
** @Output    : 电池组请求充放电保护标志 0:未请求 1:请求
** @Function  : 获取电池组请求充放电保护标志
** @The notes : 同时需要充放电保护
**===============================================================================================*/
u8 TacGetGAskSysProFlagAPI(void);

/*=================================================================================================
** @Name      : u16 TacGetGHappenProFlagAPI(void)
** @Input     : void
** @Output    : 电池组产生充放电保护标志,按位表示:bit0:充电截止保护 bit1:放电截止保护 bit2:充电故障保护 bit3:放电故障保护 bit4:充放电故障保护 bit5:系统故障保护 (0:正常 1:产生保护)
** @Function  : 获取电池组产生充放电保护标志
** @The notes :
**===============================================================================================*/
u16 TacGetGHappenProFlagAPI(void);

#endif
