/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : CurrSample.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 电流采样模块
** @Instructions : 同时使能霍尔和分流器时以分流器为主,霍尔作为参考
**===========================================================================================*/
#ifndef FUNTION_MEASUREMENT_CURRSAMPLE_H_
#define FUNTION_MEASUREMENT_CURRSAMPLE_H_

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "HigAFESamp.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
//采样参数配置
#define CURR_SAMP_MAIN_EN   1                                           /*使用主板BMU电流采样使能 0:高压模块HVCU 1:主板BMU*/
#define CURR_AUT_ZERO_EN    1                                           /*自动校零使能 0:禁止 1:使能*/
#define CURR_INT_ADD_EN     1                                           /*中断电流积分使能 0:定时任务积分 1:定时中断积分*/
//#define CURR_HALL_EXP_AD    0xffff                                    /*使用霍尔采样异常时的AD值*/
//#define CURR_SHUNT_EXP_AD   0x8000                                    /*使用分流器采样异常时的AD值*/

#define CURR_HALL5V_MINV    (450)                                       /*霍尔5V基准采样允许最低值 0.01V*/
#define CURR_HALL_MIN_AD    (249)                                       /*使用霍尔采时最小AD值(0.3V)*/
#define CURR_HALL_MAX_AD    (3890)                                      /*使用霍尔采时最大AD值(4.7V)*/
#define CURR_SHUNT_MIN_V    (-9000)                                     /*使用分流器采时最小AD值(-90mV) 0.01mV*/
#define CURR_SHUNT_MAX_V    (9000)                                      /*使用分流器采时最大AD值(90mV) 0.01mV*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
/*电流采样通道*/
typedef enum
{
    eCADC_Hall = 0,                 /*内部ADC通道霍尔电流采样*/
    eCAFE_Shunt = 1,                /*外部AFE通道分流器电流采样*/

    eCCHAN_Num                      /*电流采样通道个数*/
}e_CSampChan;

/*电流采样异常ID*/
typedef enum
{
    eCExp_HalOff = 0,               /*电流采样霍尔供电异常*/
    eCExp_HalErr = 1,               /*电流采样霍尔过载回检异常*/
    eCExp_ADCErr = 2,               /*电流采样ADC通道异常*/
    eCExp_HADErr = 3,               /*电流采样霍尔AD值异常*/
    eCExp_AfeErr = 4,               /*电流采样分流器模拟前端异常*/
    eCExp_SADErr = 5,               /*电流采样分流器AD值异常*/
    eCExp_ZroErr = 6,               /*电流采样校零异常*/
    eCExp_HSDiff = 7,               /*电流采样霍尔分流器采样值不一致(均使能时)*/

    eCExp_IDLen                     /*电流采样异常ID长度*/
}e_CSampExp_ID;

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void CurrSampleInit(void)
** @Input     : void
** @Output    : void
** @Function  : 电流信息采样初始化
** @The notes :
**===========================================================================================*/
void CurrSampleInit(void);

/*=============================================================================================
** @Name      : void ISRCurrCapAddTask(void)
** @Input     : void
** @Output    : void
** @Function  : 定时中断电流积分任务
** @The notes : 必须1ms定时中断调用
**===========================================================================================*/
void ISRCurrCapAddTask(void);

/*=============================================================================================
** @Name      : void CalcSampleADToCurr(u8 channel, s32 currAD)
** @Input     : channel:采样通道(0主板霍尔 1主板分流器) currAD:电流AD
** @Output    : void
** @Function  : 将采样AD值转化为电流值
** @The notes : 高压模块采电流时输入为电流值0.01A
**===========================================================================================*/
void CalcSampleADToCurr(u8 channel, s32 currAD);

/*=============================================================================================
** @Name      : void ClrCurrZeroFinFlagAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除电流零点校零标志
** @The notes : 重新校零
**===========================================================================================*/
void ClrCurrZeroFinFlagAPI(void);

/*=============================================================================================
** @Name      : void SetCurrSampExpFlagAPI(u8 id, u8 state, s16 currAD)
** @Input     : id:电流采样异常ID(0:霍尔供电5V异常 1:霍尔回检信号异常 2:霍尔ADC通道异常 3:霍尔AD值异常 4:分流器模拟前端异常 5:分流器AD值异常 6:电流校零异常 7:俩通道采样值误差异常 sate:设置状态[0:正常 1:异常]) currAD:读取到的AD值
** @Output    : void
** @Function  : 设置电流采样异常标志
** @The notes :
**===========================================================================================*/
void SetCurrSampExpFlagAPI(u8 id, u8 state, s16 currAD);

/*=============================================================================================
** @Name      : s32 GetGRealCurr10mAAPI(e_CSampChan channel)
** @Input     : void
** @Output    : 电流采样瞬时电流值 10mA
** @Function  : 获取电流采样实时瞬时电流值
** @The notes :
**===========================================================================================*/
s32 GetGRealCurr10mAAPI(e_CSampChan channel);

/*=============================================================================================
** @Name      : s32 GetGRealVolt10uVAPI(e_CSampChan channel)
** @Input     : void
** @Output    : 电流采样瞬时电压值 10uV
** @Function  : 获取电流采样实时瞬时电压值
** @The notes :
**===========================================================================================*/
s32 GetGRealVolt10uVAPI(e_CSampChan channel);

/*=============================================================================================
** @Name      : u8 SampGetCurrZeroFinFlagAPI(void)
** @Input     : void
** @Output    : 电流采样零飘校准完成标志[0未校准 1校准成功 2校准失败]
** @Function  : 获取电流采样零飘校准完成标志
** @The notes :
**===========================================================================================*/
u8 SampGetCurrZeroFinFlagAPI(void);

/*=============================================================================================
** @Name      : u8 SampGetCurrSampExpFlagAPI(u8 channel)
** @Input     : channel:采样通道(0:霍尔通道 1:分流器通道 2:两个通道综合(一个正常则正常)) 0xff:原标志
** @Output    : 按位表示采样异常标志(bit0:霍尔供电5V异常 bit1:霍尔回检信号异常 bit2:霍尔ADC通道异常 bit3:霍尔AD值异常 bit4:分流器模拟前端采样异常 bit5:分流器AD值异常 bit6:电流校零异常 bit7:两通道采样误差异常[0正常 1异常])
** @Function  : 获取指定采样通道电流采样异常标志
** @The notes :
**===========================================================================================*/
u8 SampGetCurrSampExpFlagAPI(u8 channel);

#endif
