/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : PortCheck.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 绝缘检测模块
** @Instructions :
**===========================================================================================*/
#ifndef FUNTION_MEASUREMENT_PORTCHECK_H_
#define FUNTION_MEASUREMENT_PORTCHECK_H_

/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void PortStateCheckTask(void)
** @Input     : void
** @Output    : void
** @Function  : 实时更新IO状态到相应寄存器
** @The notes : 10ms调用
**===========================================================================================*/
void PortStateCheckTask(void);

/*=============================================================================================
** @Name      : u8 GetGPwrIoButtonStateAPI(void)
** @Input     : void
** @Output    : 启停按钮状态：0松开   1按下
** @Function  : 获取启停按钮状态(自复位按钮，常态为断开(低电平))
** @The notes : 用户调用
**===========================================================================================*/
u8 GetGPwrIoButtonStateAPI(void);

/*=============================================================================================
** @Name      : u8 GetGIsoIoReadyStateAPI(void)
** @Input     : void
** @Output    : 断路器就绪状态:0断开 1闭合(就绪)
** @Function  : 获取启停按钮状态,手动开关，常态为闭合(高电平)
** @The notes : 用户调用
**===========================================================================================*/
u8 GetGIsoIoReadyStateAPI(void);

/*=============================================================================================
** @Name      : u8 GetGSmogIoWarStateAPI(void)
** @Input     : void
** @Output    : 烟感状态:0正常 1报警
** @Function  : 获取烟感报警状态,反馈信号，常态为闭合(高电平)
** @The notes : 用户调用
**===========================================================================================*/
u8 GetGSmogIoWarStateAPI(void);

/*=============================================================================================
** @Name      : u8 GetGEmergIoButtonStateAPI(void)
** @Input     : void
** @Output    : 急停按钮状态:0正常 1按下（急停）
** @Function  : 获取急停按钮状态
** @The notes : 用户调用
**===========================================================================================*/
u8 GetGEmergIoButtonStateAPI(void);

/*=============================================================================================
** @Name      : u8 GetGFusIoExpStateAPI(void)
** @Input     : void
** @Output    : 0:正常 1:熔断(异常)
** @Function  : 获取熔断器端口异常状态，低电平0为断开
** @The notes : 用户调用
**===========================================================================================*/
u8 GetGFusIoExpStateAPI(void);

/*=============================================================================================
** @Name      : u8 GetGThundIoExpStateAPI(void)
** @Input     : void
** @Output    : 0:正常 1:报警
** @Function  : 获取防雷器故障端口异常状态,低电平0为防雷器故障
** @The notes : 用户调用
**===========================================================================================*/
u8 GetGThundIoExpStateAPI(void);

/*=============================================================================================
** @Name      : u8 GetGLeakIoExpStateAPI(void)
** @Input     : void
** @Output    : 0:正常 1:一级故障 2:二级告警 3:检测异常
** @Function  : 获取绝缘故障告警端口异常状态,告警口低电平0为检测异常,故障口高电平1为绝缘故障
** @The notes : 用户调用
**===========================================================================================*/
u8 GetGLeakIoExpStateAPI(void);

#endif
