/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : ParaExtEep.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 参数存储模块读写外部EEPROM参数
** @Instructions : 
**===============================================================================================*/
#ifndef _PARAEXTEEP_H
#define _PARAEXTEEP_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u8 ReadExtEepDevSerial(u8 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取设备条码序列号值
** @The notes :
**===============================================================================================*/
u8 ReadExtEepDevSerial(u8 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepCorrZeroCurr(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取电流零飘修正值(有符号,单位10mA)
** @The notes :
**===============================================================================================*/
u8 ReadExtEepCorrZeroCurr(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepHalChgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取霍尔充电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadExtEepHalChgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepHalDhgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取霍尔放电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadExtEepHalDhgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepShuChgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取分流器充电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadExtEepShuChgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepShuDhgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取分流器放电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadExtEepShuDhgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepSumVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取电池总电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadExtEepSumVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepPreVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取预充电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadExtEepPreVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepLoaVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取负载电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadExtEepLoaVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepPosVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取Link+电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadExtEepPosVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepNegVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取Link-电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadExtEepNegVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepSysClock(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取系统时钟(北京时间)
** @The notes :
**===============================================================================================*/
u8 ReadExtEepSysClock(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepMonErrTime(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取月故障数目统计时间(年月)
** @The notes :
**===============================================================================================*/
u8 ReadExtEepMonErrTime(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepNowCapSoh(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取当前总容量SOH值
** @The notes :
**===============================================================================================*/
u8 ReadExtEepNowCapSoh(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepChgTimesState(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取充放电次数检测状态
** @The notes :
**===============================================================================================*/
u8 ReadExtEepChgTimesState(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepCapEnerCorrInfo(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取总容量总能量自动标定信息值
** @The notes :
**===============================================================================================*/
u8 ReadExtEepCapEnerCorrInfo(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepCapFormInfo(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取电量计算结构信息
** @The notes :
**===============================================================================================*/
u8 ReadExtEepCapFormInfo(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepCapFormInfo(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取电能计算结构信息
** @The notes :
**===============================================================================================*/
u8 ReadExtEepEnerFormInfo(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepSysRunTime(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取系统运行(上电)时长 1Hour
** @The notes :
**===============================================================================================*/
u8 ReadExtEepSysRunTime(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepChgDhgTimes(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取充放电次数
** @The notes :
**===============================================================================================*/
u8 ReadExtEepChgDhgTimes(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepHisErrNum(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取历史故障告警数目
** @The notes :
**===============================================================================================*/
u8 ReadExtEepHisErrNum(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepDODStaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取放电深度DOD统计信息
** @The notes :
**===============================================================================================*/
u8 ReadExtEepDODStaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepSOSStaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取安全等级SOS统计信息
** @The notes :
**===============================================================================================*/
u8 ReadExtEepSOSStaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepHisChgDhgCap(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取累计充放电电量 1AH
** @The notes :
**===============================================================================================*/
u8 ReadExtEepHisChgDhgCap(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepHisChgDhgEner(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取累计充放电电能 0.1kWh
** @The notes :
**===============================================================================================*/
u8 ReadExtEepHisChgDhgEner(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepGroupGenParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取电池组主控通用参数信息
** @The notes :
**===============================================================================================*/
u8 ReadExtEepGroupGenParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepGroupHigParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取电池组主控高级参数信息
** @The notes :
**===============================================================================================*/
u8 ReadExtEepGroupHigParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepGroupHWParaInfo(u8 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取电池组主控高级参数信息
** @The notes :
**===============================================================================================*/
u8 ReadExtEepGroupHWParaInfo(u8 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepSystemWorkMode(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取系统工作模式
** @The notes :
**===============================================================================================*/
u8 ReadExtEepSystemWorkMode(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepSystemGenParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取系统通用参数信息
** @The notes :
**===============================================================================================*/
u8 ReadExtEepSystemGenParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadExtEepSystemHWParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从外部EEPROM读取系统设备硬件参数信息
** @The notes :
**===============================================================================================*/
u8 ReadExtEepSystemHWParaInfo(u16 *data, u8 len);

/*外部EEPROM单个写会失败*/
#if(0)
/*=================================================================================================
** @Name      : u8 WriteExtEepDevSerial(u8 index, u8 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入设备序列号
** @The notes :
**===============================================================================================*/
u8 WriteExtEepDevSerial(u8 index, u8 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepCorrZeroCurr(u8 index, u16 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入电流零飘修正值
** @The notes :
**===============================================================================================*/
u8 WriteExtEepCorrZeroCurr(u8 index, u16 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepChgCurrCorrKB(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入霍尔充电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteExtEepHalChgCurrCorrKB(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepDhgCurrCorrKB(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入霍尔放电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteExtEepHalDhgCurrCorrKB(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepShuChgCurrCorrKB(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入分流器充电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteExtEepShuChgCurrCorrKB(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepShuDhgCurrCorrKB(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入分流器放电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteExtEepShuDhgCurrCorrKB(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepSumVoltCorrKB(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入电池总电压校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteExtEepSumVoltCorrKB(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepPreVoltCorrKB(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入预充电压校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteExtEepPreVoltCorrKB(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepLoaVoltCorrKB(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入负载电压校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteExtEepLoaVoltCorrKB(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepPosVoltCorrKB(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入Link+电压校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteExtEepPosVoltCorrKB(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepNegVoltCorrKB(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入Link-电压校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteExtEepNegVoltCorrKB(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepSysClock(u8 index, u16 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入系统时钟(北京时间)
** @The notes :
**===============================================================================================*/
u8 WriteExtEepSysClock(u8 index, u16 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepMonErrTime(u8 index, u16 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入月历史故障统计时间(年月)
** @The notes :
**===============================================================================================*/
u8 WriteExtEepMonErrTime(u8 index, u16 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepChgTimesState(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入充放电次数检测状态
** @The notes :
**===============================================================================================*/
u8 WriteExtEepChgTimesState(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepCapEnerCorrInfo(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入总容量总能量自动标定信息信息
** @The notes :
**===============================================================================================*/
u8 WriteExtEepCapEnerCorrInfo(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepCapFormInfo(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入电量计算结构信息
** @The notes :
**===============================================================================================*/
u8 WriteExtEepCapFormInfo(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepEnerFormInfo(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入电能计算结构信息
** @The notes :
**===============================================================================================*/
u8 WriteExtEepEnerFormInfo(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepSysRunTime(u8 index, u16 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入系统运行(上电)时长 1Hour
** @The notes :
**===============================================================================================*/
u8 WriteExtEepSysRunTime(u8 index, u16 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepChgDhgTimes(u8 index, u16 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入充放电次数
** @The notes :
**===============================================================================================*/
u8 WriteExtEepChgDhgTimes(u8 index, u16 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepHisErrNum(u8 index, u16 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入历史故障告警数目
** @The notes :
**===============================================================================================*/
u8 WriteExtEepHisErrNum(u8 index, u16 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepDODStaInfo(u8 index, u16 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入放电深度统计信息
** @The notes :
**===============================================================================================*/
u8 WriteExtEepDODStaInfo(u8 index, u16 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepHisChgDhgCap(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入累计充放电电量 1AH
** @The notes :
**===============================================================================================*/
u8 WriteExtEepHisChgDhgCap(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepHisChgDhgEner(u8 index, u32 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入累计充放电电能 0.1kWh
** @The notes :
**===============================================================================================*/
u8 WriteExtEepHisChgDhgEner(u8 index, u32 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepGroupGenParaInfo(u8 index, u16 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入电池组主控通用参数信息
** @The notes :
**===============================================================================================*/
u8 WriteExtEepGroupGenParaInfo(u8 index, u16 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepGroupHigParaInfo(u8 index, u16 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入电池组主控高级参数信息
** @The notes :
**===============================================================================================*/
u8 WriteExtEepGroupHigParaInfo(u8 index, u16 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepGroupHWParaInfo(u8 index, u8 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入电池组主控硬件参数信息
** @The notes :
**===============================================================================================*/
u8 WriteExtEepGroupHWParaInfo(u8 index, u8 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepSystemWorkMode(u8 index, u16 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入系统工作模式信息
** @The notes :
**===============================================================================================*/
u8 WriteExtEepSystemWorkMode(u8 index, u16 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepSystemGenParaInfo(u8 index, u16 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入系统设备通用参数信息
** @The notes :
**===============================================================================================*/
u8 WriteExtEepSystemGenParaInfo(u8 index, u16 data);

/*=================================================================================================
** @Name      : u8 WriteExtEepSystemHWParaInfo(u8 index, u16 data)
** @Input     : index:参数索引 data:需要写入的数据
** @Output    : 写入成功或失败
** @Function  : 向外部EEPROM写入系统设备硬件参数信息
** @The notes :
**===============================================================================================*/
u8 WriteExtEepSystemHWParaInfo(u8 index, u16 data);
#endif

#endif
