/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : ParaRead.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 参数存储模块读写参数初始化
** @Instructions : 
**===============================================================================================*/
#ifndef _PARAREAD_H
#define _PARAREAD_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u8 ParaReadStoreDataByte(u16 addr, u8 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取指定长度字节数
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreDataByte(u16 addr, u8 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreDevSerial(u8 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取电流零飘修正值初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreDevSerial(u8 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreCorrZeroCurr(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取电流零飘修正值初始化(有符号,单位10mA)
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreCorrZeroCurr(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreHalChgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取霍尔充电电流校准KB值初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreHalChgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreHalDhgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取霍尔放电电流校准KB值初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreHalDhgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreShuChgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取分流器充电电流校准KB值初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreShuChgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreShuDhgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取分流器放电电流校准KB值初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreShuDhgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreSumVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取电池总电压校准KB值初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreSumVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStorePreVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取预充电压校准KB值初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStorePreVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreLoaVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取预负载压校准KB值初始化
** @The notes : 读取先后顺序:内部EEPROM->外部EEPROM->内部FLASH
**===============================================================================================*/
u8 ParaReadStoreLoaVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStorePosVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取Link+电压校准KB值初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStorePosVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreNegVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取Link-电压校准KB值初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreNegVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreSysClock(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取系统时钟(北京时间)初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreSysClock(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreMonErrTime(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取月故障统计时间(年月)初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreMonErrTime(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreNowCapSoh(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取当前容量SOH值初始化
** @The notes : 读取先后顺序:内部EEPROM->外部EEPROM->内部FLASH
**===============================================================================================*/
u8 ParaReadStoreNowCapSoh(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreChgTimesState(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取充放电次数检测状态初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreChgTimesState(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreCapEnerCorrInfo(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取总容量总能量自动标定信息初始化
** @The notes : 读取先后顺序:内部EEPROM->外部EEPROM->内部FLASH
**===============================================================================================*/
u8 ParaReadStoreCapEnerCorrInfo(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreCapFormInfo(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取电量计算结构信息初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreCapFormInfo(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreCapFormInfo(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取电能计算结构信息初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreEnerFormInfo(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreSysRunTime(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取系统运行(上电)时长初始化 1Hour
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreSysRunTime(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreChgDhgTimes(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function(u: 从存储区读取充放电次数初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreChgDhgTimes(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreHisErrNum(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取历史故障告警数目初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreHisErrNum(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreDODStaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取放电深度统计信息初始化
** @The notes : 读取先后顺序:内部EEPROM->外部EEPROM->内部FLASH
**===============================================================================================*/
u8 ParaReadStoreDODStaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreSOSStaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取安全等级SOS统计信息初始化
** @The notes : 读取先后顺序:内部EEPROM->外部EEPROM->内部FLASH
**===============================================================================================*/
u8 ParaReadStoreSOSStaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreHisChgDhgCap(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取累计充放电电量初始化 1AH
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreHisChgDhgCap(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreHisChgDhgEner(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取累计充放电电能初始化 0.1kWh
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreHisChgDhgEner(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreGroupGenParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取电池组主控通用参数信息初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreGroupGenParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreGroupHigParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取电池组主控高级参数信息初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreGroupHigParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreGroupHWParaInfo(u8 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取电池组主控硬件参数信息初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreGroupHWParaInfo(u8 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreSystemWorkMode(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取系统工作模式
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreSystemWorkMode(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreSystemGenParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取系统通用参数信息初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreSystemGenParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ParaReadStoreSystemHWParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从存储区读取系统硬件参数信息初始化
** @The notes : 读取先后顺序:内部EEPROM->内部EEPROM->外部FLASH
**===============================================================================================*/
u8 ParaReadStoreSystemHWParaInfo(u16 *data, u8 len);

#endif
