/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : ParaIntEep.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 参数存储模块读写内部EEPROM参数
** @Instructions : 
**===============================================================================================*/
#ifndef _PARAINTEEP_H
#define _PARAINTEEP_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u8 ReadIntEepDevSerial(u8 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取电流零飘修正值
** @The notes :
**===============================================================================================*/
u8 ReadIntEepDevSerial(u8 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepCorrZeroCurr(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取电流零飘修正值(有符号,单位10mA)
** @The notes :
**===============================================================================================*/
u8 ReadIntEepCorrZeroCurr(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepHalChgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取霍尔充电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntEepHalChgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepHalDhgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取霍尔放电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntEepHalDhgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepShuChgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取分流器充电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntEepShuChgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepShuDhgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取分流器放电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntEepShuDhgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepSumVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取电池总电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntEepSumVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepPreVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取预充电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntEepPreVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepLoaVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取负载电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntEepLoaVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepPosVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取Link+电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntEepPosVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepNegVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取Link-电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntEepNegVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepSysClock(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取系统时钟(北京时间)
** @The notes :
**===============================================================================================*/
u8 ReadIntEepSysClock(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepMonErrTime(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取月故障数目统计时间(年月)
** @The notes :
**===============================================================================================*/
u8 ReadIntEepMonErrTime(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepNowCapSoh(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取当前总容量SOH值
** @The notes :
**===============================================================================================*/
u8 ReadIntEepNowCapSoh(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepChgTimesState(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取充放电次数检测状态
** @The notes :
**===============================================================================================*/
u8 ReadIntEepChgTimesState(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepCapEnerCorrInfo(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取总容量总能量自动标定信息值
** @The notes :
**===============================================================================================*/
u8 ReadIntEepCapEnerCorrInfo(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepCapFormInfo(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取电量计算结构信息
** @The notes :
**===============================================================================================*/
u8 ReadIntEepCapFormInfo(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepCapFormInfo(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取电能计算结构信息
** @The notes :
**===============================================================================================*/
u8 ReadIntEepEnerFormInfo(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepSysRunTime(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取系统运行(上电)时长 1Hour
** @The notes :
**===============================================================================================*/
u8 ReadIntEepSysRunTime(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepChgDhgTimes(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取充放电次数
** @The notes :
**===============================================================================================*/
u8 ReadIntEepChgDhgTimes(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepHisErrNum(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取历史故障告警数目
** @The notes :
**===============================================================================================*/
u8 ReadIntEepHisErrNum(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepDODStaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取放电深度DOD统计信息
** @The notes :
**===============================================================================================*/
u8 ReadIntEepDODStaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepSOSStaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取安全等级SOS统计信息
** @The notes :
**===============================================================================================*/
u8 ReadIntEepSOSStaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepHisChgDhgCap(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取累计充放电电量 1AH
** @The notes :
**===============================================================================================*/
u8 ReadIntEepHisChgDhgCap(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepHisChgDhgEner(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取累计充放电电能 0.1kWh
** @The notes :
**===============================================================================================*/
u8 ReadIntEepHisChgDhgEner(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepGroupGenParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取电池组主控通用参数信息
** @The notes :
**===============================================================================================*/
u8 ReadIntEepGroupGenParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepGroupHigParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取电池组主控高级参数信息
** @The notes :
**===============================================================================================*/
u8 ReadIntEepGroupHigParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepGroupHWParaInfo(u8 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取电池组主控高级参数信息
** @The notes :
**===============================================================================================*/
u8 ReadIntEepGroupHWParaInfo(u8 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepSystemWorkMode(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取系统工作模式
** @The notes :
**===============================================================================================*/
u8 ReadIntEepSystemWorkMode(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepSystemGenParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取系统通用参数信息
** @The notes :
**===============================================================================================*/
u8 ReadIntEepSystemGenParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntEepSystemHWParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部EEPROM读取系统设备硬件参数信息
** @The notes :
**===============================================================================================*/
u8 ReadIntEepSystemHWParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepDevSerial(u8 index, u8 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入设备序列号
** @The notes :
**===============================================================================================*/
u8 WriteIntEepDevSerial(u8 index, u8 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepCorrZeroCurr(u8 index, u16 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入电流零飘修正值
** @The notes :
**===============================================================================================*/
u8 WriteIntEepCorrZeroCurr(u8 index, u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepHalChgCurrCorrKB(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入霍尔充电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteIntEepHalChgCurrCorrKB(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepHalDhgCurrCorrKB(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入霍尔放电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteIntEepHalDhgCurrCorrKB(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepShuChgCurrCorrKB(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入分流器充电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteIntEepShuChgCurrCorrKB(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepShuDhgCurrCorrKB(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入分流器放电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteIntEepShuDhgCurrCorrKB(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepSumVoltCorrKB(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入电池总电压校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteIntEepSumVoltCorrKB(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepPreVoltCorrKB(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入预充电压校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteIntEepPreVoltCorrKB(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepLoaVoltCorrKB(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入负载电压校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteIntEepLoaVoltCorrKB(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepPosVoltCorrKB(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入Link+电压校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteIntEepPosVoltCorrKB(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepNegVoltCorrKB(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入Link-电压校准KB值
** @The notes :
**===============================================================================================*/
u8 WriteIntEepNegVoltCorrKB(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepSysClock(u8 index, u16 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入系统时钟(北京时间)
** @The notes :
**===============================================================================================*/
u8 WriteIntEepSysClock(u8 index, u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepMonErrTime(u8 index, u16 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入月历史故障统计时间(年月)
** @The notes :
**===============================================================================================*/
u8 WriteIntEepMonErrTime(u8 index, u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepNowCapSoh(u8 index, u16 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入当前总容量SOH
** @The notes :
**===============================================================================================*/
u8 WriteIntEepNowCapSoh(u8 index, u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepChgTimesState(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入充放电次数检测状态
** @The notes :
**===============================================================================================*/
u8 WriteIntEepChgTimesState(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepCapEnerCorrInfo(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入总容量总能量自动标定信息值
** @The notes :
**===============================================================================================*/
u8 WriteIntEepCapEnerCorrInfo(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepCapFormInfo(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入电量计算结构信息
** @The notes :
**===============================================================================================*/
u8 WriteIntEepCapFormInfo(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepEnerFormInfo(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入电能计算结构信息
** @The notes :
**===============================================================================================*/
u8 WriteIntEepEnerFormInfo(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepSysRunTime(u8 index, u16 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入系统运行(上电)时长 1Hour
** @The notes :
**===============================================================================================*/
u8 WriteIntEepSysRunTime(u8 index, u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepChgDhgTimes(u8 index, u16 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入充放电次数
** @The notes :
**===============================================================================================*/
u8 WriteIntEepChgDhgTimes(u8 index, u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepHisErrNum(u8 index, u16 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入历史故障告警数目
** @The notes :
**===============================================================================================*/
u8 WriteIntEepHisErrNum(u8 index, u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepDODStaInfo(u8 index, u16 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入放电深度DOD统计信息
** @The notes :
**===============================================================================================*/
u8 WriteIntEepDODStaInfo(u8 index, u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepSOSStaInfo(u8 index, u16 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入安全等级SOS统计信息
** @The notes :
**===============================================================================================*/
u8 WriteIntEepSOSStaInfo(u8 index, u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepHisChgDhgCap(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入累计充放电电量 1AH
** @The notes :
**===============================================================================================*/
u8 WriteIntEepHisChgDhgCap(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepHisChgDhgEner(u8 index, u32 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入累计充放电电能 0.1kWh
** @The notes :
**===============================================================================================*/
u8 WriteIntEepHisChgDhgEner(u8 index, u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepGroupGenParaInfo(u8 index, u16 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入电池组主控通用参数信息
** @The notes :
**===============================================================================================*/
u8 WriteIntEepGroupGenParaInfo(u8 index, u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepGroupHigParaInfo(u8 index, u16 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入电池组主控高级参数信息
** @The notes :
**===============================================================================================*/
u8 WriteIntEepGroupHigParaInfo(u8 index, u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepGroupHWParaInfo(u8 index, u8 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入电池组主控硬件参数信息
** @The notes :
**===============================================================================================*/
u8 WriteIntEepGroupHWParaInfo(u8 index, u8 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepSystemWorkMode(u8 index, u16 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入系统工作模式信息
** @The notes :
**===============================================================================================*/
u8 WriteIntEepSystemWorkMode(u8 index, u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepSystemGenParaInfo(u8 index, u8 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入系统设备通用参数信息
** @The notes :
**===============================================================================================*/
u8 WriteIntEepSystemGenParaInfo(u8 index, u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 WriteIntEepSystemHWParaInfo(u8 index, u8 *data, u8 len)
** @Input     : index:参数索引 data:需要写入的数据 len:写入数据长度(个数)
** @Output    : 写入成功或失败
** @Function  : 向内部EEPROM写入系统设备硬件参数信息
** @The notes :
**===============================================================================================*/
u8 WriteIntEepSystemHWParaInfo(u8 index, u16 *data, u8 len);

#endif
