/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : ParaCopy.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 参数存储模块备份参数
** @Instructions : 
**===============================================================================================*/
#ifndef _PARACOPY_H
#define _PARACOPY_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/
#define PARA_COPY_PARA_LEN                  (104)        	    /*参数备份一次读写参数长度[FLASH要求地址和长度必须是8的倍数]*/
#define PARA_COPY_EXTEEP_PAG_SIZE           (128)        	    /*参数备份外部EEPROM一页大小[外部EEP不能跨页写]*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void ParaStoreCopyTask(void)
** @Input     : void
** @Output    : void
** @Function  : 参数存储备份任务
** @The notes : 100ms周期调用
**===============================================================================================*/
void ParaStoreCopyTask(void);

/*=================================================================================================
** @Name      : void ParaSetEepCopyReqFlag(u16 addr, u16 len, u8 flag)
** @Input     : addr:需备份的EEPROM起始地址 len:备份地址长度 flag:立即备份标志(0延时备份 1立即备份)
** @Output    : void
** @Function  : 设置EEPROM参数备份请求标志
** @The notes : 根据地址设置需要备份的扇区和记录备份时间
**===============================================================================================*/
void ParaSetEepCopyReqFlag(u16 addr, u16 len, u8 flag);

/*=================================================================================================
** @Name      : void ParaSetFlashCopyReqFlag(u16 addr, u8 flag)
** @Input     : addr:需备份的EEPROM地址  flag:立即备份标志(0延时备份 1立即备份)
** @Output    : void
** @Function  : 设置FLASH参数备份请求标志
** @The notes : 根据地址设置需要备份的扇区和记录备份时间
**===============================================================================================*/
void ParaSetFlashCopyReqFlag(u16 addr, u8 flag);

#endif
