/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : ParaIntFlash.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 参数存储模块读写内部FLASH参数
** @Instructions : 
**===============================================================================================*/
#ifndef _PARAINTFLASH_H
#define _PARAINTFLASH_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u8 ReadIntFlashDevSerial(u8 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取电流零飘修正值
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashDevSerial(u8 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashCorrZeroCurr(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取电流零飘修正值(有符号,单位10mA)
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashCorrZeroCurr(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashHalChgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取霍尔充电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashHalChgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashDhgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取霍尔放电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashHalDhgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashShuChgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取分流器充电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashShuChgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashShuDhgCurrCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取分流器放电电流校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashShuDhgCurrCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashSumVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取电池总电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashSumVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashPreVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取预充电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashPreVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashLoaVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取负载电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashLoaVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashPosVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取Link+电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashPosVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashNegVoltCorrKB(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取Link-电压校准KB值
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashNegVoltCorrKB(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashSysClock(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取系统时钟(北京时间)
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashSysClock(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashMonErrTime(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取月故障统计时间(年月)
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashMonErrTime(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashNowCapSoh(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取当前总容量SOH值
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashNowCapSoh(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashChgTimesState(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取充放电次数检测状态
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashChgTimesState(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashCapEnerCorrInfo(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取总容量总能量自动标定信息值
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashCapEnerCorrInfo(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashCapFormInfo(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取电量计算结构信息
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashCapFormInfo(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashCapFormInfo(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取电能计算结构信息
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashEnerFormInfo(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashSysRunTime(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取系统运行(上电)时长 1Hour
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashSysRunTime(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashChgDhgTimes(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取充放电次数
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashChgDhgTimes(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashHisErrNum(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取历史故障告警数目
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashHisErrNum(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashDODStaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取放电深度DOD统计信息
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashDODStaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashSOSStaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取安全等级SOS统计信息
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashSOSStaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashHisChgDhgCap(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取累计充放电电量 1AH
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashHisChgDhgCap(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashHisChgDhgEner(u32 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取累计充放电电能 0.1kWh
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashHisChgDhgEner(u32 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashGroupGenParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取电池组主控通用参数信息
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashGroupGenParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashGroupHigParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取电池组主控高级参数信息
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashGroupHigParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashGroupHWParaInfo(u8 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取电池组主控高级参数信息
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashGroupHWParaInfo(u8 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashSystemWorkMode(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部FLASH读取系统工作模式
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashSystemWorkMode(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashSystemGenParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部Flash读取系统通用参数信息
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashSystemGenParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u8 ReadIntFlashSystemHWParaInfo(u16 *data, u8 len)
** @Input     : data:读取到的数据 len:读取长度
** @Output    : 读取成功或失败
** @Function  : 从内部Flash读取系统设备硬件参数信息
** @The notes :
**===============================================================================================*/
u8 ReadIntFlashSystemHWParaInfo(u16 *data, u8 len);

/*=================================================================================================
** @Name      : u32 ParaChangEepToFlashAddr(u16 addr)
** @Input     : addr:参数EEPROM地址
** @Output    : 参数对应FLASH备份地址
** @Function  : 将参数EEPROM地址转化为FLASH地址
** @The notes :
**===============================================================================================*/
u32 ParaChangEepToFlashAddr(u16 addr);

#endif
