/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : BSPEEPROM.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : EEPROM驱动函数模块
** @Instructions :
**===========================================================================================*/
#ifndef _BSPEERPOM_H
#define _BSPEERPOM_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define EEPROM_ADDR_START     0x14000000			//EEPROM起始地址

#define EEPROM_ADDR_SIZE       (4096)               //EEPROM大小(4K)

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : u8 BSPINTEEPInit(u8 oscClock)
** @Input     : oscClock:晶振时钟
** @Output    : 初始化结果 TRUE:成功 FALSE:失败
** @Function  : 内部EEPROM驱动模块初始化
** @The notes :
**===========================================================================================*/
u8 BSPINTEEPInit(u8 oscClock);

/*=============================================================================================
** @Name      : u8 BSPINTEEPWriteByte(u32 addr, u8 *pData, u32 len)
** @Input     : addr:写入EEPROM地址([0,4095](4K) *pData:写入数据指针 len:写入数据的个数
** @Output    : TRUE:成功 FALSE:失败
** @Function  : Eeprom按字节方式写入数据(8位)
** @The notes :
**===========================================================================================*/
u8 BSPINTEEPWriteByte(u32 addr, u8 *pData, u32 len);

/*=============================================================================================
** @Name      : u8 BSPINTEEPWriteWord(u32 addr, u16 *pData, u32 len)
** @Input     : addr:写入EEPROM地址([0,4095](4K) *pData:写入数据指针 len:写入数据的个数
** @Output    : TRUE:成功 FALSE:失败
** @Function  : Eeprom按字方式写入数据(16位)
** @The notes : len必须是4的整数倍
**===========================================================================================*/
u8 BSPINTEEPWriteWord(u32 addr, u16 *pData, u32 len);

/*=============================================================================================
** @Name      : u8 BSPINTEEPWriteLong(u32 addr, u32 *pData, u32 len)
** @Input     : addr:写入EEPROM地址([0,4095](4K) *pData:写入数据指针 len:写入数据的个数
** @Output    : TRUE:成功 FALSE:失败
** @Function  : Eeprom按双字方式写入数据(32位)
** @The notes :
**===========================================================================================*/
u8 BSPINTEEPWriteLong(u32 addr, u32 *pData, u32 len);

/*=============================================================================================
** @Name      : u8 BSPINTEEPReadByte(u32 addr, u8 *pData, u32 len)
** @Input     : addr:读取EEPROM地址([0,4095](4K) *pData:读出的数据指针 len:读取数据的个数
** @Output    : TRUE:成功 FALSE:失败
** @Function  : Eeprom按字节方式读出数据
** @The notes :
**===========================================================================================*/
u8 BSPINTEEPReadByte(u32 addr, u8 *pData, u32 len);

/*=============================================================================================
** @Name      : u8 BSPINTEEPReadWord(u32 addr, u16 *pData, u32 len)
** @Input     : addr:读取EEPROM地址([0,4095](4K) *pData:读出的数据指针 len:读取数据的个数
** @Output    : TRUE:成功 FALSE:失败
** @Function  : Eeprom按字方式读出数据
** @The notes :
**===========================================================================================*/
u8 BSPINTEEPReadWord(u32 addr, u16 *pData, u32 len);

/*=============================================================================================
** @Name      : u8 BSPINTEEPReadLong(u32 addr, u32 *pData, u32 len)
** @Input     : addr:读取EEPROM地址([0,4095](4K) *pData:读出的数据指针 len:读取数据的个数
** @Output    : TRUE:成功 FALSE:失败
** @Function  : Eeprom按双字方式读出数据
** @The notes :
**===========================================================================================*/
u8 BSPINTEEPReadLong(u32 addr, u32 *pData, u32 len);

#endif
