/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : BSPI2C.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : IIC驱动函数模块
** @Instructions : IIC用模拟IIC可靠性较高,不驱动片内IIC模块
**===========================================================================================*/
#ifndef _BSPI2C_H
#define _BSPI2C_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "status.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
/*IIC通道定义*/
typedef enum 
{ 
    eIIC0 = 0,
    eIIC1 = 1,
    
    eIICNUM
}e_I2CNum;

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : u8 BSPI2CInit(e_I2CNum i2cNum)
** @Input     : I2CNum: I2C通道号
** @Output    : 初始化结果 TRUE:成功 FALSE:失败
** @Function  : I2C驱动模块初始化
** @The notes : 接口服务层调用，上电初始化
**===========================================================================================*/
u8 BSPI2CInit(e_I2CNum i2cNum);

/*=============================================================================================
** @Name      : u8 BSPI2CMasterSendData(e_I2CNum sciNum, u8 *sendbuf, u8 size)
** @Input     : i2cNum: i2c通道号   *sendbuf:发送的数据   size:数据长度
** @Output    : TRUE:成功 FALSE:失败
** @Function  : i2c主机模式发送数据
** @The notes : 直接发送,用户调用
**===========================================================================================*/
u8 BSPI2CMasterSendData(e_I2CNum i2cNum, u8 *sendbuf, u8 size);

/*=============================================================================================
** @Name      : u8 BSPI2CMasterReceiveData(e_I2CNum i2cNum, u8 *rxbuf, u8 size)
** @Input     : i2cNum: i2c通道号   *sendbuf:发送的数据   size:数据长度
** @Output    : TRUE:成功 FALSE:失败
** @Function  : i2c主机模式接收数据
** @The notes : 直接发送,用户调用
**===========================================================================================*/
u8 BSPI2CMasterReceiveData(e_I2CNum i2cNum, u8 *rxbuf, u8 size);

/*=============================================================================================
** @Name      : status_t BSPGetI2CMasterTransferStatus(e_I2CNum i2cNum, u32 bytesRemaining)
** @Input     : i2cNum: i2c通道号
** @Output    : TRUE:成功 FALSE:失败
** @Function  : 获取i2c主机模式数据状态
** @The notes : 用户调用
**===========================================================================================*/
status_t BSPGetI2CMasterTransferStatus(e_I2CNum i2cNum, u32 bytesRemaining);

#endif

