/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : MbClient.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : Modbus通信包客户端处理函数
** @Instructions :
**===============================================================================================*/
#ifndef _MBCLIENT_H
#define _MBCLIENT_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void MbClientTimerTask(void)
** @Input     : void
** @Output    : void
** @Function  : 客户端(主机)请求任务定时器
** @The notes : 1ms调用周期调用一次
**===============================================================================================*/
void MbClientTimerTask(void);

/*=================================================================================================
** @Name      : u8 MbClientBuildReadReqAPI(u8 stationID, u8 fncCode, u16 address, u16 len, u8 port)
** @Input     : stationID:要读取的从站ID,fncCode:功能码(01读线圈/02读离散量输入/03读保持寄存器/04读输入寄存器),address:要读取的寄存器起始地址,len:要读取的寄存器数量长度,port:Modbus通道号
** @Output    : 创建请求插入队列结果 0:失败 1:成功
** @Function  : 客户端(主机)创建读请求并发送
** @The notes : 对应01/02/03/04功能码
**===============================================================================================*/
u8 MbClientBuildReadReqAPI(u8 stationID, u8 fncCode, u16 address, u16 len, u8 port);

/*=================================================================================================
** @Name      : u8 MbClientSendWriteSingReqAPI(u8 stationID, u8 fncCode, u16 address, u16 data, u8 port)
** @Input     : stationID:要写入的从站ID,fncCode:功能码(05写单线圈,06写单个寄存器),address:要写入的寄存器地址,data:要写入的数据,port:Modbus通道号
** @Output    : 创建请求插入队列结果:0:失败 1:成功
** @Function  : 客户端(主机)创建向指定单个线圈或寄存器写入给定值的写请求并发送
** @The notes : 对应05/06功能码
**===============================================================================================*/
u8 MbClientBuildWriteSingReqAPI(u8 stationID, u8 fncCode, u16 address, u16 data, u8 port);

/*=================================================================================================
** @Name      : u8 MbClientSendWriteMultReqAPI(u8 stationID, u16 address, u16 *data, u8 len, u8 port)
** @Input     : stationID:要写入的从站ID,address:要写入的寄存器起始地址,*data:要写入的数据序列首地址指针,len:要写的寄存器数量长度,port:Modbus通道号
** @Output    : 创建请求插入队列结果:0:失败 1:成功
** @Function  : 客户端(主机)创建向连续的寄存器中依次写入多个数据值的写请求并发送
** @The notes : 对应16功能码
**===============================================================================================*/
u8 MbClientBuildWriteMultReqAPI(u8 stationID, u16 address, u16 *data, u8 len, u8 port);

/*=================================================================================================
** @Name      : void MbClientReqAndRcvHandleAPI(u8 port)
** @Input     : port:Modbus通道号
** @Output    : void
** @Function  : 实现客户端(主机)的读写请求和接收处理
** @The notes :
**===============================================================================================*/
void MbClientReqAndRcvHandleAPI(u8 port);

/*=================================================================================================
** @Name      : u8 MbClientGetRcvUpdateFlagAPI(u8 port)
** @Input     : port:Modbus通道号
** @Output    : 接收应答数据更新标志 1:已更新,0:未更新
** @Function  : 获得客户端(主机)接收应答数据是否已更新到用户指定的空间中的标志
** @The notes : 客户端(主机)接收服务端(主机)应答完成标志
**===============================================================================================*/
u8 MbClientGetRcvUpdateFlagAPI(u8 port);

#endif


