/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : MbHandle.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : Modbus通信包规约处理接口
** @Instructions :
**===============================================================================================*/
#ifndef _MBHANDLE_H
#define _MBHANDLE_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "MbUserDef.h"

/*=================================================================================================
** @Global variable definition
**===============================================================================================*/
extern ModbusStation *modbusStation;//MB结构体数组

/*=================================================================================================
** @Macro definition
**===============================================================================================*/
//停止任务标识
#define STOPTASK			           	1  

//往请求队列中添加请求的返回信息
#define ADDUNSUCESSFULLY	        	0
#define ADDSUCESSFULLY		        	1
#define WRONGNUM                        2
#define WRONGFUNCTION                   3

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void ModbusStationInit(u8 port, u16 bps, u8 stationType, u8 stationID)
** @Input     : port:modbus通道,bps:波特率[4800，9600，19200，38400](配置相应的t1.5,t3.5),stationType:站点类型[0,2] stationID:从站地址[0,255]
** @Output    : void
** @Function  : 初始化并配置Modbus站点
** @The notes :
**===============================================================================================*/
void ModbusStationInit(u8 port, u16 bps, u8 stationType, u8 stationID);

/*=================================================================================================
** @Name      : void MbLibRcvDataHandleAPI(u8 port, u16 data)
** @Input     : port:modbus通道号 data:接收到的寄存器数据
** @Output    : void
** @Function  : Modbus通信包接收处理函数[判别是否一帧数据:连续两个字符的间隔时间小于t1.5则将当前寄存器数据存入接收缓冲区(同一帧数据)]
** @The notes : 串口接收函数处调用,注意串口号与通道号对应
**===============================================================================================*/
void MbLibRcvDataHandleAPI(u8 port, u16 data);

/*=================================================================================================
** @Name      : void ModbusRcvTickTask(void)
** @Input     : void
** @Output    : void
** @Function  : Modbus帧接收定时处理函数
** @The notes : 0.1ms周期调用一次
**===============================================================================================*/
void ModbusRcvTickTask(void);

/*=================================================================================================
** @Name      : void MbStationReqHandle(void *p)
** @Input     : *p:输入参数
** @Output    : void
** @Function  : Modbus站收发请求处理
** @The notes :
**===============================================================================================*/
void MbStationReqHandle(void *p);

/*=================================================================================================
** @Name      : void MbClientStartReqPrcTask(u8 port)
** @Input     : port:modbus通道号
** @Output    : void
** @Function  : 客户端(主机)启动请求处理任务
** @The notes : 当主机空闲且有请求数据时启动
**===============================================================================================*/
void MbClientStartReqPrcTask(u8 port);

/*=================================================================================================
** @Name      : void MbClrStationRcvBuffer(u8 port)
** @Input     : port:modbus通道号
** @Output    : u8
** @Function  : 清空modbus接收通道缓冲区
** @The notes : 主机或从机
**===============================================================================================*/
void MbClrStationRcvBuffer(u8 port);

/*=================================================================================================
** @Name      : u16 MbCalcCRC16Code(u8 *pData, u8 len)
** @Input     : pData:指向需要计算CRC的数据指针 len:要计算CRC的数据长度
** @Output    : 16位CRC效验码(低位在前)
** @Function  : 计算CRC效验码
** @The notes : 低字节在前
**===============================================================================================*/
u16 MbCalcCRC16Code(u8 *pData, u8 len);

#endif


