/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : MbQueue.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : Modbus通信包队列定义模块
**===============================================================================================*/
#ifndef _MBQUEUE_H
#define _MBQUEUE_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/

/*=================================================================================================
** @Macro definition
**===============================================================================================*/
#define MB_QUE_SIZEOF(size, num)	(size * num + 6)		/*队列大小计算*/
#define MB_QUE_CTRLFLAG(P)			(*((u16*)P))			/*队列标志*/
#define MB_QUE_UNITSIZE(P)		    (*((u16*)P+1)) 			/*队列元素长度标志*/
#define MB_QUE_UNITNUM(P)			(*((u16*)P+2))  		/*当前最大元素成员数目标志*/
#define MB_QUE_INPOINT(P)			(*((u16*)P+3)) 			/*插入点*/
#define MB_QUE_OUTPOINT(P)			(*((u16*)P+4)) 			/*取出点*/
#define MB_QUE_CURNUM(P)			(*((u16*)P+5)) 			/*当前队列成员数目*/
#define MB_QUEP_UNIT(P)				((u16*)P+6) 			/*第一个元素地址指针*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u8 MBQueInit(void* pQ, u16 unitSize, u16 unitNum)
** @Input     : pQ:队列地址指针，unitSize:单元大小，unitNum:单元数目
** @Output    : TRUE OR FALSE
** @Function  : 将pQ指向的地址初始化为队列
** @The notes : pQ分配的空间要和参数符合
**===============================================================================================*/
u8 MBQueInit(void* pQ, u8 unitSize, u8 unitNum);

/*=================================================================================================
** @Name      : u8 MBQueIn(void* pQ, void * pU)
** @Input     : pQ:队列指针，pU:待写入单元指针
** @Output    : 通信报文进入队列结果:TRUE OR FALSE
** @Function  : 将pu指向单元压入pQ队列
** @The notes :
**===============================================================================================*/
u8 MBQueIn(void* pQ, void * pU);

/*=================================================================================================
** @Name      : u8 MBQueOut(void* pQ, void * pU)
** @Input     : pQ:队列指针，pU:读出单元写入指针
** @Output    : TRUE OR FALSE
** @Function  : 将pQ中数据读出到pU中
** @The notes :
**===============================================================================================*/
u8 MBQueOut(void* pQ, void * pU);

/*=================================================================================================
** @Name      : u16 MBQueGetUnitNum(void * pQ)
** @Input     : pQ:队列指针
** @Output    : 当前队列长度
** @Function  : 获得当前队列长度
** @The notes :
**===============================================================================================*/
u16 MBQueGetUnitNum(void * pQ);

#endif

