/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : BSPISRHook.h
** @Founder      : ZSY342
** @Date         : 2019.10.1
** @Function     : BSP中断服务函数模块
** @Instructions : 用户完善
**===========================================================================================*/
#ifndef _BSPISRHOOK_H
#define _BSPISRHOOK_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPUserAPI.h"
#include "BSPFTM.h"
#include "BSPSPI.h"
#include "BSPI2C.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void SysTick_ISR_Hook(void)
** @Input     : void
** @Output    : void
** @Function  : 系统闹铃定时中断HOOK
** @The notes :
**===========================================================================================*/
void SysTick_ISR_Hook(void);

/*=============================================================================================
** @Name      : void Time_ISR_Hook(e_FTMNum Channel)
** @Input     : Channel:TIM通道[eTIM1, eTIM3]
** @Output    : void
** @Function  : 定时中断HOOK
** @The notes : eFIM0用于PWM,不能使用
**===========================================================================================*/
void Time_ISR_Hook(e_FTMNum Channel);

/*=============================================================================================
** @Name      : void SPI_ISR_Hook(e_SPINum SPINum)
** @Input     : SPINum:SPI通道
** @Output    : void
** @Function  : SPI中断处理HOOK
** @The notes :
**===========================================================================================*/
void SPI_ISR_Hook(e_SPINum SPINum);

/*=============================================================================================
** @Name      : void CAN_ISR_Err_Hook(e_CANNUM CANNum)
** @Input     : CANNum:CAN通道
** @Output    : void
** @Function  : CAN错误中断处理HOOK
** @The notes :
**===========================================================================================*/
void CAN_ISR_Err_Hook(e_CANNUM CANNum);

/*=============================================================================================
** @Name      : void CAN_ISR_Send_Hook(e_CANNUM CANNum)
** @Input     : CANNum:CAN通道
** @Output    : void
** @Function  : CAN发送中断处理HOOK
** @The notes :
**===========================================================================================*/
void CAN_ISR_Send_Hook(e_CANNUM CANNum);

/*=============================================================================================
** @Name      : void CAN_ISR_Rcv_Hook(e_CANNUM CANNum)
** @Input     : CANNum:CAN通道
** @Output    : void
** @Function  : CAN接收中断处理HOOK
** @The notes :
**===========================================================================================*/
void CAN_ISR_Rcv_Hook(e_CANNUM CANNum);

/*=============================================================================================
** @Name      : void SCI_ISR_Send_Hook(e_SCINUM SCINum)
** @Input     : SCINum:SCI通道
** @Output    : void
** @Function  : SCI发送中断处理HOOK
** @The notes :
**===========================================================================================*/
void SCI_ISR_Send_Hook(e_SCINUM SCINum);

/*=============================================================================================
** @Name      : void SCI_ISR_Rcv_Hook(e_SCINUM SCINum)
** @Input     : SCINum:SCI通道
** @Output    : void
** @Function  : SCI接收中断处理HOOK
** @The notes :
**===========================================================================================*/
void SCI_ISR_Rcv_Hook(e_SCINUM SCINum);

/*=============================================================================================
** @Name      : void IIC_ISR_Send_Hook(e_I2CNum IICNum)
** @Input     : IICNum:IIC通道
** @Output    : void
** @Function  : IIC发送中断处理HOOK
** @The notes :
**===========================================================================================*/
void IIC_ISR_Send_Hook(e_I2CNum IICNum);

/*=============================================================================================
** @Name      : void IIC_ISR_Rcv_Hook(e_I2CNum IICNum)
** @Input     : IICNum:IIC通道
** @Output    : void
** @Function  : IIC接收中断处理HOOK
** @The notes :
**===========================================================================================*/
void IIC_ISR_Rcv_Hook(e_I2CNum IICNum);

/*=============================================================================================
** @Name      : void PWM_ISR_Rcv_Hook(u16 duty, u32 frequency)
** @Input     : 捕获到的数据:duty:占空比 % frequency:PWM频率 Hz
** @Output    : void
** @Function  : PWM波捕获用户接收中断处理
** @The notes :
**===========================================================================================*/
void PWM_ISR_Rcv_Hook(u16 duty, u32 frequency);

#endif
