/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : OSUseBSPUserHookrHOOK.h
** @Founder      : ZSY342
** @Date         : 2019.10.1
** @Function     : BSP用户服务函数模块
** @Instructions : 用户完善
**===========================================================================================*/
#ifndef _BSPUSERHOOK_H
#define _BSPUSERHOOK_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPUserAPI.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void CANSendData_Hook(e_CANNUM CANNum, t_CANMSG msg)
** @Input     : CANNum:CAN通道 msg:报文信息
** @Output    : void
** @Function  : CAN发送任务嵌入函数
** @The notes :
**===========================================================================================*/
void CANSendData_Hook(e_CANNUM CANNum, t_CANMSG msg);

/*=============================================================================================
** @Name      : void CANRcvMsgHandle_Hook(e_CANNUM CANNum, t_CANMSG *pWriteMsg)
** @Input     : CANNum:CAN通道 pWriteMsg:CAN报文信息结构指针
** @Output    : void
** @Function  : CAN接收信息处理接口
** @The notes : 该函数已经在读CAN接收缓冲区调用
**===========================================================================================*/
void CANRcvMsgHandle_Hook(e_CANNUM CANNum, t_CANMSG *pWriteMsg);

/*=============================================================================================
** @Name      : void SCIRcvMsgHandle_Hook(e_SCINUM SCINum, u8 rcvData)
** @Input     : SCINum:SCI通道 rcvMsg:接收到的数据
** @Output    : void
** @Function  : SCI接收信息处理接口
** @The notes :
**===========================================================================================*/
void SCIRcvMsgHandle_Hook(e_SCINUM SCINum, u8 rcvData);

#endif
