/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : HigVoltCorr.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 高压校准模块
** @Instructions : 
**===============================================================================================*/
#ifndef _HIGVOLTCORR_H
#define _HIGVOLTCORR_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/
#define HV_CORR_BLOWUP          1000                //放大倍数
#define HV_CORR_FIL_T           5                   //滤波次数

/*=================================================================================================
** @Data type definition
**===============================================================================================*/
typedef enum                                /*高压校准类型*/
{
    eHVCorr_SumVS = 0,                      /*电池总压单点校准*/
    eHVCorr_SumVD = 1,                      /*电池总压双点校准*/
    eHVCorr_PreVS = 2,                      /*预充电压单点校准*/
    eHVCorr_PreVD = 3,                      /*预充电压双点校准*/
    eHVCorr_LoaVS = 4,                      /*负载电压单点校准*/
    eHVCorr_LoaVD = 5,                      /*负载电压双点校准*/
    eHVCorr_PosVS = 6,                      /*Link+电压单点校准*/
    eHVCorr_PosVD = 7,                      /*Link+电压双点校准*/
    eHVCorr_NegVS = 8,                      /*Link-电压单点校准*/
    eHVCorr_NegVD = 9,                      /*Link-电压双点校准*/
}e_HVCorrType;

typedef enum                                /*高压校准值序号*/
{
	eHVCorr_SumVK = 0,                      /*电池总压采样通道校准K值*/
	eHVCorr_SumVB,                          /*电池总压采样通道校准B值*/
	eHVCorr_PreVK,                          /*预充电压采样通道校准K值*/
	eHVCorr_PreVB,                          /*预充电压采样通道校准B值*/
	eHVCorr_LoaVK,                          /*负载电压采样通道校准K值*/
	eHVCorr_LoaVB,                          /*负载电压采样通道校准B值*/
	eHVCorr_PosVK,                          /*Link+电压采样通道校准K值*/
	eHVCorr_PosVB,                          /*Link+电压采样通道校准B值*/
	eHVCorr_NegVK,                          /*Link-电压采样通道校准K值*/
	eHVCorr_NegVB,                          /*Link-电压采样通道校准B值*/

}e_HVCorrValue;

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void HigVoltSampCorrInit(void)
** @Input     : void
** @Output    : void
** @Function  : 高压采样校准初始化
** @The notes :
**===============================================================================================*/
void HigVoltSampCorrInit(void);

/*=================================================================================================
** @Name      : void HigVoltSampCorrProcess(void)
** @Input     : void
** @Output    : void
** @Function  : 高压校准处理过程
** @The notes : 1s
**===============================================================================================*/
void HigVoltSampCorrProcess(void);

/*=================================================================================================
** @Name      : s32 CorrGetVoltCorrKBValue(e_HVCorrValue index)
** @Input     : index:高压校准KB值索引
** @Output    : 当前高压校准KB值(系数0.1)
** @Function  : 获取当前高压校准KB值
** @The notes : 放大1000(OC_CORR_BLOWUP)倍率后的值
**===============================================================================================*/
s32 CorrGetVoltCorrKBValue(e_HVCorrValue index);

/*=================================================================================================
** @Name      : u16 CorrRealSumVoltByKB(u32 volt)
** @Input     : volt:修正前实际高压值 10mV
** @Output    : 修正后实际电压  0.1V
** @Function  : 通过KB值修正实际电池总压采样值
** @The notes :
**===============================================================================================*/
u16 CorrRealSumVoltByKB(u32 volt);

/*=================================================================================================
** @Name      : u16 CorrRealPreVoltByKB(u32 volt)
** @Input     : volt:修正前实际高压值 10mV
** @Output    : 修正后实际电压  0.1V
** @Function  : 通过KB值修正实际预充电压采样值
** @The notes :
**===============================================================================================*/
u16 CorrRealPreVoltByKB(u32 volt);

/*=================================================================================================
** @Name      : u16 CorrRealLoaVoltByKB(u32 volt)
** @Input     : volt:修正前实际高压值 10mV
** @Output    : 修正后实际电压  0.1V
** @Function  : 通过KB值修正实际负载电压采样值
** @The notes :
**===============================================================================================*/
u16 CorrRealLoaVoltByKB(u32 volt);

/*=================================================================================================
** @Name      : u16 CorrRealLinkPosVoltByKB(u32 volt)
** @Input     : volt:修正前实际高压值 1mV
** @Output    : 修正后实际电压  1mV
** @Function  : 通过KB值修正实际Link+电压采样值
** @The notes :
**===============================================================================================*/
u16 CorrRealLinkPosVoltByKB(u32 volt);

/*=================================================================================================
** @Name      : u16 CorrRealLinkNegVoltByKB(u32 volt)
** @Input     : volt:修正前实际高压值 1mV
** @Output    : 修正后实际电压  1mV
** @Function  : 通过KB值修正实际Link-电压采样值
** @The notes :
**===============================================================================================*/
u16 CorrRealLinkNegVoltByKB(u32 volt);

/*=================================================================================================
** @Name      : void ClrEEPHVoltCorrKBInfo(u8 chan)
** @Input     : chan:高压通道 0:电池总压 1:预充电压 2:负载电压 3:link+电压 4:link-电压
** @Output    : void
** @Function  : 清除EEP高压采样校准KB值
** @The notes :
**===============================================================================================*/
void ClrEEPHVoltCorrKBInfo(u8 chan);

/*=================================================================================================
** @Name      : void RcdEEPHVoltCorrKBInfo(u8 chan)
** @Input     : chan:高压通道 0:电池总压 1:预充电压 2:负载电压 3:link+电压 4:link-电压
** @Output    : void
** @Function  : 记录高压校准KB值到EEP
** @The notes :
**===============================================================================================*/
void RcdEEPHVoltCorrKBInfo(u8 chan);

/*=================================================================================================
** @Name      : void UpdateHVoltCorrResult(void)
** @Input     : void
** @Output    : void
** @Function  : 更新高压校准结果
** @The notes : 根据校准标志位
**===============================================================================================*/
void UpdateHVoltCorrResult(void);

#endif
