/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : OutCurrCorr.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 电流校准模块
** @Instructions : 
**===============================================================================================*/
#ifndef _OUTCURRCORR_H
#define _OUTCURRCORR_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/
#define OC_CORR_BLOWUP          1000                //放大倍数
#define OC_CORR_FIL_T           5                   //滤波次数

/*=================================================================================================
** @Data type definition
**===============================================================================================*/
typedef enum                                /*电流校准类型*/
{
    eOCCorr_HalOutCS = 0,                   /*霍尔输出电流单点校准*/
    eOCCorr_HalOutCD = 1,                   /*霍尔输出电流双点校准*/
    eOCCorr_ShuChgCS = 2,                   /*分流器充电电流单点校准*/
    eOCCorr_ShuChgCD = 3,                   /*分流器充电电流双点校准*/
    eOCCorr_ShuDhgCS = 4,                   /*分流器放电电流单点校准*/
    eOCCorr_ShuDhgCD = 5,                   /*分流器放电电流双点校准*/

}e_OCCorrType;

typedef enum                                /*电流校准值序号*/
{
	eOCCorr_HalOutK = 0,                    /*霍尔电流采样通道校准K值*/
	eOCCorr_HalOutB,                        /*霍尔电流采样通道校准B值*/
	eOCCorr_ShuChgK,                        /*分流器充电电流采样通道校准K值*/
	eOCCorr_ShuChgB,                        /*分流器充电电流采样通道校准B值*/
	eOCCorr_ShuDhgK,                        /*分流器放电电流采样通道校准K值*/
	eOCCorr_ShuDhgB,                        /*分流器放电电流采样通道校准B值*/

}e_OCCorrValue;

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void OutCurrSampCorrInit(void)
** @Input     : void
** @Output    : void
** @Function  : 电流采样校准初始化
** @The notes :
**===============================================================================================*/
void OutCurrSampCorrInit(void);

/*=================================================================================================
** @Name      : void OutCurrSampCorrProcess(void)
** @Input     : void
** @Output    : void
** @Function  : 电流校准处理过程
** @The notes : 1s
**===============================================================================================*/
void OutCurrSampCorrProcess(void);

/*=================================================================================================
** @Name      : s32 CorrGetCurrCorrKBValue(e_OCCorrValue index)
** @Input     : index:电流校准KB值索引
** @Output    : 当前电流校准KB值
** @Function  : 获取当前电流校准KB值
** @The notes : 放大1000(OC_CORR_BLOWUP)倍率后的值
**===============================================================================================*/
s32 CorrGetCurrCorrKBValue(e_OCCorrValue index);

/*=================================================================================================
** @Name      : s32 CorrRealHalCurrByKB(s32 curr)
** @Input     : volt:修正前采样电流值 10mA
** @Output    : 修正后实际电流值  0.01A
** @Function  : 通过KB值修正霍尔实际电流采样值
** @The notes :
**===============================================================================================*/
s32 CorrRealHalCurrByKB(s32 curr);

/*=================================================================================================
** @Name      : s32 CorrRealShuCurrByKB(s32 curr)
** @Input     : volt:修正前采样电流值 10mA
** @Output    : 修正后实际电流值  0.01A
** @Function  : 通过KB值修正分流器实际电流采样值
** @The notes :
**===============================================================================================*/
s32 CorrRealShuCurrByKB(s32 curr);

/*=================================================================================================
** @Name      : void ClrEEPOutCurrCorrKBInfo(u8 chan)
** @Input     : chan:电流通道 0:霍尔电流 1:分流器充电电流 2:分流器放电电流
** @Output    : void
** @Function  : 清除EEP电流采样校准KB值
** @The notes :
**===============================================================================================*/
void ClrEEPOutCurrCorrKBInfo(u8 chan);

/*=================================================================================================
** @Name      : void RcdEEPOutCurrCorrKBInfo(u8 chan)
** @Input     : chan:电流通道 0:霍尔电流 1:分流器充电电流 2:分流器放电电流
** @Output    : void
** @Function  : 记录电流校准KB值到EEP
** @The notes :
**===============================================================================================*/
void RcdEEPOutCurrCorrKBInfo(u8 chan);

/*=================================================================================================
** @Name      : void UpdateOutCurrCorrResult(void)
** @Input     : void
** @Output    : void
** @Function  : 更新电流校准结果
** @The notes : 根据校准标志位
**===============================================================================================*/
void UpdateOutCurrCorrResult(void);

#endif
