/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : HeatModbusMap.h
** @Founder      : ZSY342
** @Date         : 2019.11.1
** @Function     : 热管理Modbus通信地址映射模块
** @Instructions :
**===============================================================================================*/
#ifndef LOGICS_SCIUSER_HEATMODBUSMAP_H_
#define LOGICS_SCIUSER_HEATMODBUSMAP_H_

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "MbInterface.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/
#define HEAT_MANANG_MODBUS_PORT   	   (2)			/*热管理modbus通讯端口号*/

/*************************MODBUS IMLU通讯地址划分*************************************************/
#define MODBUS_SALVE_ADDR_IMLU    	   (200)        /*IMLU从机地址*/

#define IMLU_ADDR_FANCTRL_ALARM        (40000)		/*风扇控制回检信号*/
#define IMLU_ADDR_WATSEN_FREQ          (40001)		/*水浸传感器采样值*/
#define IMLU_ADDR_FANCTRL_SPEED_NUM    (40002)		/*(1-16号)风扇控制转速*/
#define IMLU_ADDR_FANCTRL_LEN          (16)		    /*风扇控制转速长度*/

/*************************MODBUS 空调通讯地址划分*************************************************/
#define MODBUS_SALVE_ADDR_AIR          (6)          /*空调从机地址*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Global variable definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u16* ModbusFindSlaveInfoMaping(u8 fncCode, u8 sciNum, u16 address)
** @Input     : fncCode:功能码 sciNum:串口号 address:信息地址
** @Output    : 映射到信息寄存器的实际地址指针
** @Function  : 查找所有信息寄存器所对应的地址指针
** @The notes : 放在Modbus通讯包服务端(主机)接收处理HOOK
**===============================================================================================*/
u16 *ModbusFindSlaveInfoMaping(u8 fncCode, u8 sciNum, u16 address, u8 stationID);

/*=================================================================================================
** @Name      : u16* ModbusFindDeviceInfoROAddrMap(u8 fncCode, u8 sciNum, u16 address)
** @Input     : fncCode:功能码 sciNum:串口号 address:信息地址
** @Output    : 映射到信息寄存器的实际地址指针
** @Function  : 查找在设备信息寄存器所对应的地址指针
** @The notes : 读
**===============================================================================================*/
u16* ModbusFindFanAlarmInfoROAddrMap(u8 fncCode, u8 sciNum, u16 address);

/*=================================================================================================
** @Name      : u16* SciGetFanCtrlAlarmInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读回检信息寄存器地址指针
** @Function  : 获取读回检信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetFanCtrlAlarmInfoRO(u8 index);
#endif

