/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : SciCtrlHandle.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 串口控制处理模块接口
** @Instructions : 
**===============================================================================================*/
#ifndef _SCICTRLHANDLE_H
#define _SCICTRLHANDLE_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "BSPUserAPI.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u16 *SciGetPtrDefaultValueRO(void)
** @Input     : void
** @Output    : 读写串口默认值寄存器地址指针
** @Function  : 获取读写串口默认值寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16 *SciGetPtrDefaultValueWR(void);

/*=================================================================================================
** @Name      : u16* SciGetPtrVerTimeInfoWR(u8 fncCode, u8 sciNum, u8 index, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 index:索引号 data:写入数据(请求修改有效)
** @Output    : 写校时信息寄存器地址指针
** @Function  : 获取写校时信息寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrVerTimeInfoWR(u8 fncCode, u8 sciNum, u8 index, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrSerialNumInfoWR(u8 fncCode, u8 sciNum, u8 index, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 index:索引号 data:写入数据(请求修改有效)
** @Output    : 写设备序列号信息寄存器地址指针
** @Function  : 获取写设备序列号信息寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrSerialNumInfoWR(u8 fncCode, u8 sciNum, u8 index, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrAuthPasswordWR(u8 fncCode, u8 sciNum, u8 index, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 index:索引号 data:写入数据(请求修改有效)
** @Output    : 读权限信息寄存器地址指针
** @Function  : 获取读项目参数信息寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrAuthPasswordWR(u8 fncCode, u8 sciNum, u8 index, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrWorkStateCmdWR(u8 fncCode, u8 sciNum, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 data:写入数据(请求修改有效)
** @Output    : 读权限信息寄存器地址指针
** @Function  : 获取读项目参数信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrWorkStateCmdWR(u8 fncCode, u8 sciNum, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrWorkModeCmdWR(u8 fncCode, u8 sciNum, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 data:写入数据(请求修改有效)
** @Output    : 读写工作模式切换命令寄存器地址指针
** @Function  : 获取读写工作模式切换命令寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrWorkModeCmdWR(u8 fncCode, u8 sciNum, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrSysClrCmdWR(u8 fncCode, u8 sciNum, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 data:写入数据(请求修改有效)
** @Output    : 读写系统清除命令寄存器地址指针
** @Function  : 获取读写系统清除命令寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrSysClrCmdWR(u8 fncCode, u8 sciNum, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrSysDebugCmdWR(u8 fncCode, u8 sciNum, u8 index, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 index:索引号 data:写入数据(请求修改有效)
** @Output    : 读写系统调试命令寄存器地址指针
** @Function  : 获取读写系统调试命令寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrSysDebugCmdWR(u8 fncCode, u8 sciNum, u8 index, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrVerTimeInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读项目参数信息寄存器地址指针
** @Function  : 获取读项目参数信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrVerTimeInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrSerialNumInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读项设备序列号信息寄存器地址指针
** @Function  : 获取读设备序列号信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrSerialNumInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrAuthPasswordRO(u8 index)
** @Input     : index:索引号
** @Output    : 读权限信息寄存器地址指针
** @Function  : 获取读项目参数信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrAuthPasswordRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrSysDebugResultRO(u8 index)
** @Input     : index:索引号
** @Output    : 读系统调试结果信息寄存器地址指针
** @Function  : 获取读系统调试结果信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrSysDebugResultRO(u8 index);

#endif
