/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : SciInfoPoint.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 串口信息模块指针接口
** @Instructions : 
**===============================================================================================*/
#ifndef _SCIINFOPOINT_H
#define _SCIINFOPOINT_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "BSPUserAPI.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u16 *SciGetPtrDefaultValueRO(void)
** @Input     : void
** @Output    : 只读串口默认值寄存器地址指针
** @Function  : 获取只读串口默认值寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16 *SciGetPtrDefaultValueRO(void);

/*=================================================================================================
** @Name      : u16* SciGetPtrDeviceInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读设备信息寄存器地址指针
** @Function  : 获取读设备信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrDeviceInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrProjectInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读项目参数信息寄存器地址指针
** @Function  : 获取读项目参数信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrProjectInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupHisErrRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组历史故障信息寄存器地址指针
** @Function  : 获取读电池组历史故障信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupHisErrRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupHisEventRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组历史事件态信息寄存器地址指针
** @Function  : 获取读电池组历史事件信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupHisEventRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupStateInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组状态信息寄存器地址指针
** @Function  : 获取读电池组状态信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupStateInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupLimitInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组限值信息寄存器地址指针
** @Function  : 获取读电池组限值信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupLimitInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupErrInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组故障告警信息寄存器地址指针
** @Function  : 获取读电池组故障告警信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupErrInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupIoStateInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组输入输出口状态信息寄存器地址指针
** @Function  : 获取读电池组输入输出口状态信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupIoStateInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupMainInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组主要数据信息寄存器地址指针
** @Function  : 获取读电池组主要数据信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupMainInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupCapInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组电量状态信息寄存器地址指针
** @Function  : 获取读电池组电量状态息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupCapInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupCellInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组单体总体信息寄存器地址指针
** @Function  : 获取读电池组单体总体寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupCellInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupCharaInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组单体特征信息寄存器地址指针
** @Function  : 获取读电池组特征总体寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupCharaInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupHigLowInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组高低压侧信息寄存器地址指针
** @Function  : 获取读电池组高低压侧信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupHigLowInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupStatistInfoRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组统计信息寄存器地址指针
** @Function  : 获取读电池组统计信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupStatistInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupHisCapEnerInfoRO(u8 sciNum, u8 index)
** @Input     : sciNum:端口号 index:索引号
** @Output    : 读电池组累计电能电量信息寄存器地址指针
** @Function  : 获取读电池组累计电能电量信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupHisCapEnerInfoRO(u8 sciNum, u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGeroupCellChgBalanRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组单体充电均衡状态信息寄存器地址指针
** @Function  : 获取读电池组单体充电均衡状态信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGeroupCellChgBalanRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGeroupCellDhgBalanRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组单体放电均衡状态信息寄存器地址指针
** @Function  : 获取读电池组单体放电均衡状态信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGeroupCellDhgBalanRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGeroupCellVoltStateRO(u16 index)
** @Input     : index:索引号
** @Output    : 读电池组单体电压值信息寄存器地址指针
** @Function  : 获取读电池组单体电压值信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGeroupCellVoltStateRO(u16 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGeroupCellTempInfoRO(u8 sciNum, u16 index)
** @Input     : sciNum:端口号 index:索引号
** @Output    : 读电池组单体温度值信息寄存器地址指针
** @Function  : 获取读电池组单体温度值信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGeroupCellTempInfoRO(u8 sciNum, u16 index);

#endif
