/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : BSPDMA.c
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 直接内存读取数据传输模块
** @Instructions :
**===========================================================================================*/

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPConfig.h"
#include "BSPTypeDef.h"
#include "edma_driver.h"
#include "dmaController1.h"
#include "BSPDMA.h"

/*=============================================================================================
** @Global variable definition
**===========================================================================================*/
extern volatile u_BSPFunCfg gBSPFunCfg;

/*=============================================================================================
** @Static function declaration
**===========================================================================================*/

/*=============================================================================================
** @Interface function definition
**===========================================================================================*/
/*=============================================================================================
** @Name      : u8 BSPDMAInit(void)
** @Input     : void
** @Output    : 初始化结果 TRUE:成功 FALSE:失败
** @Function  : 直接内存读取初始化
** @The notes :
**===========================================================================================*/
u8 BSPDMAInit(void)
{
	status_t edmaStatus = STATUS_SUCCESS;

    /*模块未使能不进行初始化*/
    if(1 != gBSPFunCfg.Bits.DMAEn)
    {
        return(FALSE);
    }

    edmaStatus = EDMA_DRV_Init(&dmaController1_State, &dmaController1_InitConfig0, edmaChnStateArray, edmaChnConfigArray, EDMA_CONFIGURED_CHANNELS_COUNT);

    if(edmaStatus != STATUS_SUCCESS)
    {
    	return(FALSE);
    }

    return(TRUE);
}

/*=============================================================================================
** @Static function definition
**===========================================================================================*/
