/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : BSPSPI.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : SPI通讯驱动函数模块
** @Instructions :
**===========================================================================================*/
#ifndef _BSPSPI_H
#define _BSPSPI_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define SPI_DRV_MasterOrSlave  1            /*SPI作为主机或从机宏定义   1：主机  0：从机*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
//SPI通道定义
typedef enum 
{
    eSPI0 = 0,/*FS6503芯片通讯*/
    eSPI1 = 1,/*LTC2949芯片通讯*/
    eSPI2 = 2,/*LTC6813芯片通讯*/
    eSPI3 = 3,/*SST26VF064芯片通讯*/
    
    eSPINUM
}e_SPINum;

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : u8 BSPSPIInit(e_SPINum spiNum)
** @Input     : spiNum:SPI通道号
** @Output    : 初始化结果 TRUE:成功 FALSE:失败
** @Function  : SPI驱动模块初始化
** @The notes : BSP调用
**===========================================================================================*/
u8 BSPSPIInit(e_SPINum spiNum);

/*=============================================================================================
** @Name      : u8 BSPSPIGetWorkState(e_SPINum spiNum)
** @Input     : spiNum:SPI通道号
** @Output    : SPI工作状态 0:空闲 1:忙
** @Function  : 获取SPI工作状态
** @The notes : 用户调用
**===========================================================================================*/
u8 BSPSPIGetWorkState(e_SPINum spiNum);

/*=============================================================================================
** @Name      : u8 BSPSPISendData(e_SPINum spiNum, u16 data)
** @Input     : spiNum:SPI通道号 data 需要发送的数据
** @Output    : TRUE:成功 FALSE:失败
** @Function  : SPI发送数据
** @The notes : 用户调用
**===========================================================================================*/
u8 BSPSPISendData(e_SPINum spiNum, u16 data);

/*=============================================================================================
** @Name      : u16 BSPSPIGetRcvData(e_SPINum spiNum)
** @Input     : spiNum:SPI通道号
** @Output    : void
** @Function  : 获得SPI接收到寄存器的数据
** @The notes : 用户调用
**===========================================================================================*/
u16 BSPSPIGetRcvData(e_SPINum spiNum);

/*=============================================================================================
** @Name      : void BSPSPIRcvIntHandle(e_SPINum spiNum)
** @Input     : spiNum:SPI通道号
** @Output    : void
** @Function  : SPI接收中断函数
** @The notes : SPI中断调用,暂不使用
**===========================================================================================*/
void BSPSPIRcvIntHandle(e_SPINum spiNum);

#endif
