/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : SocInterface.h
** @Founder      : SBK326
** @Date         : 2020.9.9
** @Function     : SOC算法包模块接口函数
** @Instructions :
**===========================================================================================*/
#ifndef _SOCINTERFACE_H
#define _SOCINTERFACE_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "EnerInterface.h"
#include "SocSoeSync.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define CAP_CHG_DHG_PER                 990                 /*充放电电量有效比率(放电容量/充电容量:0.1%)*/
#define ENER_CHG_DHG_PER                950                 /*充放电电能有效比率(放电能量/充电能量:0.1%)*/

#define CAPENER_T_PER_LEN               10                  /*不同温度下可用总容量或总能量百分率表长度*/
#define CAPENER_PER_FST_T               (s8)-30             /*不同温度下可用总容量或总能量百分率表起始温度(1℃)*/
#define CAPENER_PER_SUB_T               10                  /*不同温度下可用总容量或总能量百分率表间隔温差(1℃)*/

#define CAPENER_C_PER_LEN               10                  /*不同电流倍率下可用总容量或总能量百分率表长度*/
#define CAPENER_PER_FST_C               2                   /*不同电流倍率下可用总容量或总能量百分率表起始电流倍率(0.1C)*/
#define CAPENER_PER_SUB_C               2                   /*不同电流倍率下可用总容量或总能量百分率表间隔电流倍率(0.1C)*/

#define STEP_CORR_FST_SUBV              150                 /*充放电末端步长修正起始点与充放电截止电压差(1mV)*/
#define STEP_CORR_FIN_HSOC              988                 /*充放电末端步长修正高压端终端目标SOC值(0.1%)*/
#define STEP_CORR_FIN_LSOC              13                  /*充放电末端步长修正低压端终端目标SOC值(0.1%)*/
#define STEP_CORR_FIN_HSOE              990                 /*充放电末端步长修正高压端终端目标SOE值(0.1%)*/
#define STEP_CORR_FIN_LSOE              15                  /*充放电末端步长修正低压端终端目标SOE值(0.1%)*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void CorrGNowCapBySocAPI(u16 soc)
** @Input     : soc:目标SOC(0.1%)
** @Output    : void
** @Function  : 根据电池组SOC修正当前容量
** @The notes :
**===========================================================================================*/
extern void CorrGNowCapBySocAPI(u16 soc);

/*=============================================================================================
** @Name      : void CorrGroupTotalCapAPI(u32 cap)
** @Input     : cap:电池组总容量(单位:1mAH)
** @Output    : void
** @Function  : 修正电池组总容量
** @The notes :
**===========================================================================================*/
extern void CorrGroupTotalCapAPI(u32 cap);

/*=============================================================================================
** @Name      : u16 GetGRealSocMilliAPI(void)
** @Input     : void
** @Output    : 电池组真实SOC值(单位:千分之一)
** @Function  : 获取电池组真实SOC值
** @The notes :
**===========================================================================================*/
extern u16 GetGRealSocMilliAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupNowCapAPI(void)
** @Input     : void
** @Output    : 电池组当前容量(单位:1mAH)
** @Function  : 获取电池组当前电量
** @The notes : 剩余能够使用的电量
**===========================================================================================*/
extern u32 GetGroupNowCapAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupRemainCapAPI(void)
** @Input     : void
** @Output    : 电池组剩余电量(单位:1mAH)
** @Function  : 获取电池组剩余电量
** @The notes : 包括放不出的电量
**===========================================================================================*/
extern u32 GetGroupRemainCapAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupTotalCapAPI(void)
** @Input     : void
** @Output    : 电池组总容量(单位:1mAH)
** @Function  : 获取电池组总容量
** @The notes :
**===========================================================================================*/
extern u32 GetGroupTotalCapAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupStandCapAPI(void)
** @Input     : void
** @Output    : 电池组标称容量(单位:1mAH)
** @Function  : 获取电池组标称容量
** @The notes :
**===========================================================================================*/
extern u32 GetGroupStandCapAPI(void);

/*=============================================================================================
** @Name      : void CorrGNowEnerBySoeAPI(u16 soe)
** @Input     : soe:目标SOE(0.1%)
** @Output    : void
** @Function  : 根据电池组SOE修正当前电能
** @The notes : 用户需要修正电池组当前电能时调用
**===========================================================================================*/
extern void CorrGNowEnerBySoeAPI(u16 soe);

/*=============================================================================================
** @Name      : void CorrGroupTotalEnerAPI(u32 ener)
** @Input     : ener:电池组总能量(单位:1Wh)
** @Output    : void
** @Function  : 修正电池组总能量
** @The notes :
**===========================================================================================*/
extern void CorrGroupTotalEnerAPI(u32 ener);

/*=============================================================================================
** @Name      : u16 GetGRealSoeMilliAPI(void)
** @Input     : void
** @Output    : 电池组当前真实SOE值(0.1%)
** @Function  : 获取电池组当前真实SOE值
** @The notes : 实际可用值，分辨率千分之一
**===========================================================================================*/
extern u16 GetGRealSoeMilliAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupNowEnerAPI(void)
** @Input     : void
** @Output    : 电池组当前电能,即可用电能(单位:1WH)
** @Function  : 获取电池组当前电能
** @The notes : 可以使用的电能
**===========================================================================================*/
extern u32 GetGroupNowEnerAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupRemainEnerAPI(void)
** @Input     : void
** @Output    : 电池组剩余电能 (单位:1WH)
** @Function  : 获取电池组剩余电能
** @The notes : 包括不能使用的电能
**===========================================================================================*/
extern u32 GetGroupRemainEnerAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupTotalEnerAPI(void)
** @Input     : void
** @Output    : 电池组总电能(单位:1WH)
** @Function  : 获取电池组总电能
** @The notes :
**===========================================================================================*/
extern u32 GetGroupTotalEnerAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupStandEnerAPI(void)
** @Input     : void
** @Output    : 电池组标称电能(单位:1WH)
** @Function  : 获取电池组标称电能
** @The notes :
**===========================================================================================*/
extern u32 GetGroupStandEnerAPI(void);

/*=============================================================================================
** @Name      : u8 EnerGetGroupBattReadyHook(void)
** @Input     : void
** @Output    : 0未就绪 1就绪
** @Function  : 获取电池信息就绪状态
** @The notes :
**===========================================================================================*/
extern u8 EnerGetGroupBattReadyHook(void);

/*=============================================================================================
** @Name      : u8 EnerGetGroupVHProStateHook(void)
** @Input     : void
** @Output    : 电池组充电高压保护状态:0正常 1充电高压保护
** @Function  : 获取电池组充电高压保护状态
** @The notes :
**===========================================================================================*/
extern u8 EnerGetGroupVHProStateHook(void);

/*=============================================================================================
** @Name      : u8 EnerGetGroupVLProStateHook(void)
** @Input     : void
** @Output    : 电池组放电低压保护状态:0正常 1充电高压保护
** @Function  : 获取电池组放电低压保护状态
** @The notes :
**===========================================================================================*/
extern u8 EnerGetGroupVLProStateHook(void);

/*=============================================================================================
** @Name      : u8 EnerGetGroupVHLimStateHook(void)
** @Input     : void
** @Output    : 电池组充电高压限制状态:0正常 1充电高压限制
** @Function  : 获取电池组充电高压限制状态
** @The notes :
**===========================================================================================*/
extern u8 EnerGetGroupVHLimStateHook(void);

/*=============================================================================================
** @Name      : u8 EnerGetGroupVLLimStateHook(void)
** @Input     : void
** @Output    : 电池组放电欠压限制状态:0正常 1放电欠压限制
** @Function  : 获取电池组放电欠压限制状态
** @The notes :
**===========================================================================================*/
extern u8 EnerGetGroupVLLimStateHook(void);

/*=================================================================================================
** @Name      : void SocSoeSyncRcvGMsgHandle_API(u32 ID, u8 *pdata, u8 DLC, u8 canNum)
** @Input     : ID:CANID *pdata:CAN数据域  DLC:数据域长度 canNum:CAN通道号
** @Output    : void
** @Function  : SOCSOE同步接收处理任务
** @The notes : 用户放在CAN接收处理HOOK接口调用
**===============================================================================================*/
extern void SocSoeSyncRcvGMsgHandle_API(u32 ID, u8 *pdata, u8 DLC, u8 canNum);

/*=============================================================================================
** @Name      : u8 SocWriteCapEnerCheckInfoHook(u32 *info, u8 len)
** @Input     : info:读取到的信息 len:读取长度
** @Output    : 读取结果:TRUE:成功 FALSE:失败
** @Function  : 读取容量和能量标定检测信息
** @The notes : 从EEPROM读取
**===========================================================================================*/
u8 SocReadCapEnerCorrInfoHook(u32 *info, u8 len);

/*=============================================================================================
** @Name      : u8 SocWriteCapEnerCorrInfoHook(u8 sort, u32 *info, u8 len)
** @Input     : sort:记录类型(0:低压点信息 1:高压点信息) info:需记录的信息 len:数据长度
** @Output    : 记录结果:TRUE:成功 FALSE:失败
** @Function  : 记录容量能量自动标定检测信息
** @The notes : 记录到EEPROM存储(要求存储器必须已经写记录标志)
**===========================================================================================*/
u8 SocWriteCapEnerCorrInfoHook(u8 sort, u32 *info, u8 len);

/*=============================================================================================
** @Name      : u8 SocWriteCapEnerCorrInfoHook(u8 sort, u32 *info, u8 len)
** @Input     : sort:记录类型(0:低压点信息 1:高压点信息) info:需记录的信息 len:数据长度
** @Output    : 记录结果:TRUE:成功 FALSE:失败
** @Function  : 记录容量能量自动标定检测到的总容量总能量值
** @The notes : 记录到EEPROM存储(要求存储器必须已经写记录标志)
**===========================================================================================*/
u8 SocWriteCorrTotalCapEnerHook(u8 sort, u32 *info, u8 len);

/*=============================================================================================
** @Name      : u8 SocWriteCapEnerCorrTimeHook(u8 sort, u32 time)
** @Input     : sort:记录类型(0:低压点信息 1:高压点信息) time:标定时长(1s)
** @Output    : 记录结果:TRUE:成功 FALSE:失败
** @Function  : 记录容量能量自动标定时长信息
** @The notes : 记录到EEPROM存储(要求存储器必须已经写记录标志)
**===========================================================================================*/
u8 SocWriteCapEnerCorrTimeHook(u8 sort, u32 time);

#endif
