/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : SocSoeSync.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : SOC/SOE组间同步模块
** @Instructions : 多组并机时有效,确保组间SOC/SOE差距不大
**===========================================================================================*/
#ifndef _SOCSOESYNC_H
#define _SOCSOESYNC_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define G_SOCSOE_SYNC_T                 10                  /*并机组SOC同步修正周期(1s)*/
#define G_ALLOW_DIFF_VOLT               30                  /*并机组SOCSOE同步允许压差值(1mV)*/
#define G_ALLOW_DIFF_SOC                30                  /*并机组允许SOC不同差值(0.1%)*/
#define G_ALLOW_DIFF_SOE                30                  /*并机组允许SOE不同差值(0.1%)*/
 
/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      :  void SocSoeTogetherSyncTask(void)
** @Input     :  void
** @Output    :  void
** @Function  :  SOC/SOE相互同步修正
** @The notes :  500ms,确保SOE变化跟随SOC同步(SOE全程均不能大于SOC)
**===========================================================================================*/
void SocSoeTogetherSyncTask(void);

/*=============================================================================================
** @Name      :  void SocSoeGroupSyncTask(void)
** @Input     :  void
** @Output    :  void
** @Function  :  SOC/SOE组间同步修正
** @The notes :  500ms,确保多组并机间误差3%内
**===========================================================================================*/
void SocSoeGroupSyncTask(void);

/*=================================================================================================
** @Name      : void SocSoeSyncRcvGMsgHandle_API(u32 ID, u8 *pdata, u8 DLC, u8 canNum)
** @Input     : ID:CANID *pdata:CAN数据域  DLC:数据域长度 canNum:CAN通道号
** @Output    : void
** @Function  : SOCSOE同步接收处理任务
** @The notes : 用户放在CAN接收处理HOOK接口调用
**===============================================================================================*/
void SocSoeSyncRcvGMsgHandle_API(u32 ID, u8 *pdata, u8 DLC, u8 canNum);

/*=================================================================================================
** @Name      : u8 GetSocSoeGSyncChgDhgFinState(void)
** @Input     : void
** @Output    : 0:非充放电截止 1:充电截止 2:放电截止
** @Function  : 组间SOCSOE同步充放电截止状态
** @The notes : 由于同网其他组充放电截止使本组不能继续充放电
**===============================================================================================*/
u8 GetSocSoeGSyncChgDhgFinState(void);

#endif
