/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : CurrLimPID.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 电流调节PID算法模块
** @Instructions :
**===========================================================================================*/
#ifndef _CURRLIMPID_H
#define _CURRLIMPID_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPTypeDef.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
//PI调节结构体定义
typedef struct
{
	s32 piIn;                   //PI输入，调用时写入；
	s32 piInBak;                //上次输入的PiIn
	s32 piOut;                  //PI输出，函数正确执行后写入，作为函数实际输出值；
	s32 piSum;                  //PI积分累加量，函数内部使用，函数外只读；
}t_PIIO;

//PID调节数据结构
typedef struct
{
	s32 piKp;                   //PI比例系数
	s32 piKpR;                  //PI比例项右移位数
	s32 piKi;                   //PI积分系数
	s32 piKiR;                  //PI积分项右移位数
	s32 piKiPrecision;          //PI积分调节有效范围
	s32 piInMax;                //PI输入最大值
	s32 piInMin;                //PI输入最小值
	s32 piSumMax;               //PI积分累加量最大值
	s32 piSumMin;               //PI积分累加量最小值
	s32 piOutMax;               //PI输出最大值
	s32 piOutMin;               //PI输出最小值
}t_PICfg;

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : u16 UtilPIAdjust(t_PIIO *pPiIO, const t_PICfg *pPiCfg)
** @Input     : t_PIIO *pPiIO, t_PICfg *pPiCfg
** @Output    : 0:正常1：异常
** @Function  : PI调节通用函数
** @The notes :
**===========================================================================================*/
u16 UtilPIAdjust(t_PIIO *pPiIO, const t_PICfg *pPiCfg);

#endif
