/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : StaInterface.c
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 统计模块用户接口
** @Instructions : 
**===============================================================================================*/

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "BSPUserAPI.h"
#include "PublicInfo.h"
#include "GroupInfo.h"
#include "GroupPara.h"
#include "ParaInterface.h"
#include "DiagInterface.h"
#include "TacInterface.h"
#include "StaInterface.h"

/*=================================================================================================
** @Global variable definition
**===============================================================================================*/

/*=================================================================================================
** @Static function declaration
**===============================================================================================*/

/*=================================================================================================
** @Interface function definition
**===============================================================================================*/
/*=============================================================================================
** @Name      : u8 StaGetBattVStateHook(void)
** @Input     : void
** @Output    : 电池组电压状态:0正常 1充满 2放空
** @Function  : 获取电池组电压状态
** @The notes :
**===========================================================================================*/
u8 StaGetBattVStateHook(void)
{
    return(TacGetGroupBattStateAPI());
}

/*=============================================================================================
** @Name      : u8 StaGetVHLimStateHook(void)
** @Input     : void
** @Output    : 高压截止状态:0正常 1高压充电截止
** @Function  : 获取高压截止状态
** @The notes : 单体电压高2级(充电截止)
**===========================================================================================*/
u8 StaGetVHLimStateHook(void)
{
    u8 state = 0;

    if(eErr_B == DiagGetErrFilStateAPI(eERR_ID_CEL_VH2))
    {
        state = 1;
    }
    else
    {
        state = 0;
    }

    return(state);
}

/*=============================================================================================
** @Name      : u8 StaGetVLLimStateHook(void)
** @Input     : void
** @Output    : 低压截止状态:0正常 1低压放电截止
** @Function  : 获取低压截止状态
** @The notes : 低压2级,限制放电
**===========================================================================================*/
u8 StaGetVLLimStateHook(void)
{
    u8 state = 0;

    if(eErr_B == DiagGetErrFilStateAPI(eERR_ID_CEL_VL2))
    {
        state = 1;
    }
    else
    {
        state = 0;
    }

    return(state);
}

/*=================================================================================================
** @Static function definition
**===============================================================================================*/

