/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : CapInfoCalc.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : SOC容量计算模块
** @Instructions :
**===========================================================================================*/
#ifndef _CAPINFOCALC_H
#define _CAPINFOCALC_H

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define CAP_ZERO_POINT             1000000      /*容量计算的零点值(底端容量)*/
#define SOC_CHANG_TO_WRITE_EEP     1            /*当前容量进行写EEP的SOC变化值(单位:0.1%)*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
//容量计算结构体
typedef struct
{
	u32 nowCap;                 /*当前容量(单位:1mAH)*/
	u32 remCap;                 /*剩余容量(单位:1mAH)*/
	u32 baseCap;                /*底端容量(单位:1mAH)*/
	u32 topCap;                 /*顶端容量(单位:1mAH)*/
	u32 standCap;               /*标称容量(单位:1mAH)*/
}t_CAPFORM;

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void GroupCapSocInit(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组当前容量SOC计算初始化
** @The notes :
**===========================================================================================*/
void GroupCapSocInit(void);

/*=============================================================================================
** @Name      : void GroupCapSocCalcTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组当前容量SOC计算任务
** @The notes : 100ms调用,测算总容量和SOC
**===========================================================================================*/
void GroupCapSocCalcTask(void);

/*=============================================================================================
** @Name      : void CorrGNowCapBySocAPI(u16 soc)
** @Input     : soc:目标SOC(0.1%)
** @Output    : void
** @Function  : 根据电池组SOC修正当前容量
** @The notes :
**===========================================================================================*/
void CorrGNowCapBySocAPI(u16 soc);

/*=============================================================================================
** @Name      : void CorrGRemainCapBySocAPI(u32 cap)
** @Input     : soc:目标SOC(0.1%)
** @Output    : void
** @Function  : 根据电池组SOC修正剩余电量
** @The notes : 相对总容量剩余值
**===========================================================================================*/
void CorrGRemainCapBySocAPI(u16 soc);

/*=============================================================================================
** @Name      : void CorrGroupTotalCapAPI(u32 cap)
** @Input     : cap:电池组总容量(单位:1mAH)
** @Output    : void
** @Function  : 修正电池组总容量
** @The notes :
**===========================================================================================*/
void CorrGroupTotalCapAPI(u32 cap);

/*=============================================================================================
** @Name      : void CorrGroupStandCapAPI(u32 cap)
** @Input     : cap:电池组标称容量(单位:1mAH)
** @Output    : void
** @Function  : 修正电池组标称容量
** @The notes :
**===========================================================================================*/
void CorrGroupStandCapAPI(u32 cap);

/*=============================================================================================
** @Name      : u32 GetGroupNowCapAPI(void)
** @Input     : void
** @Output    : 电池组当前容量(单位:1mAH)
** @Function  : 获取电池组当前电量
** @The notes : 剩余能够使用的电量
**===========================================================================================*/
u32 GetGroupNowCapAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupRemainCapAPI(void)
** @Input     : void
** @Output    : 电池组剩余电量(单位:1mAH)
** @Function  : 获取电池组剩余电量
** @The notes : 包括放不出的电量
**===========================================================================================*/
u32 GetGroupRemainCapAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupTotalCapAPI(void)
** @Input     : void
** @Output    : 电池组总容量(单位:1mAH)
** @Function  : 获取电池组总容量
** @The notes :
**===========================================================================================*/
u32 GetGroupTotalCapAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupStandCapAPI(void)
** @Input     : void
** @Output    : 电池组标称容量(单位:1mAH)
** @Function  : 获取电池组标称容量
** @The notes :
**===========================================================================================*/
u32 GetGroupStandCapAPI(void);

/*=============================================================================================
** @Name      : u16 GetGRealSocTenThousAPI(void)
** @Input     : void
** @Output    : 电池组真实SOC值(单位:万分之一)
** @Function  : 获取电池组真实SOC值
** @The notes :
**===========================================================================================*/
u16 GetGRealSocTenThousAPI(void);

/*=============================================================================================
** @Name      : u16 GetGRealSocMilliAPI(void)
** @Input     : void
** @Output    : 电池组真实SOC值(单位:千分之一)
** @Function  : 获取电池组真实SOC值
** @The notes :
**===========================================================================================*/
u16 GetGRealSocMilliAPI(void);

/*=============================================================================================
** @Name      : u16 GetGRemainSocMilliAPI(void)
** @Input     : void
** @Output    : 电池组剩余SOC值(单位:千分之一)
** @Function  : 获取电池组剩余SOC值
** @The notes :
**===========================================================================================*/
u16 GetGRemainSocMilliAPI(void);

#endif
