/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : EnerInterface.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 电能量计算模块接口函数
** @Instructions :
**===========================================================================================*/
#ifndef _ENERINTERFACE_H
#define _ENERINTERFACE_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void EnerCapCalcAllInit(void)
** @Input     : void
** @Output    : void
** @Function  : 电能量计算模块总初始化
** @The notes :
**===========================================================================================*/
extern void EnerCapCalcAllInit(void);

/*=============================================================================================
** @Name      : void GroupEnerDisplayTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电能量计算值显示任务
** @The notes : 100ms
**===========================================================================================*/
extern void GroupEnerDisplayTask(void);

/*=============================================================================================
** @Name      : void GroupCapSocCalcTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组当前容量SOC计算任务
** @The notes : 100ms调用,测算总容量和SOC
**===========================================================================================*/
extern void GroupCapSocCalcTask(void);

/*=============================================================================================
** @Name      : void CorrGNowCapBySocAPI(u16 soc)
** @Input     : soc:目标SOC(0.1%)
** @Output    : void
** @Function  : 根据电池组SOC修正当前容量
** @The notes :
**===========================================================================================*/
extern void CorrGNowCapBySocAPI(u16 soc);

/*=============================================================================================
** @Name      : void CorrGRemainCapBySocAPI(u32 cap)
** @Input     : soc:目标SOC(0.1%)
** @Output    : void
** @Function  : 根据电池组SOC修正剩余电量
** @The notes : 相对总容量剩余值
**===========================================================================================*/
extern void CorrGRemainCapBySocAPI(u16 soc);

/*=============================================================================================
** @Name      : void CorrGroupTotalCapAPI(u32 cap)
** @Input     : cap:电池组总容量(单位:1mAH)
** @Output    : void
** @Function  : 修正电池组总容量
** @The notes :
**===========================================================================================*/
extern void CorrGroupTotalCapAPI(u32 cap);

/*=============================================================================================
** @Name      : void CorrGroupStandCapAPI(u32 cap)
** @Input     : cap:电池组标称容量(单位:1mAH)
** @Output    : void
** @Function  : 修正电池组标称容量
** @The notes :
**===========================================================================================*/
extern void CorrGroupStandCapAPI(u32 cap);

/*=============================================================================================
** @Name      : u32 GetGroupNowCapAPI(void)
** @Input     : void
** @Output    : 电池组当前容量(单位:1mAH)
** @Function  : 获取电池组当前电量
** @The notes : 剩余能够使用的电量
**===========================================================================================*/
extern u32 GetGroupNowCapAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupRemainCapAPI(void)
** @Input     : void
** @Output    : 电池组剩余电量(单位:1mAH)
** @Function  : 获取电池组剩余电量
** @The notes : 包括放不出的电量
**===========================================================================================*/
extern u32 GetGroupRemainCapAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupTotalCapAPI(void)
** @Input     : void
** @Output    : 电池组总容量(单位:1mAH)
** @Function  : 获取电池组总容量
** @The notes :
**===========================================================================================*/
extern u32 GetGroupTotalCapAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupStandCapAPI(void)
** @Input     : void
** @Output    : 电池组标称容量(单位:1mAH)
** @Function  : 获取电池组标称容量
** @The notes :
**===========================================================================================*/
extern u32 GetGroupStandCapAPI(void);

/*=============================================================================================
** @Name      : u16 GetGRealSocTenThousAPI(void)
** @Input     : void
** @Output    : 电池组真实SOC值(单位:万分之一)
** @Function  : 获取电池组真实SOC值
** @The notes :
**===========================================================================================*/
extern u16 GetGRealSocTenThousAPI(void);

/*=============================================================================================
** @Name      : u16 GetGRealSocMilliAPI(void)
** @Input     : void
** @Output    : 电池组真实SOC值(单位:千分之一)
** @Function  : 获取电池组真实SOC值
** @The notes :
**===========================================================================================*/
extern u16 GetGRealSocMilliAPI(void);

/*=============================================================================================
** @Name      : u16 GetGRemainSocMilliAPI(void)
** @Input     : void
** @Output    : 电池组剩余SOC值(单位:千分之一)
** @Function  : 获取电池组剩余SOC值
** @The notes :
**===========================================================================================*/
extern u16 GetGRemainSocMilliAPI(void);

/*=============================================================================================
** @Name      : void GroupEnerSoeCalcTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组当前电能SOE计算任务
** @The notes : 100ms调用,测算当前能量和SOE
**===========================================================================================*/
extern void GroupEnerSoeCalcTask(void);

/*=============================================================================================
** @Name      : void CorrGNowEnerBySoeAPI(u16 soe)
** @Input     : soe:目标SOE(0.1%)
** @Output    : void
** @Function  : 根据电池组SOE修正当前电能
** @The notes : 用户需要修正电池组当前电能时调用
**===========================================================================================*/
extern void CorrGNowEnerBySoeAPI(u16 soe);

/*=============================================================================================
** @Name      : void CorrGRemainEnerBySoeAPI(u16 soe)
** @Input     : soe:目标SOE(0.1%)
** @Output    : void
** @Function  : 根据电池组SOE修正剩余电能
** @The notes : 用户需要电池组修正剩余电能时调用
**===========================================================================================*/
extern void CorrGRemainEnerBySoeAPI(u16 soe);

/*=============================================================================================
** @Name      : void CorrGroupTotalEnerAPI(u32 ener)
** @Input     : ener:电池组总能量(单位:1Wh)
** @Output    : void
** @Function  : 修正电池组总能量
** @The notes :
**===========================================================================================*/
extern void CorrGroupTotalEnerAPI(u32 ener);

/*=============================================================================================
** @Name      : void CorrGroupStandEnerAPI(u32 ener)
** @Input     : ener:电池组标称能量(单位:1Wh)
** @Output    : void
** @Function  : 修正电池组标称能量
** @The notes :
**===========================================================================================*/
extern void CorrGroupStandEnerAPI(u32 ener);

/*=============================================================================================
** @Name      : u32 GetGroupNowEnerAPI(void)
** @Input     : void
** @Output    : 电池组当前电能,即可用电能(单位:1WH)
** @Function  : 获取电池组当前电能
** @The notes : 可以使用的电能
**===========================================================================================*/
extern u32 GetGroupNowEnerAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupRemainEnerAPI(void)
** @Input     : void
** @Output    : 电池组剩余电能 (单位:1WH)
** @Function  : 获取电池组剩余电能
** @The notes : 包括不能使用的电能
**===========================================================================================*/
extern u32 GetGroupRemainEnerAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupTotalEnerAPI(void)
** @Input     : void
** @Output    : 电池组总电能(单位:1WH)
** @Function  : 获取电池组总电能
** @The notes :
**===========================================================================================*/
extern u32 GetGroupTotalEnerAPI(void);

/*=============================================================================================
** @Name      : u32 GetGroupStandEnerAPI(void)
** @Input     : void
** @Output    : 电池组标称电能(单位:1WH)
** @Function  : 获取电池组标称电能
** @The notes :
**===========================================================================================*/
extern u32 GetGroupStandEnerAPI(void);

/*=============================================================================================
** @Name      : u16 GetGRealSoeTenThousAPI(void)
** @Input     : void
** @Output    : 电池组当前真实SOE值(0.01%)
** @Function  : 获取电池组当前真实SOE值
** @The notes : 实际可用值，分辨率万分之一
**===========================================================================================*/
extern u16 GetGRealSoeTenThousAPI(void);

/*=============================================================================================
** @Name      : u16 GetGRealSoeMilliAPI(void)
** @Input     : void
** @Output    : 电池组当前真实SOE值(0.1%)
** @Function  : 获取电池组当前真实SOE值
** @The notes : 实际可用值，分辨率千分之一
**===========================================================================================*/
extern u16 GetGRealSoeMilliAPI(void);

/*=============================================================================================
** @Name      : u16 GetGRemainSoeMilliAPI(void)
** @Input     : void
** @Output    : 剩余SOE值(0.1%)
** @Function  : 获取剩余SOE值
** @The notes : 相对总能量剩余值，分辨率千分之一
**===========================================================================================*/
extern u16 GetGRemainSoeMilliAPI(void);

/*=============================================================================================
** @Name      : void GroupFadeSohCalcTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池容量衰减程度SOH计算任务
** @The notes : 100ms调用,测算总容量和SOH
**===========================================================================================*/
extern void GroupFadeSohCalcTask(void);

/*=============================================================================================
** @Name      : void CorrGroupRatedCapAPI(u16 rateCap)
** @Input     : rateCap:电池组额定容量(单位:0.1AH)
** @Output    : void
** @Function  : 修正电池组额定容量
** @The notes :
**===========================================================================================*/
extern void CorrGroupRatedCapAPI(u16 rateCap);

/*=============================================================================================
** @Name      : void CorrGroupRatedCycleAPI(u16 rateCycle)
** @Input     : rateCycle:电池组额定循环次数
** @Output    : void
** @Function  : 修正电池组额定循环次数
** @The notes :
**===========================================================================================*/
extern void CorrGroupRatedCycleAPI(u16 rateCycle);

/*=============================================================================================
** @Name      : void CorrGroupRatedCycleAPI(u16 rateCycle)
** @Input     : rateCycle:电池组额定循环次数
** @Output    : void
** @Function  : 修正电池组额定循环次数
** @The notes :
**===========================================================================================*/
extern void CorrGroupRatedCycleAPI(u16 rateCycle);

/*=============================================================================================
** @Name      : u16 GetGFadeTotalCapAPI(void)
** @Input     : void
** @Output    : 电池组衰减后的总容量值(0.1AH)
** @Function  : 获取电池组衰减后的总容量值
** @The notes :
**===========================================================================================*/
extern u16 GetGFadeTotalCapAPI(void);

/*=============================================================================================
** @Name      : u16 GetGroupRatedCapAPI(void)
** @Input     : void
** @Output    : 电池组额定容量(单位:0.1AH)
** @Function  : 获取电池组额定容量
** @The notes :
**===========================================================================================*/
extern u16 GetGroupRatedCapAPI(void);

/*=============================================================================================
** @Name      : u16 GetGroupFadeCycleAPI(void)
** @Input     : void
** @Output    : 电池实际衰减循环次数(1次)
** @Function  : 获取电池组实际衰减循环次数
** @The notes :
**===========================================================================================*/
extern u16 GetGroupFadeCycleAPI(void);

/*=============================================================================================
** @Name      : u16 GetGroupRatedCycleAPI(void)
** @Input     : void
** @Output    : 电池额定循环次数(1次)
** @Function  : 获取电池组额定循环次数
** @The notes :
**===========================================================================================*/
extern u16 GetGroupRatedCycleAPI(void);

/*=============================================================================================
** @Name      : u16 GetGRealSohMilliAPI(void)
** @Input     : void
** @Output    : 电池组当前健康度SOH值(0.1%)
** @Function  : 获取电池组当前健康度SOH值
** @The notes : 分辨率千分之一
**===========================================================================================*/
extern u16 GetGRealSohMilliAPI(void);

/*=============================================================================================
** @Name      : void CorrGDisplaySocByUser(u16 soc)
** @Input     : soc:目标SOC(0.01%)
** @Output    : void
** @Function  : 用户修正当前显示SOC
** @The notes :
**===========================================================================================*/
extern void CorrGDisplaySocByUser(u16 soc);

/*=============================================================================================
 ** @Name      : void CorrGDisplaySoeByUser(u16 soe)
 ** @Input     : soe:目标SOE(0.01%)
 ** @Output    : void
 ** @Function  : 用户修正当前显示SOE
 ** @The notes :
 **===========================================================================================*/
extern void CorrGDisplaySoeByUser(u16 soe);

/*=============================================================================================
** @Name      : void ChgCapIntTask(u32 curr, u8 cycle)
** @Input     : curr:采样电流值(单位10mA) cycle:调用(积分)周期(1ms[1,10])
** @Output    : void
** @Function  : 充电电量积分任务
** @The notes : 最少10ms周期调用
**===========================================================================================*/
extern void ChgCapIntTask(u32 curr, u8 cycle);

/*=============================================================================================
** @Name      : void DhgCapIntTask(u32 curr, u8 cycle)
** @Input     : curr:采样电流值(单位10mA) cycle:调用(积分)周期(1ms[1,10])
** @Output    : void
** @Function  : 放电电量积分任务
** @The notes : 最少10ms周期调用
**===========================================================================================*/
extern void DhgCapIntTask(u32 curr, u8 cycle);

/*=============================================================================================
** @Name      : void ChgEnerIntTask(u32 curr, u16 volt, u8 cycle)
** @Input     : curr:采样电流值(单位10mA), volt采样电压值(单位:100mV) cycle:调用(积分)周期(1ms[1,10])
** @Output    : void
** @Function  : 充电电能积分任务
** @The notes : 最少10ms周期调用
**===========================================================================================*/
extern void ChgEnerIntTask(u32 curr, u16 volt, u8 cycle);

/*=============================================================================================
** @Name      : void DhgEnerIntTask(u32 curr, u16 volt, u8 cycle)
** @Input     : curr:采样电流值(单位10mA), volt采样电压值(单位:100mV) cycle:调用(积分)周期(1ms[1,10])
** @Output    : void
** @Function  : 放电电能积分任务
** @The notes : 最少10ms周期调用
**===========================================================================================*/
extern void DhgEnerIntTask(u32 curr, u16 volt, u8 cycle);

/*=============================================================================================
** @Name      : u32 GetChgIntCapAPI(void)
** @Input     : void
** @Output    : 充电积分电量值(单位:1AH)
** @Function  : 获取充电积分电量值
** @The notes :
**===========================================================================================*/
extern u32 GetChgIntCapAPI(void);

/*=============================================================================================
** @Name      : u32 GetDhgIntCapAPI(void)
** @Input     : void
** @Output    : 放电积分电量值(单位:1AH)
** @Function  : 获取放电积分电量值
** @The notes :
**===========================================================================================*/
extern u32 GetDhgIntCapAPI(void);

/*=============================================================================================
** @Name      : s32 GetChgDhgChangCapAPI(void)
** @Input     : void
** @Output    : 充放电电量变化值(单位:1mAH,正数为放电量,负数为充电量)
** @Function  : 获取充放电电量变化值
** @The notes :
**===========================================================================================*/
extern s32 GetChgDhgChangCapAPI(void);

/*=============================================================================================
** @Name      : u32 GetChgIntEnerAPI(void)
** @Input     : void
** @Output    : 充电积分电能值(单位:0.1KWH)
** @Function  : 获取充电积分电能值
** @The notes :
**===========================================================================================*/
extern u32 GetChgIntEnerAPI(void);

/*=============================================================================================
** @Name      : u32 GetDhgIntEnerAPI(void)
** @Input     : void
** @Output    : 放电积分电能值(单位:0.1KWH)
** @Function  : 获取放电积分电能值
** @The notes :
**===========================================================================================*/
extern u32 GetDhgIntEnerAPI(void);

/*=============================================================================================
** @Name      : s32 GetChgDhgChangEnerAPI(void)
** @Input     : void
** @Output    : 充放电电能变化值(单位:1WH,正数为放电能,负数为充电能)
** @Function  : 获取充放电电能变化值
** @The notes :
**===========================================================================================*/
extern s32 GetChgDhgChangEnerAPI(void);

/*=============================================================================================
** @Name      : u8 EnerGetGroupBattReadyHook(void)
** @Input     : void
** @Output    : 0未就绪 1就绪
** @Function  : 获取电池信息就绪状态
** @The notes :
**===========================================================================================*/
u8 EnerGetGroupBattReadyHook(void);

/*=============================================================================================
** @Name      : u8 EnerGetGroupVHProStateHook(void)
** @Input     : void
** @Output    : 电池组充电高压保护状态:0正常 1充电高压保护
** @Function  : 获取电池组充电高压保护状态
** @The notes :
**===========================================================================================*/
u8 EnerGetGroupVHProStateHook(void);

/*=============================================================================================
** @Name      : u8 EnerGetGroupVLProStateHook(void)
** @Input     : void
** @Output    : 电池组放电低压保护状态:0正常 1充电高压保护
** @Function  : 获取电池组放电低压保护状态
** @The notes :
**===========================================================================================*/
u8 EnerGetGroupVLProStateHook(void);

/*=============================================================================================
** @Name      : u8 EnerGetGroupVHLimStateHook(void)
** @Input     : void
** @Output    : 电池组充电高压限制状态:0正常 1充电高压限制
** @Function  : 获取电池组充电高压限制状态
** @The notes :
**===========================================================================================*/
u8 EnerGetGroupVHLimStateHook(void);

/*=============================================================================================
** @Name      : u8 EnerGetGroupVLLimStateHook(void)
** @Input     : void
** @Output    : 电池组放电欠压限制状态:0正常 1放电欠压限制
** @Function  : 获取电池组放电欠压限制状态
** @The notes :
**===========================================================================================*/
u8 EnerGetGroupVLLimStateHook(void);

/*=============================================================================================
**以下是输出类函数
**===========================================================================================*/
/*=============================================================================================
** @Name      : void EnerChangEepGNowCapHook(u32 cap)
** @Input     : cap:当前容量 1mAH
** @Output    : void
** @Function  : 修改EEP当前容量值
** @The notes : 可用容量
**===========================================================================================*/
void EnerChangEepGNowCapHook(u32 cap);

/*=============================================================================================
** @Name      : void EnerChangEepGRemainCapHook(u32 cap)
** @Input     : cap:目标剩余容量 1mAH
** @Output    : void
** @Function  : 修改EEP电池组剩余容量值
** @The notes : 包括不能放出来的容量
**===========================================================================================*/
void EnerChangEepGRemainCapHook(u32 cap);

/*=============================================================================================
** @Name      : void EnerChangEepGTotalCapHook(u32 cap)
** @Input     : cap:目标总容量 1mAH
** @Output    : void
** @Function  : 修改EEP电池组总容量值
** @The notes : 实测容量
**===========================================================================================*/
void EnerChangEepGTotalCapHook(u32 cap);

/*=============================================================================================
** @Name      : void EnerChangEepGStandCapHook(u32 cap)
** @Input     : cap:目标标称容量 1mAH
** @Output    : void
** @Function  : 修改EEP电池组标称容量值
** @The notes : 实测容量
**===========================================================================================*/
void EnerChangEepGStandCapHook(u32 cap);

/*=============================================================================================
** @Name      : void EnerChangEepGNowSocHook(u16 soc)
** @Input     : soc:当前显示SOC 0.1%
** @Output    : void
** @Function  : 修改EEP当前显示SOC值
** @The notes : 显示SOC
**===========================================================================================*/
void EnerChangEepGNowSocHook(u16 soc);

/*=============================================================================================
** @Name      : void EnerChangEepGNowEner(u32 ener)
** @Input     : ener:当前能量 1Wh
** @Output    : void
** @Function  : 修改EEP电池组当前能量值
** @The notes : 可用电能
**===========================================================================================*/
void EnerChangEepGNowEner(u32 ener);

/*=============================================================================================
** @Name      : void EnerChangEepGRemainEner(u32 ener)
** @Input     : ener:剩余能量 1Wh
** @Output    : void
** @Function  : 修改EEP电池组当前剩余能量值
** @The notes : 包括不能放出来的电能
**===========================================================================================*/
void EnerChangEepGRemainEner(u32 ener);

/*=============================================================================================
** @Name      : void EnerChangEepTotalEner(u32 ener)
** @Input     : ener:总能量 1Wh
** @Output    : void
** @Function  : 修改EEP总能量值
** @The notes : 实测总电能
**===========================================================================================*/
void EnerChangEepTotalEner(u32 ener);

/*=============================================================================================
** @Name      : void EnerChangEepStandEner(u32 ener)
** @Input     : ener:标称能量 1Wh
** @Output    : void
** @Function  : 修改EEP标称能量值
** @The notes : 标准电能值
**===========================================================================================*/
void EnerChangEepStandEner(u32 ener);

/*=============================================================================================
** @Name      : void EnerChangEepGNowSocHook(u16 soe)
** @Input     : soe:当前显示SOE 0.1%
** @Output    : void
** @Function  : 修改EEP当前显示SOE值
** @The notes : 显示SOE
**===========================================================================================*/
void EnerChangEepGNowSoeHook(u16 soe);

/*=============================================================================================
** @Name      : void EnerChangEepGRatedCapHook(u16 rateCap)
** @Input     : rateCap:电池组额定容量(0.1AH)
** @Output    : void
** @Function  : 修改电池组额定容量
** @The notes : 出厂有效容量
**===========================================================================================*/
void EnerChangEepGRatedCapHook(u16 rateCap);

/*=============================================================================================
** @Name      : void EnerChangEepGDampNumHook(u16 times)
** @Input     : times:电池额定循环次数
** @Output    : void
** @Function  : 修改电池额定循环次数
** @The notes : 有效衰减次数
**===========================================================================================*/
void EnerChangEepGDampNumHook(u16 times);

/*=============================================================================================
** @Name      : void EnerChangEepGNowCapSohHook(u16 soh)
** @Input     : soh:电池SOH(0.1%)
** @Output    : void
** @Function  : 修改电池当前总容量SOH值
** @The notes : 有效衰减次数
**===========================================================================================*/
void EnerChangEepGNowCapSohHook(u16 soh);

/*=============================================================================================
** @Name      : void EnerAftTotalCapCorrDealHook(u16 befcap, u16 aftcap)
** @Input     : befcap:前置总容量 aftcap:修正后总容量
** @Output    : void
** @Function  : 总容量修正后处理
** @The notes :
**===========================================================================================*/
void EnerAftTotalCapCorrDealHook(u16 befcap, u16 aftcap);

/*=============================================================================================
** @Name      : void EnerAftTotalEnerCorrDealHook(u16 befener, u16 aftener)
** @Input     : befener:前置总能量 aftener:修正后总能量
** @Output    : void
** @Function  : 总能量修正后处理
** @The notes :
**===========================================================================================*/
void EnerAftTotalEnerCorrDealHook(u16 befener, u16 aftener);

#endif
