/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : TacUser.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 电池组策略模块用户接口
** @Instructions : 
**===============================================================================================*/
#ifndef _TACUSER_H
#define _TACUSER_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "BSPUserAPI.h"
#include "TacInterface.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void RcvGroupWorkStateCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口 [10,12]按钮或内部口
** @Output    : void
** @Function  : 电池组接收切换工作状态命令处理函数
** @The notes : 通信口或按钮或内部命令
**===============================================================================================*/
void RcvGroupWorkStateCmdAPI(u8 port);

/*=================================================================================================
** @Name      : void RcvGroupWorkModeCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口 [10,12]按钮或内部口
** @Output    : void
** @Function  : 电池组接收切换工作模式切换命令处理函数
** @The notes : 通信口或按钮或内部命令
**===============================================================================================*/
void RcvGroupWorkModeCmdAPI(u8 port);

/*=================================================================================================
** @Name      : void RcvGroupSysClrCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口 [10,12]按钮或内部口
** @Output    : void
** @Function  : 电池组接收切换工作状态命令处理函数
** @The notes : 通信口或按钮或内部命令
**===============================================================================================*/
void RcvGroupSysClrCmdAPI(u8 port);

/*=================================================================================================
** @Name      : void RcvGroupTrigInfoCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : void
** @Function  : 电池组接收触发信息命令处理函数
** @The notes : 通信口
**===============================================================================================*/
void RcvGroupTrigInfoCmdAPI(u8 port);

/*=================================================================================================
** @Name      : void RcvGroupTransInfoCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : void
** @Function  : 电池组接收转发报文命令处理函数
** @The notes : 通信口
**===============================================================================================*/
void RcvGroupTransInfoCmdAPI(u8 port);

/*=================================================================================================
** @Name      : void RcvGroupDispHisErrCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : void
** @Function  : 电池组接收切换显示历史故障信息命令处理函数
** @The notes : 通信口
**===============================================================================================*/
void RcvGroupDispHisErrCmdAPI(u8 port);

/*=================================================================================================
** @Name      : void RcvGroupDispHisEventCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : void
** @Function  : 电池组接收切换显示历史事件信息命令处理函数
** @The notes : 通信口
**===============================================================================================*/
void RcvGroupDispHisEventCmdAPI(u8 port);

/*=================================================================================================
** @Name      : void RcvGroupDispHisWaveRcdCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : void
** @Function  : 电池组接收切换显示历史故障录波信息命令处理函数
** @The notes : 通信口
**===============================================================================================*/
void RcvGroupDispHisWaveRcdCmdAPI(u8 port);

/*=================================================================================================
** @Name      : void RcvGroupDispHisDodCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : void
** @Function  : 电池组接收切换显示历史DOD信息命令处理函数
** @The notes : 通信口
**===============================================================================================*/
void RcvGroupDispHisDodCmdAPI(u8 port);

/*=================================================================================================
** @Name      : void RcvGroupDebugOperCmdAPI(u8 index)
** @Input     : index:调试命令索引
** @Output    : void
** @Function  : 电池组接收切换调试操作命令处理函数
** @The notes : 通信口或按钮命令
**===============================================================================================*/
void RcvGroupDebugOperCmdAPI(u8 index);

/*=================================================================================================
** @Name      : void RcvGroupDebugAffirmCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口 10:按钮 11:内部
** @Output    : void
** @Function  : 电池组接收切换工作状态命令处理函数
** @The notes : 通信口或按钮命令
**===============================================================================================*/
void RcvGroupDebugAffirmCmdAPI(u8 port);

/*=================================================================================================
** @Name      : void TacCtrlGroupSwhStateAPI(e_GroupSwhSort swhSort, e_GPIOState state)
** @Input     : swhSort:接触器名称[0,11] state:控制接触器状态 0:断开 1:闭合
** @Output    : void
** @Function  : 控制电池组相应接触器状态
** @The notes : 控制HS/LS/干接点
**===============================================================================================*/
void TacCtrlGroupSwhStateAPI(e_GroupSwhSort swhSort, e_GPIOState state);

/*=================================================================================================
** @Name      : void TacCtrlGroupRunSwhAllOffAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 控制电池组所有运行接触器均断开
** @The notes : 控制主正/预充/主负接触器
**===============================================================================================*/
void TacCtrlGroupRunSwhAllOffAPI(void);

/*=================================================================================================
** @Name      : e_GPIOState TacGetGroupSwhCtrlStateAPI(e_GroupSwhSort swhSort)
** @Input     : swhSort:接触器名称[0,11]
** @Output    : 电池组相应接触器当前控制输出状态 0:断开 1:闭合
** @Function  : 获取电池组相应接触器当前控制输出状态
** @The notes : 控制信号
**===============================================================================================*/
e_GPIOState TacGetGroupSwhCtrlStateAPI(e_GroupSwhSort swhSort);

/*=================================================================================================
** @Name      : e_GPIOState TacGetGroupSwhBackStateAPI(e_GroupSwhSort swhSort)
** @Input     : swhSort:接触器名称[0,11]
** @Output    : 电池组相应接触器当前回检状态 0:断开 1:闭合
** @Function  : 获取电池组相应接触器当前回检状态
** @The notes : 回检信号(输出信号/板级回检信号/反馈输入信号)
**===============================================================================================*/
e_GPIOState TacGetGroupSwhBackStateAPI(e_GroupSwhSort swhSort);

/*=================================================================================================
** @Name      : u8 TacGetGroupRunSwhAllOffStateAPI(void)
** @Input     : void
** @Output    : 电池组运行接触器均断开状态 FALSE:未全断开 TRUE:全断开
** @Function  : 获取电池组运行接触器均断开状态
** @The notes : 回检信号(输出信号/板级回检信号/反馈输入信号)
**===============================================================================================*/
u8 TacGetGroupRunSwhAllOffStateAPI(void);

/*=================================================================================================
** @Name      : u8 TacGetGroupRunSwhAllOnStateAPI(void)
** @Input     : void
** @Output    : 电池组运行接触器正负极均闭合状态 FALSE:未全闭合 TRUE:全闭合
** @Function  : 获取电池组运行接触器正负极均闭合状态
** @The notes : 回检信号(输出信号/板级回检信号/反馈输入信号)
**===============================================================================================*/
u8 TacGetGroupRunSwhAllOnStateAPI(void);

#endif
