/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : SciParaHandle.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 串口参数配置处理模块接口
** @Instructions : 
**===============================================================================================*/
#ifndef _SCIPARAHANDLE_H
#define _SCIPARAHANDLE_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "BSPUserAPI.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u16 *SciGetPtrParaCfgGroupId(void)
** @Input     : void
** @Output    : 当前读写参数配置组号寄存器地址指针
** @Function  : 获取当前读写参数配置组号寄存器地址指针
** @The notes : 取寄存器地址
**===============================================================================================*/
u16 *SciGetPtrParaCfgGroupId(void);

/*=================================================================================================
** @Name      : u16* SciGetPtrSysGenParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 index:索引号 data:写入数据(请求修改有效)
** @Output    : 读写系统通用参数配置寄存器地址指针
** @Function  : 获取读写系统通用参数配置寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrSysGenParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrSysHWParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 index:索引号 data:写入数据(请求修改有效)
** @Output    : 读写系统通用参数配置寄存器地址指针
** @Function  : 获取读写系统通用参数配置寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrSysHWParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupGenParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 index:索引号 data:写入数据(请求修改有效)
** @Output    : 读写主控通用参数配置寄存器地址指针
** @Function  : 获取读写主控通用参数配置寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupGenParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupHigParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 index:索引号 data:写入数据(请求修改有效)
** @Output    : 读写主控高级参数配置寄存器地址指针
** @Function  : 获取读写主控高级参数配置寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupHigParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupHWParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 index:索引号 data:写入数据(请求修改有效)
** @Output    : 读写主控硬件参数配置寄存器地址指针
** @Function  : 获取读写主控硬件参数配置寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupHWParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupHMIParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 index:索引号 data:写入数据(请求修改有效)
** @Output    : 读写主控触摸屏配置参数配置寄存器地址指针
** @Function  : 获取读写主控触摸屏配置参数配置寄存器地址指针
** @The notes : 可读写,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupHMIParaCfgWR(u8 fncCode, u8 sciNum, u8 index, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrSystemGenParaCfgRO(u8 index)
** @Input     : index:索引号
** @Output    : 读系统通用参数值信息寄存器地址指针
** @Function  : 获取读系统通用参数值信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrSystemGenParaCfgRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrSystemHWParaCfgRO(u8 index)
** @Input     : index:索引号
** @Output    : 读系统硬件参数值信息寄存器地址指针
** @Function  : 获取读系统硬件参数值信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrSystemHWParaCfgRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupGenParaCfgRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组主控通用参数值信息寄存器地址指针
** @Function  : 获取读电池组主控通用参数值信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupGenParaCfgRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupHigParaCfgRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组主控高级参数值信息寄存器地址指针
** @Function  : 获取读电池组主控高级参数值信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupHigParaCfgRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrGroupHWParaCfgRO(u8 index)
** @Input     : index:索引号
** @Output    : 读电池组主控硬件参数值信息寄存器地址指针
** @Function  : 获取读电池组主控硬件参数值信息寄存器地址指针
** @The notes : 只读,取寄存器地址
**===============================================================================================*/
u16* SciGetPtrGroupHWParaCfgRO(u8 index);

#endif
