/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : SciInfoPoint.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 串口信息模块指针接口
** @Instructions : 
**===============================================================================================*/
#ifndef _SCIRCDREAD_H
#define _SCIRCDREAD_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u16* SciGetPtrReadSofStateRO(void)
** @Input     : void
** @Output    : 读故障记录读状态寄存器地址指针
** @Function  : 获取读故障记录读状态寄存器地址指针
** @The notes : 只读,串口查询记录状态
**===============================================================================================*/
u16* SciGetPtrReadSofStateRO(void);

/*=================================================================================================
** @Name      : u16* SciGetPtrSofAllNumRO(void)
** @Input     : void
** @Output    : 故障记录总数目寄存器地址指针
** @Function  : 获取读故障记录总数目寄存器地址指针
** @The notes : 只读
**===============================================================================================*/
u16* SciGetPtrSofAllNumRO(void);

/*=================================================================================================
** @Name      : u16* SciGetPtrSofInfoRO(u8 index)
** @Input     : void
** @Output    : 故障记录详细信息寄存器地址指针
** @Function  : 获取读故障记录详细信息寄存器地址指针
** @The notes : 只读
**===============================================================================================*/
u16* SciGetPtrSofInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrRdSofAffirmWR(u8 fncCode, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 data:写入数据[请求写有效]
** @Output    : 故障记录切换确认寄存器地址指针
** @Function  : 获取读故障记录切换确认寄存器地址指针
** @The notes : 可读写
**===============================================================================================*/
u16* SciGetPtrRdSofAffirmWR(u8 fncCode, u8 sciNum, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrReadSoeStateRO(void)
** @Input     : void
** @Output    : 读事件记录读状态寄存器地址指针
** @Function  : 获取读事件记录读状态寄存器地址指针
** @The notes : 只读,串口查询记录状态
**===============================================================================================*/
u16* SciGetPtrReadSoeStateRO(void);

/*=================================================================================================
** @Name      : u16* SciGetPtrSoeAllNumRO(void)
** @Input     : void
** @Output    : 事件记录总数目寄存器地址指针
** @Function  : 获取读事件记录总数目寄存器地址指针
** @The notes : 只读
**===============================================================================================*/
u16* SciGetPtrSoeAllNumRO(void);

/*=================================================================================================
** @Name      : u16* SciGetPtrSoeInfoRO(u8 index)
** @Input     : void
** @Output    : 事件记录详细信息寄存器地址指针
** @Function  : 获取读事件记录详细信息寄存器地址指针
** @The notes : 只读
**===============================================================================================*/
u16* SciGetPtrSoeInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrRdSoeAffirmWR(u8 fncCode, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 data:写入数据[请求写有效]
** @Output    : 事件记录切换确认寄存器地址指针
** @Function  : 获取读事件记录切换确认寄存器地址指针
** @The notes : 可读写
**===============================================================================================*/
u16* SciGetPtrRdSoeAffirmWR(u8 fncCode, u8 sciNum, u16 data);

/*=================================================================================================
** @Name      : u16* SciGetPtrReadSoeStateRO(void)
** @Input     : void
** @Output    : 读数据记录读状态寄存器地址指针
** @Function  : 获取读数据记录读状态寄存器地址指针
** @The notes : 只读,串口查询记录状态
**===============================================================================================*/
u16* SciGetPtrReadSodStateRO(void);

/*=================================================================================================
** @Name      : u16* SciGetPtrReadSodAllNumRO(u8 index)
** @Input     : index:状态信息索引[0,2]
** @Output    : 运行数据记录总数目寄存器地址指针
** @Function  : 获取运行数据记录总数目寄存器地址指针
** @The notes : 只读,串口查询记录天数和记录数目
**===============================================================================================*/
u16* SciGetPtrReadSodAllNumRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrReadSodDayNumRO(u8 index)
** @Input     : index:每天记录信息索引[0,31]
** @Output    : 每日运行数据记录数目寄存器地址指针
** @Function  : 获取每日运行数据记录数目寄存器地址指针
** @The notes : 只读,串口查询记录当前读取日期和每天记录数目
**===============================================================================================*/
u16* SciGetPtrReadSodDayNumRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrReadSodInfoRO(u8 index)
** @Input     : index:记录详细信息索引[0,55]
** @Output    : 运行数据记录详细信息寄存器地址指针
** @Function  : 获取运行数据记录详细信息寄存器地址指针
** @The notes : 只读,串口查询一条记录详细信息
**===============================================================================================*/
u16* SciGetPtrReadSodInfoRO(u8 index);

/*=================================================================================================
** @Name      : u16* SciGetPtrRdSodAffirmWR(u8 fncCode, u16 data)
** @Input     : fncCode:功能码 sciNum:串口号 data:写入数据[请求写有效]
** @Output    : 读数据记录切换确认寄存器地址指针
** @Function  : 获取读数据记录切换确认寄存器地址指针
** @The notes : 可读写
**===============================================================================================*/
u16* SciGetPtrRdSodAffirmWR(u8 fncCode, u8 sciNum, u16 data);

#endif
