/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : CalcUtil.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 计算工具包模块
** @Instructions :
**===========================================================================================*/
#ifndef _CALCUTIL_H
#define _CALCUTIL_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : u8 SearchHigFromUpTabs8(s8 data, const s8 *array, u8 len)
** @Input     : data:查找的数据 array:数组基地址 len:数组长度
** @Output    : 查找到数据的下标
** @Function  : 二份法查找s8升序数组
** @The notes : 取高端值,注意len为1时
**===========================================================================================*/
u8 SearchHigFromUpTabs8(s8 data, const s8 *array, u8 len);

/*=============================================================================================
** @Name      : u8 SearchHigFromUpTabFaru8(u8 data, u8 *array, u8 len)
** @Input     : data:查找的数据 array:数组基地址 len:数组长度
** @Output    : 查找到数据的下标
** @Function  : 二份法查找 u8升序数组
** @The notes : 取高端值,注意len为1时
**===========================================================================================*/
u8 SearchHigFromUpTabFaru8(u8 data, u8 *array, u8 len);

/*=============================================================================================
** @Name      : u8 SearchHigFromUpTabs16(s16 value, const s16 * array, u8 len)
** @Input     : value:查找的数据 array:数组基地址 len:数组长度
** @Output    : 得到的下标
** @Function  : 从s16升序数组中查找数据对应的下标
** @The notes : 取高端值
**===========================================================================================*/
u8 SearchHigFromUpTabs16(s16 value, const s16 * array, u8 len);

/*=============================================================================================
** @Name      : u16 SearchLowFromUpTabu16(u16 data, const u16* array, u16 len)
** @Input     : data:查找的数据 array:数组基地址 len:数组长度
** @Output    : 查找到数据的下标
** @Function  : 二份法从U16升序数组查找对应下标
** @The notes : 取低端值
**===========================================================================================*/
u16 SearchLowFromUpTabu16(u16 data, const u16 *array, u16 len);

/*=============================================================================================
** @Name      : void AverageCompose(u16 *array, u8 len, u8 *path)
** @Input     : array:数组基地址 len:数组长度 path：电池组组号基址
** @Output    : void
** @Function  : 对电池组按电流值大小进行排序
** @The notes :
**===========================================================================================*/
void AverageCompose(u16 *array, u16 len, u8 *path);

/*=============================================================================================
** @Name      : u8 CalcDataSetBitNum(u32 value)
** @Input     : value:输入值
** @Output    : 输入值为1的位的个数
** @Function  : 计算输入值为1的位的个数
** @The notes :
**===========================================================================================*/
u8 CalcDataSetBitNum(u32 value);

#endif
