/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : CalcInterface.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 计算模块用户接口函数
** @Instructions :
**===========================================================================================*/
#ifndef _CALCINTERFACE_H
#define _CALCINTERFACE_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "DiagInterface.h"
#include "StaInterface.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define  TEMP_CURRLIMIT_NUM     13      //不同温度充放电倍率表列宽(必须与gEepCfg_105[]长度一致)
#define  SLOW_CURRLIMIT_NUM     10      //平滑充放电电流限值表列宽(必须与gGroupParaRO_119[]长度一致)

#define  TEMP_VOLTLIMIT_NUM     14      //不同温度电压限值表列宽(必须与gEepCfg_110[]长度一致)

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
//--------------------------------------电压温度信息计算模块 start-----------------------------
/*=============================================================================================
** @Name      : void GroupDataInfoInit(void)
** @Input     : void
** @Output    : void
** @Function  : 电池数据信息初始化
** @The notes :
**===========================================================================================*/
extern void GroupDataInfoInit(void);

/*=============================================================================================
** @Name      : void CheckVoltCharaTask(void)
** @Input     : void
** @Output    : void
** @Function  : 检测电压特征信息任务
** @The notes : 100ms
**===========================================================================================*/
extern void CheckVoltCharaTask(void);

/*=============================================================================================
** @Name      : void CheckTempCharaTask(void)
** @Input     : void
** @Output    : void
** @Function  : 检测温度特征信息任务
** @The notes : 100ms
**===========================================================================================*/
extern void CheckTempCharaTask(void);

/*=============================================================================================
** @Name      : void CheckAvgCurrTask(void)
** @Input     : void
** @Output    : void
** @Function  : 检测电池组平均电流任务
** @The notes : 100ms
**===========================================================================================*/
extern void CheckAvgCurrTask(void);

/*=============================================================================================
** @Name      : void CurrFilterDeal(s32 curr, u8 flag)
** @Input     : cur:采样电流值(0.1A) flag:立即显示标志(1:立即显示)
** @Output    : void
** @Function  : 对电流进行滤波
** @The notes : 电流采样调用
**===========================================================================================*/
extern void CurrFilterDeal(s32 curr, u8 flag);

/*=============================================================================================
** @Name      : s16 GetGroupAvgCurrAPI(void)
** @Input     : void
** @Output    : 电池组平均电流值(单位:0.1A)
** @Function  : 获取电池组平均电流值
** @The notes :
**===========================================================================================*/
extern s16 GetGroupAvgCurrAPI(void);

/*=============================================================================================
** @Name      : u16 GetGroupSampSumVoltAPI(void)
** @Input     : void
** @Output    : 电池组采样总电压值(单位:0.1V)
** @Function  : 获取电池组采样总电压值
** @The notes :
**===========================================================================================*/
extern u16 GetGroupSampSumVoltAPI(void);

/*----------------------------------电压温度信息计算模块 end-----------------------------------*/

/*----------------------------------充放电电压限值信息计算模块 start---------------------------*/
/*=============================================================================================
** @Name      : void VoltLimCalcTask(void)
** @Input     : void
** @Output    : void
** @Function  : 充放电电压限值计算任务
** @The notes : 1S
**===========================================================================================*/
extern void VoltLimCalcTask(void);

/*=============================================================================================
** @Name      : u16 GetGChgLimSumVAPI(void)
** @Input     : void
** @Output    : 充电总压限值 0.1V
** @Function  : 返回充电总压限值
** @The notes :
**===========================================================================================*/
extern u16 GetGChgLimSumVAPI(void);

/*=============================================================================================
** @Name      : u16 GetGDhgLimSumVAPI(void)
** @Input     : void
** @Output    : 放电总压限值 0.1V
** @Function  : 返回放电总压限值
** @The notes :
**===========================================================================================*/
extern u16 GetGDhgLimSumVAPI(void);

//---------------------------------充放电电压限值信息计算模块end-------------------------------

//--------------------------------充放电电流限值信息计算模块 start------------------------------
/*=============================================================================================
** @Name      : void CurrLimCalcTask(void)
** @Input     : void
** @Output    : void
** @Function  : 充放电电流限值计算任务
** @The notes : 100ms
**===========================================================================================*/
extern void CurrLimCalcTask(void);

/*=============================================================================================
** @Name      : u16 GetChgHReqMaxCurr(void)
** @Input     : void
** @Output    : 充电过流值下允许的最大电流限值 0.1A
** @Function  : 返回充电过流值下允许的最大电流限值
** @The notes : 配置值
**===========================================================================================*/
extern u16 GetChgHReqMaxCurr(void);

/*=============================================================================================
** @Name      : u16 GetDhgHReqMaxCurr(void)
** @Input     : void
** @Output    : 放电过流值下允许的最大电流限值 0.1A
** @Function  : 返回放电过流值下允许的最大电流限值
** @The notes : 配置值
**===========================================================================================*/
extern u16 GetDhgHReqMaxCurr(void);

/*=============================================================================================
** @Name      : u16 GetGChgLimCurrAPI(void)
** @Input     : void
** @Output    : 充电电流限值 0.1A
** @Function  : 返回充电电流限值
** @The notes :
**===========================================================================================*/
extern u16 GetGChgLimCurrAPI(void);

/*=============================================================================================
** @Name      : u16 GetGDhgLimCurrAPI(void)
** @Input     : void
** @Output    : 放电电流限值 0.1A
** @Function  : 返回放电电流限值
** @The notes :
**===========================================================================================*/
extern u16 GetGDhgLimCurrAPI(void);

/*=============================================================================================
** @Name      : u16 GetGChgLimPowerAPI(void)
** @Input     : void
** @Output    : 充电功率限值 0.1kW
** @Function  : 返回充电功率限值
** @The notes :
**===========================================================================================*/
extern u16 GetGChgLimPowerAPI(void);

/*=============================================================================================
** @Name      : u16 GetGDhgLimPowerAPI(void)
** @Input     : void
** @Output    : 放电功率限值 0.1kW
** @Function  : 返回放电功率限值
** @The notes :
**===========================================================================================*/
extern u16 GetGDhgLimPowerAPI(void);

//--------------------------------充放电电流限值信息计算模块 end--------------------------------

//---------------------------------充放电电流限值平滑模块 start---------------------------------
/*=============================================================================================
** @Name      : void CurrLimFallTask(void)
** @Input     : void
** @Output    : void
** @Function  : 充放电电流限值平滑任务
** @The notes : 100ms
**===========================================================================================*/
extern void CurrLimFallTask(void);

/*=============================================================================================
** @Name      : void ResetCurrLimFallAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 复位充放电电流平滑限制
** @The notes : 平滑步骤清零
**===========================================================================================*/
extern void ResetCurrLimFallAPI(void);

/*=============================================================================================
** @Name      : u8 GetFallChgCIndexStepAPI(void)
** @Input     : void
** @Output    : 放电电流限值
** @Function  : 返回平滑降充电电流限值当前进度步骤
** @The notes : 当前降到第几个点
**===========================================================================================*/
extern u8 GetFallChgCIndexStepAPI(void);

/*=============================================================================================
** @Name      : u8 GetFallDhgCIndexStepAPI(void)
** @Input     : void
** @Output    : 放电电流限值
** @Function  : 返回平滑降放电电流限值当前进度步骤
** @The notes : 当前降到第几个点
**===========================================================================================*/
extern u8 GetFallDhgCIndexStepAPI(void);

/*=============================================================================================
** @Name      : u16 GetFallChgLimCurr(void)
** @Input     : void
** @Output    : 充电电流限值
** @Function  : 返回平滑计算的充电电流限值
** @The notes :
**===========================================================================================*/
extern u16 GetFallChgLimCurr(void);

/*=============================================================================================
** @Name      : u16 GetFallDhgLimCurr(void)
** @Input     : void
** @Output    : 放电电流限值
** @Function  : 返回平滑计算的放电电流限值
** @The notes :
**===========================================================================================*/
extern u16 GetFallDhgLimCurr(void);

/*----------------------------------充放电电流限值平滑模块 end-------------------------------------*/

/*=================================================================================================
** @Name      : u8 CalcGetGroupCellVExpStateHook(void)
** @Input     : void
** @Output    : 电池组单体电压异常状态: 0:正常 1:异常
** @Function  : 获取电池组单体电压异常状态
** @The notes : 从控电压采样失效/断线/CAN断线时从控单节电压异常
**===============================================================================================*/
u8 CalcGetGroupCellVExpStateHook(void);

/*=============================================================================================
** @Name      : u8 CalcGetGroupCellTExpStateHook(void)
** @Input     : void
** @Output    : 电池组单体温度异常状态 0:正常 1:异常
** @Function  : 获取电池组单体温度异常状态
** @The notes : 从控温度计采样失效/断线/CAN断线时从控单节温度异常
**===========================================================================================*/
u8 CalcGetGroupCellTExpStateHook(void);

/*=================================================================================================
** @Name      : u8 CalcGetGropuNeedSysLimStateHook(void)
** @Input     : void
** @Output    : 充放电需限制状态:0正常 1需限制充放电
** @Function  : 获取电池组充放电需限制状态
** @The notes : 产生充放电限制故障或按下停机按钮
**===============================================================================================*/
u8 CalcGetGropuNeedSysLimStateHook(void);

/*=============================================================================================
** @Name      : u8 CalcGetGroupNeedChgLimStateHook(void)
** @Input     : void
** @Output    : 电池组需要充电限制状态: 0正常 1需充电限制
** @Function  : 获取电池组需要充电限制状态
** @The notes : 充满或充电限制
**===========================================================================================*/
u8 CalcGetGroupNeedChgLimStateHook(void);

/*=============================================================================================
** @Name      : u8 CalcGetGroupNeedDhgLimStateHook(void)
** @Input     : void
** @Output    : 电池组需要放电限制状态: 0正常 1需放电限制
** @Function  : 获取电池组需要放电限制状态
** @The notes : 放空或放电限制
**===========================================================================================*/
u8 CalcGetGroupNeedDhgLimStateHook(void);

/*=============================================================================================
** @Name      : u16 CalcGetChgLimMaxSumVHook(void)
** @Input     : void
** @Output    : 电池组总压充电截止最大电压值(单位:0.1V)
** @Function  : 获取电池组总压充电截止最大电压
** @The notes : 总压高压2级限值(充电限制)
**===========================================================================================*/
u16 CalcGetChgLimMaxSumVHook(void);

/*=============================================================================================
** @Name      : u16 CalcGetDhgLimMinSumVHook(void)
** @Input     : void
** @Output    : 电池组总压放电截止最小电压值(单位:0.1V)
** @Function  : 获取电池组总压放电截止最小电压
** @The notes : 总压低压2级限值(放电限制)
**===========================================================================================*/
u16 CalcGetDhgLimMinSumVHook(void);

/*=============================================================================================
** @Name      : u16 CalcGetChgLimCellVoltHook(void)
** @Input     : void
** @Output    : 电池组充电截止单体电压值(单位:1mV)
** @Function  : 获取电池组充电截止单体电压
** @The notes : 单体高压2级限值(充电限制)
**===========================================================================================*/
u16 CalcGetChgLimCellVoltHook(void);

/*=============================================================================================
** @Name      : u16 CalcGetDhgLimCellVoltHook(void)
** @Input     : void
** @Output    : 电池组放电截止单体电压值(单位:1mV)
** @Function  : 获取电池组放电截止单体电压
** @The notes : 单体低压2级限值(放电限制)
**===========================================================================================*/
u16 CalcGetDhgLimCellVoltHook(void);

/*=============================================================================================
** @Name      : s16 CalcGetChgCDnFstHTempHook(void)
** @Input     : void
** @Output    : 充电高温降电流限值的起始温度 1℃
** @Function  : 获取充电高温降电流限值的起始温度
** @The notes : 默认45℃开始限充电电流限值
**===========================================================================================*/
s16 CalcGetChgCDnFstHTempHook(void);

/*=============================================================================================
** @Name      : s16 CalcGetChgCDnFstLTempHook(void)
** @Input     : void
** @Output    : 充电低温降电流限值的起始温度 1℃
** @Function  : 获取充电低温降电流限值的起始温度
** @The notes : 默认5℃开始限充电电流限值
**===========================================================================================*/
s16 CalcGetChgCDnFstLTempHook(void);

/*=============================================================================================
** @Name      : s16 CalcGetDhgCDnFstHTempHook(void)
** @Input     : void
** @Output    : 放电高温降电流限值的起始温度 1℃
** @Function  : 获取放电高温降电流限值的起始温度
** @The notes : 默认45℃开始限放电电流限值
**===========================================================================================*/
s16 CalcGetDhgCDnFstHTempHook(void);

/*=============================================================================================
** @Name      : s16 CalcGetDhgCDnFstLTempHook(void)
** @Input     : void
** @Output    : 放电低温降电流限值的起始温度 1℃
** @Function  : 获取放电低温降电流限值的起始温度
** @The notes : 默认0℃开始限放电电流限值
**===========================================================================================*/
s16 CalcGetDhgCDnFstLTempHook(void);

/*=============================================================================================
** @Name      : s16 CalcGetChgCDnLstHTempHook(void)
** @Input     : void
** @Output    : 充电高温降电流限值结束温度 1℃
** @Function  : 获取充电高温降电流限值结束温度
** @The notes : 充电高温2级(充电截止)为降充电电流限值终点
**===========================================================================================*/
s16 CalcGetChgCDnLstHTempHook(void);

/*=============================================================================================
** @Name      : s16 CalcGetChgCDnLstLTempHook(void)
** @Input     : void
** @Output    : 充电低温降电流限值结束温度 1℃
** @Function  : 获取充电低温降电流限值结束温度
** @The notes : 充电低温2级(充电截止)为降充电电流限值终点
**===========================================================================================*/
s16 CalcGetChgCDnLstLTempHook(void);

/*=============================================================================================
** @Name      : s16 CalcGetDhgCDnLstHTempHook(void)
** @Input     : void
** @Output    : 放电高温降电流限值结束温度 1℃
** @Function  : 获取放电高温降电流限值结束温度
** @The notes : 放电高温2级(放电截止)为降放电电流限值终点
**===========================================================================================*/
s16 CalcGetDhgCDnLstHTempHook(void);

/*=============================================================================================
** @Name      : s16 CalcGetDhgCDnLstLTempHook(void)
** @Input     : void
** @Output    : 放电低温降电流限值结束温度 1℃
** @Function  : 获取放电低温降电流限值结束温度
** @The notes : 放电低温2级(放电截止)为降放电电流限值终点
**===========================================================================================*/
s16 CalcGetDhgCDnLstLTempHook(void);

/*=================================================================================================
** @Name      : u16 CalcGetDcSumSampVolt(void)
** @Input     : void
** @Output    : 电池组直流端总电压采样值(0.1V)
** @Function  : 获取电池组直流端总电压采样值
** @The notes : 根据采样方式
**===============================================================================================*/
u16 CalcGetDcSumSampVolt(void);

/*=================================================================================================
** @Name      : u16 CalcGetDcPreSampVolt(void)
** @Input     : void
** @Output    : 电池组直流端预充电压采样值(0.1V)
** @Function  : 获取电池组直流端预充电压采样值
** @The notes : 根据采样方式
**===============================================================================================*/
u16 CalcGetDcPreSampVolt(void);

/*----------------------------------故障诊断引用接口 start----------------------------------------*/
/*=================================================================================================
** @Name      : u8 DiagGetRcvAllSlaveFlagAPI(void)
** @Input     : void
** @Output    : 接收到全部从控报文标志[0:未接收,1:正在接收,2:全部接收]
** @Function  : 获取接收到全部从控报文标志
** @The notes : 任一帧报文
**===============================================================================================*/
extern u8 DiagGetRcvAllSlaveFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetRcvAllCellFlagAPI(void)
** @Input     : void
** @Output    : 接收到全部单体信息报文标志[0:未接收,1:正在接收,2:全部接收]
** @Function  : 获取接收到全部单体信息报文标志
** @The notes : 全部单体电压和温度
**===============================================================================================*/
extern u8 DiagGetRcvAllCellFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetGroupSosLevel(void)
** @Input     : void
** @Output    : void
** @Function  : 获取电池组总安全等级SOS
** @The notes : 包括当前等级和推断等级
**===============================================================================================*/
extern u8 DiagGetGroupSosLevel(void);

/*=================================================================================================
** @Name      : void DiagClrGroupSosLevel(void)
** @Input     : void
** @Output    : void
** @Function  : 清除电池组总安全等级SOS
** @The notes : 包括当前等级和推断等级
**===============================================================================================*/
extern void DiagClrGroupSosLevel(void);

/*----------------------------------故障诊断引用接口 end------------------------------------------*/

#endif
