/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : CapEnerCorr.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 总容量总电能自动标定模块
** @Instructions :
**===========================================================================================*/
#ifndef _CAPENERCORR_H
#define _CAPENERCORR_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define  CAP_CHECK_RECORD_T     600     //容量检测时间记录时间间隔(1s)
#define  CAP_CHECK_MIN_T        600     //容量检测充放电最小有效时间(1s)
#define  CAP_CHECK_MAX_T        43200   //容量检测充放电最大有效时间(1Min)

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
//容量能量检测记录信息(顺序不能修改,否则需改变EEP记录顺序)
typedef struct
{
    u32 effect;         //是否有效
    u32 timer;          //经历时间
    u32 chgCap;         //充电电量
    u32 dhgCap;         //放电电量
    u32 chgEner;        //充电电能
    u32 dhgEner;        //放电电能
    u32 allCap;         //检测到的总容量
    u32 allEner;        //检测到的总能量
}t_CapECorr;

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void TotalCapEnerCorrInit(void)
** @Input     : void
** @Output    : void
** @Function  : 总容量总能量自动标定初始化
** @The notes :
**===========================================================================================*/
void TotalCapEnerCorrInit(void);

/*=============================================================================================
** @Name      : void TotalCapEnerCorrTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组总容量总能量自动标定任务
** @The notes : 1s
**===========================================================================================*/
void TotalCapEnerCorrTask(void);

/*=============================================================================================
** @Name      : u8 GetCapEnerDropExpAPI(void)
** @Input     : void
** @Output    : 容量衰减异常标志(Bit0:总容量检测衰减 bit1:总能量衰减)[0正常 1异常]
** @Function  : 获取总容量总能量衰减异常标志
** @The notes :
**===========================================================================================*/
u8 GetCapEnerDropExpAPI(void);

#endif
