/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : RecordWave.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 故障录波记录模块处理
** @Instructions : 电压、电流和温度故障录波记录
**===============================================================================================*/
#ifndef _RECORDWAVE_H
#define _RECORDWAVE_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "RecordInterface.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/
#define RCD_CV_WAV_CYCLE            20                                  /*单体电压高低压录波周期[单位:100ms](默认2s,不需录波配置0)*/
#define RCD_HV_WAV_CYCLE            0                                   /*总电压高低压录波周期[单位:100ms](默认2s,不需录波配置0)*/
#define RCD_CT_WAV_CYCLE            0                                   /*单体温度高低压录波周期[单位:100ms](默认3s,不需录波配置0)*/
#define RCD_CO_WAV_CYCLE            10                                  /*充放电过流录波周期[单位:100ms](默认1s,不需录波配置0)*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/
/*故障录波缓存区信息*/
typedef struct
{
    u8 pWavFlg;                         /*故障录波标志[0:等待录波 1:触发录波 2:正在录波 3:录波完成]*/
    u8 pWavNum;                         /*故障录波点数*/
    u16 *pWavBuf;                       /*故障录波缓存区指针*/
    u16 pWavSort;                       /*故障录波类型[0:无效记录 1:单体二级过压,2:单体一级过压,3:单体二级欠压,4:单体一级欠压;5:总压二级过压,6:总压一级过压,7:总压二级欠压,8:总压一级欠压;9:充电二级过温;10:充电一级过温;11:充电二级低温;12:充电一级低温;13:放电二级过温;14:放电一级过温;15:放电二级低温;16:放电一级低温;17:充电二级过流;18:充电一级过流;19:放电二级过流;20:放电一级过流;21:充电超限值;22:放电超限值]*/
    u16 pWavYear;                       /*故障录波时间-年*/
    u16 pWavMD;                         /*故障录波时间-月日*/
    u16 pWavHM;                         /*故障录波时间-时分*/
    u16 pWavSec;                        /*故障录波时间-秒*/

}t_RcdFatWavBuff;

/*故障录波状态*/
typedef enum
{
	eFatWavState_Wait = 0,              /*等待录波*/
	eFatWavState_Trig = 1,              /*触发录波*/
	eFatWavState_Doig = 2,              /*正在录波*/
	eFatWavState_Fin  = 3,              /*录波完成*/
}e_RcdFatWavState;

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void RcdFaultWaveBuffInit(void)
** @Input     : void
** @Output    : void
** @Function  : 故障录波缓存区初始化
** @The notes : 模块参数后/用户读写记录前调用
**===============================================================================================*/
void RcdFaultWaveBuffInit(void);

/*=================================================================================================
** @Name      : void RcdFaultWaveHandleTask(void)
** @Input     : void
** @Output    : void
** @Function  : 故障录波处理任务
** @The notes : 100ms周期
**===============================================================================================*/
void RcdFaultWaveHandleTask(void);

/*=================================================================================================
** @Name      : void RcdSetFaultWaveTrigAPI(e_RcdFatWavSort sort)
** @Input     : sort:录波类型[0:无效记录 1:单体二级过压,2:单体一级过压,3:单体二级欠压,4:单体一级欠压;5:总压二级过压,6:总压一级过压,7:总压二级欠压,8:总压一级欠压;9:充电二级过温;10:充电一级过温;11:充电二级低温;12:充电一级低温;13:放电二级过温;14:放电一级过温;15:放电二级低温;16:放电一级低温;17:充电二级过流;18:充电一级过流;19:放电二级过流;20:放电一级过流;21:充电超限值;22:放电超限值]
** @Output    : void
** @Function  : 设置触发开始录波
** @The notes : 产生故障需要录波时调用
**===============================================================================================*/
void RcdSetFaultWaveTrigAPI(e_RcdFatWavSort sort);

/*=================================================================================================
** @Name      : e_RcdFatWavState RcdGetFaultWaveStateAPI(void)
** @Input     : void
** @Output    : 当前故障录波状态:0:等待录波 1:触发录波 2:正在录波 3:录波完成
** @Function  : 获取当前故障录波状态
** @The notes : 判断当前是否需要故障录波存储
**===============================================================================================*/
e_RcdFatWavState RcdGetFaultWaveStateAPI(void);

/*=================================================================================================
** @Name      : u8 RcdGetFaultWaveInfoAPI(u16 *wavInfo, u8 len)
** @Input     : *wavInfo:获取到的故障录波信息 len:信息长度
** @Output    : TRUE:获取成功(信息有效) FALSE:获取失败(信息无效)
** @Function  : 获取当前故障录波信息
** @The notes : 当有故障录波完成时获取有效(获取后重新等待录波)
**===============================================================================================*/
u8 RcdGetFaultWaveInfoAPI(u16 *wavInfo, u8 len);

#endif
