/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : BSPConfig.h
** @Founder      : ZSY342
** @Date         : 2019.10.1
** @Function     : 各驱动模块初始化接口
** @Instructions :
**===========================================================================================*/
#ifndef _BSPUSERCFG_H
#define _BSPUSERCFG_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPTypeDef.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
/*=======================================各个模块使能配置=====================================*/
#define FTM0_FUN_EN     0           /*定时器0通道使能                1使能该模块  0禁止该模块*/
#define FTM1_FUN_EN     1           /*定时器1通道使能                1使能该模块  0禁止该模块*/
#define FTM2_FUN_EN     1           /*定时器2通道使能                1使能该模块  0禁止该模块*/
#define FTM3_FUN_EN     1           /*定时器3通道使能                1使能该模块  0禁止该模块*/
#define	CAN0_FUN_EN     1           /*CAN0模块使能                     1使能该模块  0禁止该模块*/
#define	CAN1_FUN_EN	    1           /*CAN1模块使能                     1使能该模块  0禁止该模块*/
#define CAN2_FUN_EN     1           /*CAN2模块使能                     1使能该模块  0禁止该模块*/
#define SCI0_FUN_EN     1           /*SCI_0使能                          1使能该模块  0禁止该模块*/
#define SCI1_FUN_EN     1           /*SCI_1使能                          1使能该模块  0禁止该模块*/
#define SCI2_FUN_EN     1           /*SCI_2使能                          1使能该模块  0禁止该模块*/
#define EEP_FUN_EN      1           /*EEPROM模块使能                 1使能该模块  0禁止该模块*/
#define FLASH_FUN_EN    1           /*FALSH模块使能                   1使能该模块  0禁止该模块*/
#define GPIO_FUN_EN     1           /*IO口模块使能                     1使能该模块  0禁止该模块*/
#define SPI0_FUN_EN     1           /*SPI_0使能                           1使能该模块  0禁止该模块*/
#define SPI1_FUN_EN     1           /*SPI_1使能                           1使能该模块  0禁止该模块*/
#define SPI2_FUN_EN     1           /*SPI_2使能                           1使能该模块  0禁止该模块*/
#define SPI3_FUN_EN     1           /*SPI_3使能                           1使能该模块  0禁止该模块*/
#define I2C0_FUN_EN     0           /*IIC_0使能                           1使能该模块  0禁止该模块*/
#define I2C1_FUN_EN     0           /*IIC_1使能                           1使能该模块  0禁止该模块*/
#define ADC_FUN_EN      1           /*ADC采样模块使能                1使能该模块  0禁止该模块*/
#define RTC_FUN_EN      0           /*内部RTC模块使能                1使能该模块  0禁止该模块*/
#define PWM_FUN_EN      1           /*PWM模块使能                        1使能该模块  0禁止该模块*/
#define WDOG_FUN_EN     0           /*内部看门狗模块使能           1使能该模块  0禁止该模块*/
#define LPIT_FUN_EN     1           /*LPIT模块使能                      1使能该模块  0禁止该模块*/
#define DMA_FUN_EN      0           /*DMA模块使能       		1使能该模块  0禁止该模块*/

/*=======================================定时器配置===========================================*/
/*定时时间选择 各路定时器定时时间不能够一致,以免影响中断*/
#define SYSTICK_TIMES   (100)       /*1000:表示1ms 5000:表示5ms 10000:表示10ms*/
#define FTM0_TIMES      (500)       /*1000:表示1ms 5000:表示5ms 10000:表示10ms*/
#define FTM1_TIMES      (1000)      /*1000:表示1ms 5000:表示5ms 10000:表示10ms*/
#define FTM2_TIMES      (5000)      /*1000:表示1ms 5000:表示5ms 10000:表示10ms*/
#define FTM3_TIMES      (5000)      /*1000:表示1ms 5000:表示5ms 10000:表示10ms*/

/*=======================================时钟 begin===========================================*/
#define	OSC_CLOCK       (16)        /*晶振时钟 只能是 8 12 16*/
#define	Bus_CLOCK       (80)        /*总线时钟 只能是 40 80 112*/

/*=======================================时钟 end=============================================*/

/*=======================================SCI begin===========================================*/
#define SCI0_BPS        (19200)     /*只能是4800 9600 19200 38400*/
#define SCI1_BPS        (19200)     /*只能是4800 9600 19200 38400*/
#define SCI2_BPS        (19200)     /*只能是4800 9600 19200 38400*/

/*=======================================SCI end=============================================*/

/*=======================================SPI begin===========================================*/
#define SPI0_BPS        (1)         /*SPI0通讯波特率*/
#define SPI1_BPS        (1)         /*SPI1通讯波特率*/
#define SPI2_BPS        (1)         /*SPI2通讯波特率*/
#define SPI3_BPS        (1)         /*SPI3通讯波特率*/

/*=======================================SPI end=============================================*/

/*=======================================WATCHDOG begin======================================*/
#define WATCH_DOG_FREQ  (1)         /*喂狗频率(100ms,1-65的整数)*/

/*=======================================CAN begin===========================================*/
#define	CAN0_BPS        250         /*只能为 125 250 500 1000(单位为K)*/
#define	CAN1_BPS        250         /*只能为 125 250 500 1000(单位为K)*/
#define	CAN2_BPS        250         /*只能为 125 250 500 1000(单位为K)*/

/*=======================================CAN end=============================================*/
/*=============================================================================================
** @Data type definition
**===========================================================================================*/
/*各功能模块使能配置转化为参数结构体*/
typedef union _FunConfig_
{
    u32 Word;
    struct
    {
        u16 FTM0En      :1;         /*FTM功能使能*/
        u16 FTM1En      :1;
        u16 FTM2En      :1;
        u16 FTM3En      :1;
        u16 CAN0En      :1;         /*CAN功能使能*/
        u16 CAN1En      :1;
        u16 CAN2En      :1;
        u16 SCI0En      :1;         /*UART功能使能位*/
        u16 SCI1En      :1;
        u16 SCI2En      :1;
        u16 SPI0En      :1;         /*SPI功能使能位*/
        u16 SPI1En      :1;
        u16 SPI2En      :1;
        u16 SPI3En      :1;
        u16 I2C0En      :1;         /*I2C0功能使能位*/
        u16 I2C1En      :1;         /*I2C1功能使能位*/
        u16 GPIOEn      :1;         /*GPIO功能使能位*/
        u16 ADCEn       :1;         /*AD采样功能使能位*/
        u16 RTCEn       :1;         /*内部RTC功能使能位*/
        u16 PWMEn       :1;         /*PWM功能使能位*/
        u16 EEPEn       :1;         /*EEP功能使能位*/
        u16 FLASHEn     :1;         /*FLASH功能使能*/
        u16 WDOGEn      :1;         /*内部喂狗功能使能位*/
        u16 LPITEn      :1;         /*LPIT功能使能位*/
		u16 DMAEn       :1;         /*DMA功能使能位*/
    }Bits;
}u_BSPFunCfg;

/*各功能模块参数*/
typedef struct
{
    u8 OscRate;                     /*晶振频率(1MHz)*/
    u8 BusRate;                     /*BUS频率(1MHz)*/
    u16 Ftm0Time;                   /*FTM0定时中断周期(1μs)*/
    u16 Ftm1Time;                   /*FTM1定时中断周期(1μs)*/
    u16 Ftm2Time;                   /*FTM2定时中断周期(1μs)*/
    u16 Ftm3Time;                   /*FTM3定时中断周期(1μs)*/
    u16 Can0Rate;                   /*CAN0通信波特率(1kbps)*/
    u16 Can1Rate;                   /*CAN1通信波特率(1kbps)*/
    u16 Can2Rate;                   /*CAN2通信波特率(1kbps)*/
    u16 Sci0Rate;                   /*SCI0通信波特率(1bps)*/
    u16 Sci1Rate;                   /*SCI1通信波特率(1bps)*/
    u16 Sci2Rate;                   /*SCI2通信波特率(1bps)*/
    u16 Spi0Rate;                   /*SPI0通信波特率(1Mbps)*/
    u16 Spi1Rate;                   /*SPI1通信波特率(1Mbps)*/
    u16 Spi2Rate;                   /*SPI2通信波特率(1Mbps)*/
    u16 Spi3Rate;                   /*SPI3通信波特率(1Mbps)*/
    u16 I2cRate;                    /*I2C通信波特率(1Kbps)*/
    u16 WdogTime;                   /*WDOG周期(1ms)*/

} s_BSPParaCfg;

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void BSPUserCfgInit(void)
** @Input     : void
** @Output    : void
** @Function  : BSP驱动功能用户配置模块参数初始化
** @The notes : Main()函数调用，上电初始化
**===========================================================================================*/
void BSPUserCfgInit(void);

/*=============================================================================================
** @Name      : void BSPUserCfgInit(void)
** @Input     : void
** @Output    : void
** @Function  : 所有底层驱动模块进行初始化
** @The notes : Main()函数调用，上电初始化
**===========================================================================================*/
void BSPDriverInit(void);

/*=============================================================================================
** @Name      : void BSPUserCfgInit(void)
** @Input     : void
** @Output    : void
** @Function  : 所有外围设备驱动模块进行初始化
** @The notes : Main()函数调用，上电初始化。必须在底层驱动初始化完成后调用
**===========================================================================================*/
void DEVDriverInit(void);

#endif
