/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : OSUserHOOK.h
** @Founder      : ZSY342
** @Date         : 2019.10.1
** @Function     : BSP定时任务服务模块
** @Instructions :
**===========================================================================================*/
#ifndef _OSUSERHOOK_H_
#define _OSUSERHOOK_H_
/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
/*RTOS任务优先级ID：0是RTOS系统空闲任务ID，系统启动自行分配，数字越大优先级越高，其他任务ID由用户自行使用分配*/
#define	RTOS_ID_TIMER5MS        1        /* 5ms定时任务优先级 任务优先级不能重复 */
#define	RTOS_ID_TIMER10MS       2        /* 10ms定时任务优先级 任务优先级不能重复 */
#define	RTOS_ID_TIMER50MS       3        /* 50ms定时任务优先级 任务优先级不能重复 */
#define	RTOS_ID_TIMER100MS      4        /* 100ms定时任务优先级 任务优先级不能重复 */
#define	RTOS_ID_TIMER200MS      5        /* 200ms定时任务优先级 任务优先级不能重复 */
#define	RTOS_ID_TIMER300MS      6        /* 300ms定时任务优先级 任务优先级不能重复 */
#define	RTOS_ID_TIMER400MS      7        /* 400ms定时任务优先级 任务优先级不能重复 */
#define	RTOS_ID_TIMER500MS      8        /* 500ms定时任务优先级 任务优先级不能重复 */
#define	RTOS_ID_TIMER1000MS     9        /* 1000ms定时任务优先级 任务优先级不能重复 */
#define	RTOS_ID_TIMER2000MS     10       /* 2000ms定时任务优先级 任务优先级不能重复 */

#define	RTOS_ID_CELL_SAMP       11		 /* 单体电池信息(单体电压、温度)采样任务 */
#define	RTOS_ID_LV_SAMP         12		 /* 低压信息采样任务 */
#define	RTOS_ID_HV_SAMP         13		 /* 高压信息采样任务 */
#define	RTOS_ID_CAN_SEND        14		 /* CAN信息发送任务,通讯任务优先级最高 */
#define	RTOS_ID_CAN_RCV         15		 /* CAN信息接收任务 ,通讯任务优先级最高*/
#define	RTOS_ID_UART_RCV        16		 /* UART信息接收任务 ,通讯任务优先级最高*/

/*====================================定义任务堆栈大小========================================*/
#define CELL_SAMP_TASK_SIZE     300      /* 单体信息采集任务堆栈大小 */
#define LV_SAMP_TASK_SIZE       120      /* 低压信息采集任务堆栈大小 */
#define HV_SAMP_TASK_SIZE       400      /* 高压信息采集任务堆栈大小 */
#define CAN_SEND_TASK_SIZE      400      /* CAN信息发送任务堆栈大小 */
#define CAN_RCV_TASK_SIZE       400      /* CAN信息接收任务堆栈大小 */
#define UART_RCV_TASK_SIZE      200      /* UART信息接收任务堆栈大小 */

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void RtosTaskStart(void)
** @Input     : void
** @Output    : void
** @Function  : RTOS定时任务
** @The notes :
**===========================================================================================*/
void RtosTaskStart(void);

#endif
