/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : RcdDisplayUser.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 电池历史记录显示用户处理模块
** @Instructions : 读取历史记录显示
**===============================================================================================*/
#ifndef _RCDDISPLAYUSER_H
#define _RCDDISPLAYUSER_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : u8 ErrRcdUpdateReadInfoAPI(void)
** @Input     : void
** @Output    : TRUE:更新成功 FALSE:更新失败
** @Function  : 读取一条故障记录更新显示
** @The notes : 用户读取故障记录信息前调用
**===============================================================================================*/
u8 ErrRcdUpdateReadInfoAPI(void);

/*=================================================================================================
** @Name      : u8 EventRcdUpdateReadInfoAPI(void)
** @Input     : void
** @Output    : TRUE:更新成功 FALSE:更新失败
** @Function  : 读取一条事件记录更新显示
** @The notes : 用户读取事件记录信息前调用
**===============================================================================================*/
u8 EventRcdUpdateReadInfoAPI(void);

/*=================================================================================================
** @Name      : void ErrEvntRcdUpdateStateAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 更新当前故障记录和事件记录状态信息
** @The notes : 用户读取故障记录和事件记录数目前调用
**===============================================================================================*/
void ErrEvntRcdUpdateStateAPI(void);

/*=================================================================================================
** @Name      : u8 DataRcdUpdateDisplayAPI(void)
** @Input     : void
** @Output    : TRUE:更新成功 FALSE:更新失败
** @Function  : 更新显示一条数据记录
** @The notes : 用户读取数据记录信息前调用
**===============================================================================================*/
u8 DataRcdUpdateDisplayAPI(void);

/*=================================================================================================
** @Name      : void DataRcdUpdateRcdStateAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 更新当前数据记录状态信息
** @The notes : 用户读取数据记录状态前调用
**===============================================================================================*/
void DataRcdUpdateRcdStateAPI(void);

/*=================================================================================================
** @Name      : void DataRcdSetReadDateAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 设置需要读取的数据记录信息日期
** @The notes : 用户接收切换数据记录读取日期命令时调用
**===============================================================================================*/
void DataRcdSetReadDateAPI(void);

/*=================================================================================================
** @Name      : void DataRcdClrDateInfoAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除指定日期数据记录信息
** @The notes : 用户接收清除数据记录命令时调用
**===============================================================================================*/
void DataRcdClrDateInfoAPI(void);

/*=================================================================================================
** @Name      : void ErrRcdClrDateInfoAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除指定日期故障记录信息
** @The notes : 用户接收清除故障记录命令时调用
**===============================================================================================*/
void ErrRcdClrDateInfoAPI(void);

/*=================================================================================================
** @Name      : void EventRcdClrDateInfoAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除指定日期事件记录信息
** @The notes : 用户接收清除事件记录命令时调用
**===============================================================================================*/
void EventRcdClrDateInfoAPI(void);

/*=================================================================================================
** @Name      : void WaveRcdClrDateInfoAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除指定日期故障录波信息
** @The notes : 用户接收清除故障录波命令时调用
**===============================================================================================*/
void WaveRcdClrDateInfoAPI(void);

/*=================================================================================================
** @Name      : void DodRcdClrAllInfoAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除全部DOD记录信息
** @The notes : 用户接收清除历史DOD记录命令时调用
**===============================================================================================*/
void DodRcdClrAllInfoAPI(void);

#endif
