/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : CellAFESamp.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 单体电压采样模块
** @Instructions :
**===========================================================================================*/
#ifndef _CellAFESAMP_H
#define _CellAFESAMP_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPTypedef.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define MAXVOLTNUM          18      /*电池节数*/
#define MAXTEMPNUM          4       /*温度节数*/
#define FILTER_NUM          4       /*滤波次数*/
#define LTC_RD_AD_T         5       /*读1个LTC6813芯片AD需要的时间(菊花链通信时间) 1ms*/
#define LTC_GPIO_CT_AD_BIT  0x0F    /*LTC6813芯片GPIO通道采单体温度AD值对应通道Bit位*/

/*采样参数配置*/
#define CEL_T_TAB_LEN       167     /*电池单体温度表长度(-41~125℃)*/
#define BAL_T_TAB_LEN       167     /*均衡板温温度表长度(-41~125℃)*/

#define MAX_LTC6813_NUM     25      /*菊花链上从件个数*/

#define CELF_COMP_VOLT      38      /*首节单体补偿电压值 0.1mV*/
#define CELM_COMP_VOLT      23      /*中间单体补偿电压值 0.1mV*/
#define CELE_COMP_VOLT      25      /*尾节单体补偿电压值 0.1mV*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void CellLTC6813Init(void)
** @Input     : void
** @Output    : void
** @Function  : 初始化6813配置寄存器所需的变量
** @The notes :
**===========================================================================================*/
void CellLTC6813Init(void);

/*=============================================================================================
** @Name      : void CellInfoSampleTask(void *p)
** @Input     : *p:形参,任务函数参数需要
** @Output    : void
** @Function  : 单体电压、温度采样任务
** @The notes :
**===========================================================================================*/
void CellInfoSampleTask(void *p);

/*=============================================================================================
** @Name      : void LTC6813PasEqual(u32* commande, u8 icNum)
** @Input     : commande:均衡命令   icNum:从件个数
** @Output    : void
** @Function  : 6813的被动均衡执行函数
** @The notes : 支持18S均衡
**===========================================================================================*/
void LTC6813PasEqual(u32* commande, u8 icNum);

/*=============================================================================================
** @Name      : u8 GetCellVSampFinFlagAPI(void)
** @Input     : void
** @Output    : 完成标志 0未完成 1完成
** @Function  : 获取单节电压采样第一遍完成标志
** @The notes :
**===========================================================================================*/
u8 GetCellVSampFinFlagAPI(void);

/*=============================================================================================
** @Name      : u8 GetCellTSampFinFlagAPI(void)
** @Input     : void
** @Output    : 完成标志 0未完成 1完成
** @Function  : 获取单节温度采样第一遍完成标志
** @The notes :
**===========================================================================================*/
u8 GetCellTSampFinFlagAPI(void);

#endif
