/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : LowADCSamp.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : MCU的ADC通道采集功能函数模块
** @Instructions :
**===========================================================================================*/
#ifndef _LOWADCSAMP_H
#define _LOWADCSAMP_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPTypedef.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define LV_CAD_FILT_TIME      7     /*低压采样电流AD值滤波次数(尽量小,次数越多周期越长)*/
#define ENV_T_TAB_LEN         167   /*环境温度表长度(-41~125℃)*/
#define PWR_T_TAB_LEN         167   /*低压电源板温温度表长度(-41~125℃)*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
//BMUADC采样通道序号
typedef enum
{
	eBMU_ADC_HalSIG = 0,    		/*霍尔电流信号采集,ADC1*/
    eBMU_ADC_PwrV,            		/*低压电源电压采样,ADC1*/
    eBMU_ADC_ACCV,            		/*激活信号ACC电压采样,ADC0*/
    eBMU_ADC_HalV,            		/*霍尔供电电压采样(5V),ADC1*/
    eBMU_ADC_CdcV,            		/*充电枪KC供入电压采样,ADC1*/
    eBMU_ADC_CC2V,            		/*充电枪CC2信号电压采样,ADC1*/
    eBMU_ADC_MCU5V,            		/*5V电源信号,ADC1*/
	eBMU_ADC_Aux5V,    				/*SBC芯片6503输出AUX信号(5V),ADC1*/
	eBMU_ADC_MUXV,					/*SBC芯片MUX通道电压采集,ADC0*/
	eBMU_ADC_PWMV,					/*PWM电压检测,ADC0*/
	eBMU_ADC_ENVIT,	  				/*环境温度,ADC0*/
	eBMU_ADC_LPWRT,					/*低压电源温度,ADC1*/
    eBMU_ADC_HS0C,           		/*K1高边驱动电流采样,ADC0*/
    eBMU_ADC_HS1C,           		/*K2高边驱动电流采样,ADC0*/
    eBMU_ADC_HS2C,           		/*K3高边驱动电流采样,ADC0*/
    eBMU_ADC_HS3C,           		/*K4高边驱动电流采样,ADC0*/
    eBMU_ADC_HS4C,           		/*K5高边驱动电流采样,ADC0*/
    eBMU_ADC_HS5C,           		/*K6高边驱动电流采样,ADC0*/
    eBMU_ADC_HS6C,           		/*K7高边驱动电流采样,ADC0*/
    eBMU_ADC_HS7C,           		/*K8高边驱动电流采样,ADC0*/

    eBMU_ADC_SampNum                /*BMU使用ADC通道采样的个数*/
}e_BMULVSampADC;

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void ADCSampleInit(void)
** @Input     : void
** @Output    : void
** @Function  : ADC通道采样初始化
** @The notes :
**===========================================================================================*/
void ADCSampleInit(void);

/*=============================================================================================
** @Name      : void ADCSampleTask(void *p)
** @Input     : *p:形参,任务函数参数需要
** @Output    : void
** @Function  : ADC通道电压电流采样任务
** @The notes : 通过MCU的ADC通道读取
**===========================================================================================*/
void LowInfoSampleTask(void *p);

/*=============================================================================================
** @Name      : void PwmInfoCaptureTask(void)
** @Input     : void
** @Output    : void
** @Function  : PWM信息捕获任务
** @The notes : 100ms周期
**===========================================================================================*/
void PwmInfoCaptureTask(void);

/*=============================================================================================
** @Name      : u16 GetADCInitSampHVolt(void)
** @Input     : void
** @Output    : 高压采样通道初始采样值 10mV
** @Function  : 获取高压采样通道的初始采样值
** @The notes : 未经校准的原始高压值
**===========================================================================================*/
u16 GetADCInitSampHVolt(void);

/*=============================================================================================
** @Name      : void SampADCCurrBackHSStart(u8 flag)
** @Input     : flag:0-正常回检 1-立刻回检
** @Output    : void
** @Function  : 启动高边驱动电流回检采样
** @The notes : 仅在需要回检接触器驱动电流时调用
**===========================================================================================*/
void SampADCCurrBackHSStart(u8 flag);

/*=============================================================================================
** @Name      : s32 CorrRealHalCurrByKB(s32 volt)
** @Input     : volt:修正前采样电流值 0.01mV
** @Output    : 修正后实际电流值  0.01mV
** @Function  : 通过板温修正霍尔实际电压采样值
** @The notes : 板温影响霍尔电压采样
**===========================================================================================*/
s32 CorrRealHalVoltByTemp(s32 volt);

/*=============================================================================================
** @Name      : u8 GetADCSampHSBackCurrState(void)
** @Input     : void
** @Output    : 高边驱动电流回检采样状态:0:未回检 1:开始回检 2:正在回检 3:回检完成
** @Function  : 获取高边驱动电流回检采样状态
** @The notes :
**===========================================================================================*/
u8 GetADCSampHSBackCurrState(void);

/*=============================================================================================
** @Name      : u8 SampGetLowVSampExpFlagAPI(void)
** @Input     : void
** @Output    : 按位表示采样异常标志
** @Function  : 获取低压ADC通道采样异常标志
** @The notes :
**===========================================================================================*/
u8 SampGetLowVSampExpFlagAPI(void);

#endif
