/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : CatlMsg.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 兼容CATL电池协议CAN报文模块
** @Instructions : 
**===============================================================================================*/
#ifndef _CATLMSG_H
#define _CATLMSG_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "BSPUserAPI.h"
#include "PublicInfo.h"

#if(1 == BMU_CATL_CAN_EN)
/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/
/*CATL协议报警码结构体*/
typedef union _CATLAlarmInfo_
{
    struct
    {
        u32 WordL;
        u32 WordH;
    }Long;

    struct
    {
        u16 CHV          :2;        /*单体过压报警(0/1/2/3级)*/
        u16 CLV          :2;        /*单体欠压报警(0/1/2/3级)*/
        u16 CHT          :2;        /*单体过温报警(0/1/2/3级)*/
        u16 CLT          :2;        /*单体低温报警(0/1/2/3级)*/
        u16 GHV          :2;        /*箱体过压报警(0/1/2/3级)*/
        u16 GLV          :2;        /*箱体欠压报警(0/1/2/3级)*/
        u16 GHT          :2;        /*箱体过温报警(0/1/2/3级)*/
        u16 GLT          :2;        /*箱体低温报警(0/1/2/3级)*/
        u16 OCC          :2;        /*充电过流报警(0/1/2/3级)*/
        u16 ODC          :2;        /*放电过流报警(0/1/2/3级)*/
        u16 CTDIFF       :2;        /*单体温差过大报警(0/1/2/3级)*/
        u16 UPERR        :2;        /*启动失败报警[SBMU由于压差过大导致预充失败3次下高压标志](0/1级)*/
        u16 SOCL         :2;        /*SOC低报警(0/1/2级)*/
        u16 HSERR        :2;        /*高边开关控制异常报警(0/1级)*/
        u16 CVDIFF       :2;        /*单体压差过大报警(0/1/2/3级)*/
        u16 BALERR       :2;        /*均衡异常报警(0/1/2级)*/

        u16 KEEP0        :1;        /*保留0报警(0/1级)*/
        u16 OCOFF        :1;        /*过载切断继电器报警(0/1级)*/
        u16 PREERR       :1;        /*预充继电器闭合故障报警(0/1级)*/
        u16 MAIERR       :1;        /*主正继电器闭合故障报警(0/1级)*/
        u16 NEGERR       :1;        /*主负继电器闭合故障报警(0/1级)*/
        u16 MAIADH       :1;        /*主正继电器粘连故障报警(0/1级)*/
        u16 NEGADH       :1;        /*主负继电器粘连故障报警(0/1级)*/
        u16 OC4          :1;        /*充放电过流4级报警(0/1级)*/
        u16 CVOFF        :1;        /*单体电压测量故障报警(0/1级)*/
        u16 CTOFF        :1;        /*单体温度测量故障报警(0/1级)*/
        u16 SVERR        :1;        /*内侧和累加和压差大于50v报警(0/1级)*/
        u16 GCERR        :1;        /*箱体电流测量故障报警(0/1级)*/
        u16 MCANOFF      :1;        /*MCAN通信超时故障报警(0/1级)*/
        u16 KEEP1        :1;        /*保留1报警(0/1级)*/
        u16 KEEP2        :1;        /*保留2报警(0/1级)*/
        u16 KEEP3        :1;        /*保留3报警(0/1级)*/
        u16 CSCERR       :1;        /*CSC或SBMU的MCU故障报警(0/1级)*/
        u16 SVHEST       :1;        /*总压极限报警(0/1级)*/
        u16 CCANOFF      :1;        /*内部CCAN通信故障报警(0/1级)*/
        u16 SCANOFF      :1;        /*内部SCAN通信故障报警(0/1级)*/
        u16 CTERR        :1;        /*模组所有电芯温度测量故障报警(0/1级)*/
        u16 CTHEST       :1;        /*单体温度极限故障报警(0/1级)*/
        u16 CVHEST       :1;        /*单体电压极限故障报警(0/1级)*/
        u16 LENPWO       :1;        /*LEN 12V电源故障报警(0/1级)*/
        u16 CSCPWO       :1;        /*CSC 24V电源故障报警(0/1级)*/
        u16 SMUPWO       :1;        /*SBMU 24V电源故障报警(0/1级)*/
        u16 SMGERR       :1;        /*SBMU烟感报警(0/1级)*/
        u16 HVOFF        :1;        /*高压回路断路报警(0/1级)*/
        u16 HVLOCK       :1;        /*高压互锁报警(0/1级)*/
        u16 FAN1ERR      :1;        /*风机1故障报警(0/1级)*/
        u16 FAN2ERR      :1;        /*风机2故障报警(0/1级)*/
        u16 SWHERR       :1;        /*主正/主负继电器短电源故障报警(0/1级)*/
    }Bits;
}u_CatlAlarmInfo;

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void CanRcvCatlMsgHandleAPI(t_CANMSG *msg, u8 canNum)
** @Input     : msg:接收到的报文 canNum:接收CAN通道号
** @Output    : void
** @Function  : 兼容CATL电池协议CAN报文接收处理
** @The notes : CAN接收回调函数调用
**===============================================================================================*/
void CanRcvCatlMsgHandleAPI(t_CANMSG *msg, u8 canNum);

/*=================================================================================================
** @Name      : void CanSendUpCatlMsgCycleTask(void)
** @Input     : void
** @Output    : void
** @Function  : 兼容CATL电池协议CAN报文周期发送任务
** @The notes : 5ms调用
**===============================================================================================*/
void CanSendUpCatlMsgCycleTask(void);

#endif
#endif
