/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : CHGHandle.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 快充通信包通信处理接口
** @Instructions : CAN通信
**===============================================================================================*/
#ifndef _CHGHANDLE_H
#define _CHGHANDLE_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/
/*=======================================基本信息配置=============================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void CHGLibSendMsgTask(void)
** @Input     : void
** @Output    : void
** @Function  : 快充通信包通信报文发送任务
** @The notes : 必须10ms周期调用
**===============================================================================================*/
void CHGLibSendMsgTask(void);

/*=================================================================================================
** @Name      : void CHGLibRcvMsgHandleAPI(u32 ID, u8 *pdata, u8 DLC, u8 canNum)
** @Input     : ID:CANID *pdata:CAN数据域  DLC:数据域长度 canNum:CAN通道号
** @Output    : void
** @Function  : 快充通信报文接收处理任务
** @The notes : 用户放在CAN接收处理HOOK接口调用
**===============================================================================================*/
void CHGLibRcvMsgHandleAPI(u32 ID, u8 *pdata, u8 DLC, u8 canNum);

/*=================================================================================================
** @Name      : void CHGSetNowStageAPI(u8 stage)
** @Input     : stage:当前充电阶段值
** @Output    : void
** @Function  : 设置当前充电阶段值
** @The notes :
**===============================================================================================*/
void CHGSetNowStageAPI(u8 stage);

/*=================================================================================================
** @Name      : void CHGInputRcvChgerInfoAPI(e_CHGRcvMsg index, u8 info)
** @Input     : index:信息索引 info:接收信息
** @Output    : void
** @Function  : 输入接收充电桩报文状态和信息
** @The notes :
**===============================================================================================*/
void CHGInputRcvChgerInfoAPI(e_CHGRcvMsg index, u8 info);

/*=================================================================================================
** @Name      : u8 CHGGetRcvChgerInfoAPI(u8 index)
** @Input     : index:信息索引
** @Output    : 接收充电桩报文状态和信息
** @Function  : 获取接收充电桩报文状态和信息
** @The notes :
**===============================================================================================*/
u8 CHGGetRcvChgerInfoAPI(u8 index);

/*=================================================================================================
** @Name      : void CHGMarkRcvCSTTimeOutErrCodeAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 记录接收充电桩充电终止报文CST超时故障码
** @The notes :
**===============================================================================================*/
void CHGMarkRcvCSTTimeOutErrCodeAPI(void);

/*=================================================================================================
** @Name      : void CHGMarkRcvCSDTimeOutErrCodeAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 记录接收充电桩充电统计报文CSD超时故障码
** @The notes :
**===============================================================================================*/
void CHGMarkRcvCSDTimeOutErrCodeAPI(void);

/*=================================================================================================
** @Name      : u32 CHGGetChgMsgErrCodeAPI(void)
** @Input     : void
** @Output    : 通信报文超时故障码
** @Function  : 获取充电桩通信报文超时故障码
** @The notes :
**===============================================================================================*/
u32 CHGGetChgMsgErrCodeAPI(void);

#endif
