/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : CHGInterface.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 快充通信包通信处理接口
** @Instructions : CAN通信
**===============================================================================================*/
#ifndef _CHGINTERFACE_H
#define _CHGINTERFACE_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/
/*=======================================基本信息配置=============================================*/
#define CHG_CAN_NUM                 2                       /*快充通信口(CAN2)*/

#define CHG_RCV_CRM_MSG             1                       /*接收CRM报文取值*/
#define CHG_RCV_CRM_CON             2                       /*接收CRM确认(握手)取值*/

#define CHG_RCV_CML_MSG             1                       /*接收CML报文取值*/
#define CHG_RCV_CML_CON             2                       /*接收CML确认(适合)取值*/

#define CHG_RCV_CRO_MSG             1                       /*接收CRO报文取值*/
#define CHG_RCV_CRO_CON             2                       /*接收CRO确认(就绪)取值*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/
/*快充阶段定义*/
typedef enum
{
    eCHGSTAG_IDLE = 0,                  /*空闲阶段*/
    eCHGSTAG_LINK = 1,                  /*连接阶段*/
    eCHGSTAG_HAND = 2,                  /*握手阶段*/
    eCHGSTAG_CFG = 3,                   /*配置阶段*/
    eCHGSTAG_CHG = 4,                   /*充电阶段*/
    eCHGSTAG_STO = 5,                   /*终止阶段*/
    eCHGSTAG_FIN = 6                    /*结束阶段*/

}e_CHGStage;

/*接收充电桩信息类型定义*/
typedef enum
{
    eCHGRCV_CHM = 0,                    /*接收充电桩CHM*/
    eCHGRCV_CRM = 1,                    /*接收充电桩CRM*/
    eCHGRCV_ABRM = 2,                   /*接收充电桩应答BRM*/
    eCHGRCV_CBRM = 3,                   /*接收充电桩确认BRM*/

    eCHGRCV_ABCP = 4,                   /*接收充电桩应答BCP*/
    eCHGRCV_CBCP = 5,                   /*接收充电桩确认BCP*/
    eCHGRCV_CML = 6,                    /*接收充电桩CML*/
    eCHGRCV_CRO = 7,                    /*接收充电桩CRO*/

    eCHGRCV_ABCS = 8,                   /*接收充电桩应答BCS*/
    eCHGRCV_CBCS = 9,                   /*接收充电桩确认BCS*/
    eCHGRCV_CCS = 10,                   /*接收充电桩CCS*/

    eCHGRCV_ABMV = 11,                  /*接收充电桩应答BMV(可选)*/
    eCHGRCV_CBMV = 12,                  /*接收充电桩确认BMV(可选)*/

    eCHGRCV_ABMT = 13,                  /*接收充电桩应答BMT(可选)*/
    eCHGRCV_CBMT = 14,                  /*接收充电桩确认BMT(可选)*/

    eCHGRCV_CST = 15,                   /*接收充电桩CST*/

    eCHGRCV_CSD = 16,                   /*接收充电桩CSD*/

    eCHGRCV_STOP = 17,                  /*接收充电桩终止充电标志*/

    eCHGRCV_LEN

}e_CHGRcvMsg;

/*快充通信包故障码定义*/
typedef union
{
    u32 Word;
    struct
    {
        u16 CRM_00_OT       :2;         //充电机辨识报文0x00接收超时
        u16 CRM_AA_OT       :2;         //充电机辨识报文0xaa接收超时
        u16 rsv1            :4;         //保留1

        u16 CML_MAXC_OT     :2;         //充电机最大输出能力报文接收超时
        u16 CRO_READY_OT    :2;         //充电机准备报文接收超时
        u16 rsv2            :4;         //保留2

        u16 CCS_CHGS_OT     :2;         //充电机充电状态报文接收超时
        u16 CST_STOP_OT     :2;         //充电机充电终止报文接收超时
        u16 rsv3            :4;         //保留3

        u16 CSD_STAT_OT     :2;         //充电机统计报文接收超时
        u16 rsv4            :6;         //保留3
    }Bits;
}u_CHGErrCode;

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void CHGLibSendMsgTask(void)
** @Input     : void
** @Output    : void
** @Function  : 快充通信包通信报文发送任务
** @The notes : 必须10ms周期调用
**===============================================================================================*/
extern void CHGLibSendMsgTask(void);

/*=================================================================================================
** @Name      : void CHGLibRcvMsgHandleAPI(u32 ID, u8 *pdata, u8 DLC, u8 canNum)
** @Input     : ID:CANID *pdata:CAN数据域  DLC:数据域长度 canNum:CAN通道号
** @Output    : void
** @Function  : 快充通信报文接收处理任务
** @The notes : 用户放在CAN接收处理HOOK接口调用
**===============================================================================================*/
extern void CHGLibRcvMsgHandleAPI(u32 ID, u8 *pdata, u8 DLC, u8 canNum);

/*=================================================================================================
** @Name      : void CHGSetNowStageAPI(u8 stage)
** @Input     : stage:当前充电阶段值
** @Output    : void
** @Function  : 设置当前充电阶段值
** @The notes :
**===============================================================================================*/
extern void CHGSetNowStageAPI(u8 stage);

/*=================================================================================================
** @Name      : void CHGInputRcvChgerInfoAPI(e_CHGRcvMsg index, u8 info)
** @Input     : index:信息索引 info:接收信息
** @Output    : void
** @Function  : 输入接收充电桩报文状态和信息
** @The notes :
**===============================================================================================*/
extern void CHGInputRcvChgerInfoAPI(e_CHGRcvMsg index, u8 info);

/*=================================================================================================
** @Name      : u8 CHGGetRcvChgerInfoAPI(u8 index)
** @Input     : index:信息索引
** @Output    : 接收充电桩报文状态和信息
** @Function  : 获取接收充电桩报文状态和信息
** @The notes :
**===============================================================================================*/
extern u8 CHGGetRcvChgerInfoAPI(u8 index);

/*=================================================================================================
** @Name      : void CHGMarkRcvCSTTimeOutErrCodeAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 记录接收充电桩充电终止报文CST超时故障码
** @The notes :
**===============================================================================================*/
extern void CHGMarkRcvCSTTimeOutErrCodeAPI(void);

/*=================================================================================================
** @Name      : void CHGMarkRcvCSDTimeOutErrCodeAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 记录接收充电桩充电统计报文CSD超时故障码
** @The notes :
**===============================================================================================*/
extern void CHGMarkRcvCSDTimeOutErrCodeAPI(void);

/*=================================================================================================
** @Name      : u32 CHGGetChgMsgErrCodeAPI(void)
** @Input     : void
** @Output    : 通信报文超时故障码
** @Function  : 获取充电桩通信报文超时故障码
** @The notes :
**===============================================================================================*/
extern u32 CHGGetChgMsgErrCodeAPI(void);

/*=================================================================================================
** @Name      : void CHGSendMsgUser_Hook (u32 ID, u8 *pdata, u8 DLC, u8 canNum)
** @Input     : ID:CANID *pdata:CAN数据域 DLC:数据域长度 canNum:CAN通道号
** @Output    : void
** @Function  : CAN通信包发送报文处理
** @The notes : 用户必须补充完善
**===============================================================================================*/
void CHGSendMsgUser_Hook(u32 ID, u8 *pdata, u8 DLC, u8 canNum);

/*=================================================================================================
** @Name      : u16 CHGGetGroupChgVoltLim_Hook(void)
** @Input     : void
** @Output    : 充电最高电压:0.1V
** @Function  : 获取充电最高电压(握手阶段/配置阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupChgVoltLim_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupRatedCap_Hook(void)
** @Input     : void
** @Output    : 电池额定容量:0.1AH
** @Function  : 获取电池组额定容量(握手阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupRatedCap_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupRatedVolt_Hook(void)
** @Input     : void
** @Output    : 电池额定电压:0.1V
** @Function  : 获取电池组额定电压(握手阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupRatedVolt_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupChgCellVLim_Hook(void)
** @Input     : void
** @Output    : 充电单体电压限值:1mV
** @Function  : 获取充电电池单体电压限值(配置阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupChgCellVLim_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupChgCurrLim_Hook(void)
** @Input     : void
** @Output    : 充电电流限值:0.1A
** @Function  : 获取充电电流限值(配置阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupChgCurrLim_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupStandEner_Hook(void)
** @Input     : void
** @Output    : 电池组标称电能:0.1kWh
** @Function  : 获取电池组标称电能值(配置阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupStandEner_Hook(void);

/*=================================================================================================
** @Name      : s8 CHGGetGroupChgTempHigLim_Hook(void)
** @Input     : void
** @Output    : 充电最高温度限值:1℃
** @Function  : 获取电池组充电最高温度限值(配置阶段)
** @The notes : 用户补充
**===============================================================================================*/
s8 CHGGetGroupChgTempHigLim_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupSoc_Hook(void)
** @Input     : void
** @Output    : 电池组当前SOC:0.1%
** @Function  : 获取电池组当前SOC值(配置阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupSoc_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupSumVolt_Hook(void)
** @Input     : void
** @Output    : 电池组当前总电压:0.1V
** @Function  : 获取电池组当前总电压值(配置阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupSumVolt_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupReqVoltLim_Hook(void)
** @Input     : void
** @Output    : 电池组请求电压需求:0.1V
** @Function  : 获取电池组电池组请求电压需求值(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupReqVoltLim_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupReqCurrLim_Hook(void)
** @Input     : void
** @Output    : 电池组请求电流需求:0.1A
** @Function  : 获取电池组电池组请求电流需求值(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupReqCurrLim_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupChgInputVolt_Hook(void)
** @Input     : void
** @Output    : 充电电压测量值(输入值):0.1V
** @Function  : 获取充电电压测量值(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupChgInputVolt_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupChgInputCurr_Hook(void)
** @Input     : void
** @Output    : 充电电流测量值(输入值):0.1A
** @Function  : 获取充电电流测量值(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupChgInputCurr_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupMaxCellVolt_Hook(void)
** @Input     : void
** @Output    : 最高电池电压:0.01V
** @Function  : 获取最高电池电压值(充电阶段/结束阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupMaxCellVolt_Hook(void);

/*=================================================================================================
** @Name      : u8 CHGGetGroupMaxCellVNum_Hook(void)
** @Input     : void
** @Output    : 最高电压电池号
** @Function  : 获取最高电压电池号(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u8 CHGGetGroupMaxCellVNum_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupMinCellVolt_Hook(void)
** @Input     : void
** @Output    : 最低电池电压:0.01V
** @Function  : 获取最低电池电压值(结束阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupMinCellVolt_Hook(void);

/*=================================================================================================
** @Name      : u16 CHGGetGroupChgRemainTime_Hook(void)
** @Input     : void
** @Output    : 充电剩余时间 1min
** @Function  : 获取充电剩余时间(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u16 CHGGetGroupChgRemainTime_Hook(void);

/*=================================================================================================
** @Name      : s8 CHGGetGroupMaxCellTemp_Hook(void)
** @Input     : void
** @Output    : 最高电池温度:1℃
** @Function  : 获取最高电池温度值(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
s8 CHGGetGroupMaxCellTemp_Hook(void);

/*=================================================================================================
** @Name      : u8 CHGGetGroupMaxCellTNum_Hook(void)
** @Input     : void
** @Output    : 最高温度电池号
** @Function  : 获取最高温度电池号(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u8 CHGGetGroupMaxCellTNum_Hook(void);

/*=================================================================================================
** @Name      : s8 CHGGetGroupMinCellTemp_Hook(void)
** @Input     : void
** @Output    : 最低电池温度:1℃
** @Function  : 获取最低电池温度值(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
s8 CHGGetGroupMinCellTemp_Hook(void);

/*=================================================================================================
** @Name      : u8 CHGGetGroupMinCellTNum_Hook(void)
** @Input     : void
** @Output    : 最低温度电池号
** @Function  : 获取最低温度电池号(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u8 CHGGetGroupMinCellTNum_Hook(void);

/*=================================================================================================
** @Name      : u8 CHGGetGroupCellVAlarmState_Hook(void)
** @Input     : void
** @Output    : 电池单体电压告警状态 0:正常 1:过高 2:过低
** @Function  : 获取电池单体电压告警状态(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u8 CHGGetGroupCellVAlarmState_Hook(void);

/*=================================================================================================
** @Name      : u8 CHGGetGroupSocAlarmState_Hook(void)
** @Input     : void
** @Output    : 电池SOC告警状态 0:正常 1:过高 2:过低
** @Function  : 获取电池SOC告警状态(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u8 CHGGetGroupSocAlarmState_Hook(void);

/*=================================================================================================
** @Name      : u8 CHGGetGroupChgCAlarmState_Hook(void)
** @Input     : void
** @Output    : 电池充电过流告警状态 0:正常 1:过流
** @Function  : 获取电池充电过流告警状态(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u8 CHGGetGroupChgCAlarmState_Hook(void);

/*=================================================================================================
** @Name      : u8 CHGGetGroupTHAlarmState_Hook(void)
** @Input     : void
** @Output    : 电池温度过高告警状态 0:正常 1:过温
** @Function  : 获取电池温度过高告警状态(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u8 CHGGetGroupTHAlarmState_Hook(void);

/*=================================================================================================
** @Name      : u8 CHGGetGroupLeakAlarmState_Hook(void)
** @Input     : void
** @Output    : 电池绝缘告警状态 0:正常 1:不正常
** @Function  : 获取电池绝缘告警状态(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u8 CHGGetGroupLeakAlarmState_Hook(void);

/*=================================================================================================
** @Name      : u8 CHGGetGroupLeakAlarmState_Hook(void)
** @Input     : void
** @Output    : 电池连接器连接告警状态 0:正常 1:不正常
** @Function  : 获取电池连接器连接告警状态(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u8 CHGGetGroupSwitchAlarmState_Hook(void);

/*=================================================================================================
** @Name      : u8 CHGGetGroupChgAllowState_Hook(void)
** @Input     : void
** @Output    : 电池充电允许状态 0:禁止 1:允许
** @Function  : 获取电池充电允许状态(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u8 CHGGetGroupChgAllowState_Hook(void);

/*=================================================================================================
** @Name      : u8 CHGGetGroupChgFinState_Hook(void)
** @Input     : void
** @Output    : 电池充电终止状态 0:未终止 1:终止
** @Function  : 获取电池充电终止状态(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u8 CHGGetGroupChgFinState_Hook(void);

/*=================================================================================================
** @Name      : u8 CHGGetGroupSumVAlarmState_Hook(void)
** @Input     : void
** @Output    : 电池总压告警状态 0:正常 1:过高 2:过低
** @Function  : 获取电池总压告警状态(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u8 CHGGetGroupSumVAlarmState_Hook(void);

/*=================================================================================================
** @Name      : u8 CHGGetGroupHWTHAlarmState_Hook(void)
** @Input     : void
** @Output    : 电池BMS元器件/输出连接器过温告警状态 0:正常 1:过高
** @Function  : 获取电池BMS元器件/输出连接器过温告警状态(充电阶段)
** @The notes : 用户补充
**===============================================================================================*/
u8 CHGGetGroupHWTHAlarmState_Hook(void);

#endif
