/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : StaInterface.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 统计模块用户接口
** @Instructions : CAN通信
**===============================================================================================*/
#ifndef _STAINTERFACE_H
#define _STAINTERFACE_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "TimesStatis.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=============================================================================================
** @Name      : void GroupStatisAllInit(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组统计模块总初始化
** @The notes :
**===========================================================================================*/
extern void GroupStatisAllInit(void);

/*=============================================================================================
** @Name      : void GroupCycleCapStatisTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组单次循环充放电电量统计任务
** @The notes : 300ms
**===========================================================================================*/
extern void GroupCycleCapStatisTask(void);

/*=============================================================================================
** @Name      : void GroupHisCapStatisTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组累计历史充放电电量统计任务
** @The notes : 400ms
**===========================================================================================*/
extern void GroupHisCapStatisTask(void);

/*=============================================================================================
** @Name      : void GroupHisEnerStatisTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组累计历史充放电电能统计任务
** @The notes : 400ms
**===========================================================================================*/
extern void GroupHisEnerStatisTask(void);

/*=============================================================================================
** @Name      : void ClrGroupEnerCapStatisInfo(void)
** @Input     : void
** @Output    : void
** @Function  : 清除充放电电能电量统计值
** @The notes : 单次/累计/电能/电量
**===========================================================================================*/
extern void ClrGroupEnerCapStatisInfo(void);

/*=============================================================================================
** @Name      : void GroupChgTimesStatisTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组充放电次数统计任务
** @The notes : 2s
**===========================================================================================*/
extern void GroupChgTimesStatisTask(void);

/*=============================================================================================
** @Name      : void GroupAllowTimeStatisTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组可充放电时间统计任务
** @The notes : 2s
**===========================================================================================*/
extern void GroupAllowTimeStatisTask(void);

/*=============================================================================================
** @Name      : void GroupErrNumStatisTask(void)
** @Input     : void
** @Output    : void
** @Function  : 故障告警次数统计任务
** @The notes : 2s
**===========================================================================================*/
extern void GroupErrNumStatisTask(void);

/*=============================================================================================
** @Name      : void GroupDodStatisRcdTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组放电深度DOD统计记录任务
** @The notes : 1s
**===========================================================================================*/
extern void GroupDodStatisRcdTask(void);

/*=================================================================================================
** @Name      : void ChangHisDodRcdDisplayAPI(u8 home)
** @Input     : home:读首页标志 0:读下一页记录 1:读首页记录
** @Output    : void
** @Function  : 切换历史DOD显示信息
** @The notes : 读取历史DOD到显示区(读100条)
**===============================================================================================*/
extern void GroupChangHisDodDisplayAPI(u8 home);

/*=============================================================================================
** @Name      : void GroupClrDodStatisRcdAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除电池组放电深度DOD统计记录信息
** @The notes :
**===========================================================================================*/
extern void GroupClrDodStatisRcdAPI(void);

/*=============================================================================================
** @Name      : void GroupHisErrNumAddHandle(u8 type)
** @Input     : type:故障类型 0:告警 1:故障
** @Output    : void
** @Function  : 电池组故障告警累加处理
** @The notes : 确定是故障或告警后调用
**===========================================================================================*/
extern void GroupHisErrNumAddHandle(u8 type);

/*=============================================================================================
** @Name      : void ClrChgDhgTimesAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除电池组充放电次数
** @The notes :
**===========================================================================================*/
extern void ClrGroupChgDhgTimesAPI(void);

/*=============================================================================================
** @Name      : void ClrGroupHisErrNumAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除电池组累计故障告警数目
** @The notes : 当月值和累计值
**===========================================================================================*/
extern void ClrGroupHisErrNumAPI(void);

/*=============================================================================================
** @Name      : u8 StaGetBattVStateHook(void)
** @Input     : void
** @Output    : 电池组电压状态:0正常 1充满 2放空
** @Function  : 获取电池组电压状态
** @The notes :
**===========================================================================================*/
u8 StaGetBattVStateHook(void);

/*=============================================================================================
** @Name      : u8 StaGetVHLimStateHook(void)
** @Input     : void
** @Output    : 高压截止状态:0正常 1高压充电截止
** @Function  : 获取高压截止状态
** @The notes : 单体电压高2级(充电截止)
**===========================================================================================*/
u8 StaGetVHLimStateHook(void);

/*=============================================================================================
** @Name      : u8 StaGetVLLimStateHook(void)
** @Input     : void
** @Output    : 低压截止状态:0正常 1低压放电截止
** @Function  : 获取低压截止状态
** @The notes : 低压2级,限制放电
**===========================================================================================*/
u8 StaGetVLLimStateHook(void);

#endif
