/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : EepM24512.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 外部EEPROM驱动模块
** @Instructions : 采样模拟IIC通讯,高位先发
**===========================================================================================*/
#ifndef BSPSYS_DEVICE_EEPM24512_H_
#define BSPSYS_DEVICE_EEPM24512_H_

/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define Eep_Page_Size		128				//页字节128个
#define Eep_Max_Addr		0xffff			//最大可访问地址

#define LC512_Cmd_Write 	0xA0			//器件写命令
#define LC512_Cmd_Read		0xA1			//器件读命令

#define M24512_Devic_Addr   0xA0    		//器件设备地址

#define Eep_Ver_Addr		0xfffb			//用户校验EEPROM有效性访问地址
#define Eep_Ver_Flag		0x5aa5a55a		//用户校验EEPROM有效性标志

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void EXTEep24M512Init(void)
** @Input     : void
** @Output    : void
** @Function  : 外部EEPROM-M24512初始化
** @The notes :
**===========================================================================================*/
void EXTEep24M512Init(void);

/*=============================================================================================
** @Name      : u8 DEVEXTEEPWriteByte(u16 addr, u8 *buffer, u16 length)
** @Input     : addr:EEPROM地址[0,65535] buffer:要写入的数据  length:要写入数据的长度
** @Output    : 操作结果 TRUE:成功 FALSE:失败
** @Function  : 向外部EEPROM指定地址写入length个字节
** @The notes : 尽量不要跨页写(一页128Byte)
**===========================================================================================*/
u8 DEVEXTEEPWriteByte(u16 addr, u8 *buffer, u16 length);

/*=============================================================================================
** @Name      : u8 DEVEXTEEPWriteWord(u16 addr, u16 *buffer, u16 length)
** @Input     : addr:EEPROM地址[0,65535] buffer:要写入的数据  length:要写入数据的长度
** @Output    : 操作结果 TRUE:成功 FALSE:失败
** @Function  : 向外部EEPROM指定地址写入length个单字
** @The notes : 低字节在前(小端模式),尽量不要跨页写(一页128Byte)
**===========================================================================================*/
u8 DEVEXTEEPWriteWord(u16 addr, u16 *buffer, u16 length);

/*=============================================================================================
** @Name      : u8 DEVEXTEEPWriteLong(u16 addr, u32 *buffer, u16 length)
** @Input     : addr:EEPROM地址[0,65535] buffer:要写入的数据  length:要写入数据的长度
** @Output    : 操作结果 TRUE:成功 FALSE:失败
** @Function  : 向外部EEPROM指定地址写入length个双字
** @The notes : 低字节在前(小端模式),尽量不要跨页写(一页128Byte)
**===========================================================================================*/
u8 DEVEXTEEPWriteLong(u16 addr, u32 *buffer, u16 length);

/*=============================================================================================
** @Name      : u8 DEVEXTEEPReadByte(u16 addr, u8 *buffer, u16 length)
** @Input     : addr:EEPROM地址[0,65535] buffer:要读取的数据  length:读取数据的长度
** @Output    : 操作结果 TRUE:成功 FALSE:失败
** @Function  : 从外部EEPROM指定地址读出length个字节
** @The notes :
**===========================================================================================*/
u8 DEVEXTEEPReadByte(u16 addr, u8 *buffer, u16 length);

/*=============================================================================================
** @Name      : u8 DEVEXTEEPReadWord(u16 addr, u16 *buffer, u16 length)
** @Input     : addr:EEPROM地址[0,65535] buffer:要读取的数据  length:读取数据的长度
** @Output    : 操作结果 TRUE:成功 FALSE:失败
** @Function  : 从外部EEPROM指定地址读出length个单字
** @The notes : 低字节在前(小端模式)
**===========================================================================================*/
u8 DEVEXTEEPReadWord(u16 addr, u16 *buffer, u16 length);

/*=============================================================================================
** @Name      : u8 DEVEXTEEPReadLong(u16 addr, u32 *buffer, u16 length)
** @Input     : addr:EEPROM地址[0,65535] buffer:要读取的数据  length:读取数据的长度
** @Output    : 操作结果 TRUE:成功 FALSE:失败
** @Function  : 从外部EEPROM指定地址读出length个双字
** @The notes : 低字节在前(小端模式)
**===========================================================================================*/
u8 DEVEXTEEPReadLong(u16 addr, u32 *buffer, u16 length);

/*=============================================================================================
** @Name      : u8 DEVEXTEEPGetReadyFlag(void)
** @Input     : void
** @Output    : 0:未就绪 1:就绪
** @Function  : 获取外部EEPROm就绪状态标志
** @The notes : 与外部EEPROM芯片通讯状态
**===========================================================================================*/
u8 DEVEXTEEPGetReadyFlag(void);

/*=============================================================================================
** @Name      : void Eep24LC512_ClearNumPage(u8 pageNum)
** @Input     : pageNum:第几页
** @Output    : void
** @Function  : 指定清除哪一页的数据
** @The notes : pageNum必须是128的整数倍
**===========================================================================================*/
void Eep24LC512_ClearNumPage(u8 pageNum);

/*=============================================================================================
** @Name      : void Eep24LC512_Clear(void)
** @Input     : void
** @Output    : void
** @Function  : 清除24LC512里所有数据
** @The notes :
**===========================================================================================*/
void Eep24LC512_Clear(void);

#endif
