/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : Authority.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 权限管理模块接口函数
** @Instructions : 
**===============================================================================================*/
#ifndef _AUTHORITY_H
#define _AUTHORITY_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/
/*退出权限(普通用户,密码:0x0[0])*/
#define AUTHORITY_NAMECLR           0x0                     /*清除权限用户名(普通用户)*/
#define AUTHORITY_PWORDCLR          0x0                     /*清除权限密码(普通用户)*/

/*一级权限(运维用户,密码:0x0a2d08[666888])*/
#define AUTHORITY_NAME1             0x0a                    /*一级权限用户名(运维用户)*/
#define AUTHORITY_PWORD1            0x2d08                  /*一级权限密码(运维用户)*/

/*二级权限(高级用户,密码:0x0dbc5a[900186])*/
#define AUTHORITY_NAME2             0x0d                    /*二级权限用户名(高级用户)*/
#define AUTHORITY_PWORD2            0xbc5a                  /*二级权限密码(高级用户)*/

/*三级权限(超级用户,密码:0x0100ee5a[16838234])*/
#define AUTHORITY_NAME3             0x0100                  /*三级权限用户名(超级用户)*/
#define AUTHORITY_PWORD3            0xee5a                  /*三级权限密码(超级用户)*/

/*内部权限(超级用户,密码:0x00000315[789])*/
#define AUTHORITY_NAME4             0x0000                  /*三级权限用户名(超级用户)*/
#define AUTHORITY_PWORD4            0x0315                  /*三级权限密码(超级用户)*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/
typedef enum
{
    eAuthL_User = 0,                                        /*普通用户*/
    eAuthL_Operater = 1,                                    /*运维用户(运维人员)*/
    eAuthL_Service = 2,                                     /*高级用户(售后人员)*/
    eAuthL_Admin = 3,                                       /*超级用户(管理人员)*/
}e_AuthOpenLever;                                           /*权限开放级别*/

typedef enum
{
    eAuthP_Can0 = 0,                                        /*CAN0权限开放*/
    eAuthP_Can1 = 1,                                        /*CAN1权限开放*/
    eAuthP_Can2 = 2,                                        /*CAN2权限开放*/
    eAuthP_Sci0 = 5,                                        /*串口0权限开放*/
    eAuthP_Sci1 = 6,                                        /*串口1权限开放*/
    eAuthP_Sci2 = 7,                                        /*串口2权限开放*/
    eAuthP_Sci3 = 8,                                        /*串口3权限开放*/
	eAuthP_BUTT = 10,                                       /*按钮口权限开放*/
	eAuthP_FSTC = 11,                                       /*快充口权限开放*/
	eAuthP_INTE = 12,                                       /*内部权限开放*/
    eAuthP_All = 0xff,                                      /*所有端口权限开放*/
}e_AuthOpenPort;                                            /*权限开放端口*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void AuthorityInit(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组管理权限初始化
** @The notes : 默认权限处理
**===============================================================================================*/
void AuthorityInit(void);

/*=================================================================================================
** @Name      : void RcvSysAuthorityCmdAPI(u8 port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口
** @Output    : void
** @Function  : 系统接收切换管理权限命令处理函数
** @The notes : 通信口命令,按钮和内部口默认最高权限不需切换
**===============================================================================================*/
void RcvSysAuthorityCmdAPI(u8 port);

/*=================================================================================================
** @Name      : u8 GetSysNowAuthorityAPI(e_AuthOpenPort port)
** @Input     : port:接收命令端口:[0,4]CAN口 [5,9]RS485口 [10,12]按钮或内部口 0xff:所有口
** @Output    : 系统当前权限级别[0,3]
** @Function  : 获取系统相应端口当前权限级别
** @The notes :
**===============================================================================================*/
u8 GetSysNowAuthorityAPI(e_AuthOpenPort port);

#endif
