/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : DiagSos.h
** @Founder      : ZSY342
** @Date         : 2019.10.30
** @Function     : 系统SOS诊断模块
** @Instructions :
**===========================================================================================*/
#ifndef _DIAGSOS_H
#define _DIAGSOS_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#define SOS_DIAG_TATIS_EN         1             //系统安全等级统计执行使能

/*=============================================================================================
** @Macro definition
**===========================================================================================*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
/*SOS异常原因*/
typedef enum
{
    eSOS_REASION_ERR = 0,                   /*故障告警原因*/
    eSOS_REASION_VEX,                       /*电压极限值原因*/
    eSOS_REASION_VDI,                       /*电压压差大原因*/
    eSOS_REASION_VDN,                       /*电压压降大原因*/
    eSOS_REASION_TEX,                       /*温度极限值原因*/
    eSOS_REASION_TDI,                       /*温度温差大原因*/
    eSOS_REASION_TUP,                       /*温度温升大原因*/
    eSOS_REASION_BTE,                       /*均衡板温极限值原因*/
    eSOS_REASION_DTE,                       /*电源板温极限值原因*/
    eSOS_REASION_CEX,                       /*电流瞬时极限值原因*/

	//0等级
    eSOS_REASION_CER,                       /*电流待机电流异常原因*/
    eSOS_REASION_CAP,                       /*电池总容量衰减原因*/
    eSOS_REASION_CEL,                       /*单体充放电保护原因*/
    eSOS_REASION_THD,                       /*单体散热失效原因*/
    eSOS_REASION_DOD,                       /*长期DOD未达标原因*/
    eSOS_REASION_EEX,                       /*充放电效率未达标原因*/

    eSOS_REASION_LEN                        /*原因个数*/
}eSos_Reasion;

/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void DiagGroupSosInit(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组安全等级SOS诊断初始化
** @The notes : 读取是否到达锁定等级
**===========================================================================================*/
void DiagGroupSosInit(void);

/*=============================================================================================
** @Name      : void DiagGroupSosTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组安全等级SOS诊断任务
** @The notes : 100ms
**===========================================================================================*/
void DiagGroupSosTask(void);

/*=============================================================================================
** @Name      : u8 DiagGetGroupSosLevel(void)
** @Input     : void
** @Output    : void
** @Function  : 获取电池组总安全等级SOS
** @The notes : 包括当前等级和推断等级
**===========================================================================================*/
u8 DiagGetGroupSosLevel(void);

/*=============================================================================================
** @Name      : void DiagClrGroupSosLevel(void)
** @Input     : void
** @Output    : void
** @Function  : 清除电池组总安全等级SOS
** @The notes : 包括当前等级和推断等级
**===========================================================================================*/
void DiagClrGroupSosLevel(void);

#endif
