/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : DiagFilter.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 电池组故障诊断模块故障滤波接口
** @Instructions : 
**===============================================================================================*/
#ifndef _DIAGFILTER_H
#define _DIAGFILTER_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "DiagInterface.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/
#define DIAG_FILTER_TICK            50                      /*故障诊断滤波周期[必须与实际周期匹配](1ms)*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void DiagErrFilterInit(void)
** @Input     : swhSort:接触器名称[0,11] state:控制接触器状态 0:断开 1:闭合
** @Output    : void
** @Function  : 故障诊断滤波初始化
** @The notes : 滤波处理数组清零
**===============================================================================================*/
void DiagErrFilterInit(void);

/*=================================================================================================
** @Name      : void DiagErrFilterTask(u8 from, u8 to)
** @Input     : from-to:检测故障滤波起始和结束ID(包括from不包to)
** @Output    : void
** @Function  : 故障诊断滤波任务
** @The notes : 50ms周期调用,与DIAG_FILTER_TICK一致
**===============================================================================================*/
void DiagErrFilterTask(e_ERR_ID from, e_ERR_ID to);

/*=================================================================================================
** @Name      : void DiagErrFilStartAPI(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : void
** @Function  : 启动该故障诊断滤波
** @The notes :
**===============================================================================================*/
void DiagErrFilStartAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : void DiagErrFilStopAPI(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : void
** @Function  : 停止该故障诊断滤波
** @The notes :
**===============================================================================================*/
void DiagErrFilStopAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : void DiagSetErrNowStateAPI(e_ERR_ID id, e_ErrState state)
** @Input     : id:故障ID state:目标故障状态
** @Output    : void
** @Function  : 设置故障诊断滤波当前瞬时状态
** @The notes :
**===============================================================================================*/
void DiagSetErrNowStateAPI(e_ERR_ID id, e_ErrState state);

/*=================================================================================================
** @Name      : void DiagSetErrFilStateAPI(e_ERR_ID id, e_ErrState state)
** @Input     : id:故障ID state:目标故障状态
** @Output    : void
** @Function  : 设置故障诊断滤波当前稳定状态
** @The notes : 只能eErr_A或eErr_B
**===============================================================================================*/
void DiagSetErrFilStateAPI(e_ERR_ID id, e_ErrState state);

/*=================================================================================================
** @Name      : void DiagClrErrNorStateAPI(e_ERR_ID id)
** @Input     : id:故障ID,0xff所有故障
** @Output    : void
** @Function  : 清除故障诊断滤波当前故障状态
** @The notes :
**===============================================================================================*/
void DiagClrErrNorStateAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : e_ErrSort DiagGetFilErrSortAPI(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : 故障类型[0,8]
** @Function  : 获取故障类型
** @The notes :
**===============================================================================================*/
e_ErrSort DiagGetFilErrSortAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : e_ErrState DiagGetErrNowStateAPI(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : 当前瞬时故障状态
** @Function  : 获取故障当前瞬时状态
** @The notes : 不包括过渡状态
**===============================================================================================*/
e_ErrState DiagGetErrNowStateAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : e_ErrState DiagGetErrFilStateAPI(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : 当前滤波故障状态
** @Function  : 获取故障当前滤波状态
** @The notes : 包括过渡状态
**===============================================================================================*/
e_ErrState DiagGetErrFilStateAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : e_ErrState DiagGetErrLastStateAPI(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : 当前稳定故障状态
** @Function  : 获取故障当前稳定状态
** @The notes : 不包括过渡状态
**===============================================================================================*/
e_ErrState DiagGetErrLastStateAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : u16 DiagGetFilAtoBTimeAPI(u8 id)
** @Input     : id:故障ID
** @Output    : 故障滤波故障发生检测时长 0.1s
** @Function  : 获取故障滤波故障发生检测时长
** @The notes : 故障发生延时
**===============================================================================================*/
u16 DiagGetFilAtoBTimeAPI(u8 id);

/*=================================================================================================
** @Name      : e_ErrSort DiagGetGroupNowErrLevelAPI(u8 type)
** @Input     : type:故障类别:0::全部故障 1;充电类故障 2:放电类故障
** @Output    : 电池组当前故障级别[0,8]
** @Function  : 获取电池组当前故障级别
** @The notes : 当前故障的最高级别
**===============================================================================================*/
e_ErrSort DiagGetGroupNowErrLevelAPI(u8 type);

#endif
