/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : DiagInterface.h
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 电池组故障诊断模块用户接口
** @Instructions : 
**===============================================================================================*/
#ifndef _DIAGINTERFACE_H
#define _DIAGINTERFACE_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"
#include "DiagUser.h"

/*=================================================================================================
** @Macro definition
**===============================================================================================*/

/*=================================================================================================
** @Data type definition
**===============================================================================================*/
/*故障诊断滤波状态*/
typedef enum
{
    eErr_A    = 0,                      /*正常状态*/
    eErr_B    = 1,                      /*异常状态*/
    eErr_AtoB = 2,                      /*内部使用*/
    eErr_BtoA = 3,                      /*内部使用*/
    eErr_State
}e_ErrState;

/*故障诊断滤波状态*/
typedef struct                          /*定义故障滤波状态结构*/
{
    u8 enable;                          /*使能*/
    u16 timer;                          /*滤波计数器*/
    e_ErrState nowState;                /*滤波瞬时实时状态*/
    e_ErrState filState;                /*滤波稳定状态*/
    u8 resTimes;                        /*已自恢复次数(10min内)*/
}t_FilState;

/*故障诊断滤波参数*/
typedef struct                          /*定义故障滤波参数结构*/
{
    e_ErrSort errSort;                  /*故障类型[0:正常(不检测),1:仅提示类，2:充电限制类,3:放电限制类,4:充放电限制类,5:充电保护类,6:放电保护类,7:充放电保护类,8:系统故障类]*/
    u16 AtoBTime;                       /*A to B的时间*/
    u16 BtoATime;                       /*B to A的时间*/
    u8 maxTimes;                        /*允许自恢复最大次数(10min内)[0:不允许自恢复,255:无限次,1-254:允许自恢复次数]*/
}t_FilPara;

/*告警ID号*/
typedef enum
{
	/*以下为电池2级告警ID*/
    eERR_ID_CEL_VH2 = 0,                /*单体电压高2级(充电截止)*/
    eERR_ID_CEL_VL2 = 1,                /*单体电压低2级(放电截止)*/
    eERR_ID_SUM_VH2 = 2,                /*电池总电压过压2级(充电截止)*/
    eERR_ID_SUM_VL2 = 3,                /*电池总电压欠压2级(放电截止)*/
    eERR_ID_CHG_TH2 = 4,                /*充电温度高2级(充电截止)*/
    eERR_ID_CHG_TL2 = 5,                /*充电温度低2级(充电截止)*/
    eERR_ID_DHG_TH2 = 6,                /*放电温度高2级(放电截止)*/
    eERR_ID_DHG_TL2 = 7,                /*放电温度低2级(放电截止)*/
    eERR_ID_CHG_CO2 = 8,                /*充电过流2级(限制充电)*/
    eERR_ID_DHG_CO2 = 9,                /*放电过流2级(限制放电)*/
    eERR_ID_PER_TH2 = 10,               /*外设温度高2级(充放电限制)*/
    eERR_ID_LEAK2   = 11,               /*电池组绝缘2级(充放电限制)*/
    eERR_ID_CV_DIF2 = 12,               /*单体电压一致性下降2级(预警)*/
    eERR_ID_CT_DIF2 = 13,               /*单体温度温差过大2级(预警)*/
    eERR_ID_CAP_SH2 = 14,               /*充电容量SOC高2级(预警)*/
    eERR_ID_CAP_SL2 = 15,               /*剩余容量SOC低2级(预警)*/

    /*以下为电池1级告警ID*/
    eERR_ID_CEL_VH1 = 16,               /*单体电压高1级(充电保护)*/
    eERR_ID_CEL_VL1 = 17,               /*单体电压低1级(放电保护)*/
    eERR_ID_SUM_VH1 = 18,               /*电池总电压过压1级(充电保护)*/
    eERR_ID_SUM_VL1 = 19,               /*电池总电压欠压1级(放电保护)*/
    eERR_ID_CHG_TH1 = 20,               /*充电温度高1级(充电保护)*/
    eERR_ID_CHG_TL1 = 21,               /*充电温度低1级(充电保护)*/
    eERR_ID_DHG_TH1 = 22,               /*放电温度高1级(放电保护)*/
    eERR_ID_DHG_TL1 = 23,               /*放电温度低1级(放电保护)*/
    eERR_ID_CHG_CO1 = 24,               /*充电过流1级(充电延时保护)*/
    eERR_ID_DHG_CO1 = 25,               /*放电过流1级(放电延时保护)*/
    eERR_ID_PER_TH1 = 26,               /*外设温度过高1级(充放电保护)*/
    eERR_ID_LEAK1   = 27,               /*电池组绝缘1级(充放电保护)*/
    eERR_ID_CV_DIF1 = 28,               /*单体电压一致性下降1级(充放电限制)*/
    eERR_ID_CT_DIF1 = 29,               /*单体温度温差过大1级(充放电限制)*/
    eERR_ID_CAP_SH1 = 30,               /*充电容量SOC高1级(充电截止)*/
    eERR_ID_CAP_SL1 = 31,               /*剩余容量SOC低1级(放电截止)*/

    /*以下为提示类告警ID*/
    eERR_ID_SOC_EXP = 32,               /*SOC显示异常(需要修正)*/
    eERR_ID_CAP_EXP = 33,               /*容量检测异常(需要校准)*/
    eERR_ID_CHG_COT = 34,               /*充电过流响应超时(电流超限值)*/
    eERR_ID_DHG_COT = 35,               /*放电过流响应超时(电流超限值)*/
    eERR_ID_BAL_TH  = 36,               /*均衡板温过高(关闭均衡)*/
    eERR_ID_DCV_TH  = 37,               /*低压电源板温值过高(提示)*/

	eERR_ID_AIR_EXP   = 40,             /*空调内部告警异常*/
	eERR_ID_GAS_EXP   = 41,             /*可燃气体检测告警异常*/
	eERR_ID_FIRE_EXP  = 42,             /*消防检测告警异常*/
	eERR_ID_ACCESS_EXP= 43,             /*门禁检测告警异常*/
	eERR_ID_DUMP_EXP  = 44,             /*倾倒检测告警异常*/

	eERR_ID_McuCheck_EXP  = 45,         /*MCU检测告警异常*/

    eERR_ID_WARFIN  = 46,               /*最大48个告警*/

    /*故障类型开始*/
    /*以下为从控告警ID(48-51对应[0-3])*/
    eERR_ID_ERRSTART  = 48,             /*故障起始ID*/
    eERR_ID_BAL_TEXP  = 48,             /*均衡温度采样异常*/
    eERR_ID_BAL_CEXP  = 49,             /*均衡控制异常*/
    eERR_ID_ERR2_KEPP = 50,             /*故障位2预留*/
    eERR_ID_ERR3_KEPP = 51,             /*故障位3预留*/

    /*以下为从控内部故障ID(52-55对应[4-7])*/
    eERR_ID_SAMP_EXP  = 52,             /*单体采样电路异常*/
    eERR_ID_SAMP_VOFF = 53,             /*单体电压采样断线*/
    eERR_ID_SAMP_TOFF = 54,             /*单体温度采样断线*/
    eERR_ID_CELL_MISS = 55,             /*单体信息缺失*/

    /*以下为主从通信故障ID(56-59对应[8-11])*/
    eERR_ID_INT_LOFF = 56,              /*内部主从级联异常(与下级从控连接)*/
    eERR_ID_INT_COFF = 57,              /*内部主从CAN断线故障(与下级从控通讯)*/
    eERR_ID_PER_COFF = 58,              /*外设主从CAN断线故障(与内部绝缘检测仪通讯)*/
    eERR_ID_EXT_COFF = 59,              /*外部通讯断线(与上级或充放电设备CAN/RS485通讯)*/

    /*以下为主控软件报警ID(60-63对应[12-15])*/
    eERR_ID_MECU_REP   = 60,            /*主控设备地址冲突*/
    eERR_ID_ERR17_KEPP = 61,            /*故障位17预留*/
    eERR_ID_SW_EMERG   = 62,            /*电池组软件急停*/
    eERR_ID_SELF_PRO   = 63,            /*电池组自行保护*/

    /*以下为主控内部故障ID(64-79对应[16-31])*/
    eERR_ID_MRTC_EXP   = 64,            /*主控内部RTC异常*/
    eERR_ID_MEEP_EXP   = 65,            /*主控外部EEPROM异常*/
    eERR_ID_MFLA_EXP   = 66,            /*主控外部Flash异常*/
    eERR_ID_CSAMP_ERR  = 67,            /*电池组电流采样电路异常*/
    eERR_ID_HSAMP_EXP  = 68,            /*输出端高压采样异常*/
    eERR_ID_LSAMP_EXP  = 69,            /*硬件板低压侧采样异常*/
    eERR_ID_TSAMP_EXP  = 70,            /*外围温度采样异常*/
    eERR_ID_LEAK_EXP   = 71,            /*绝缘采样异常*/
    eERR_ID_K0RE_EXP   = 72,            /*KM1+回检异常(主正接触器HS回检异常)*/
    eERR_ID_K1RE_EXP   = 73,            /*KM2回检异常(预充接触器HS回检异常)*/
    eERR_ID_K2RE_EXP   = 74,            /*KM3+回检异常(负极接触器HS回检异常)*/
    eERR_ID_K3RE_EXP   = 75,            /*KM4回检异常(电源接触器HS回检异常)*/
    eERR_ID_K7RE_EXP   = 76,            /*KM5-8回检异常(4个附加接触器HS回检异常)*/
    eERR_ID_K8RE_EXP   = 77,            /*KM9回检异常(风扇接触器HS回检异常)*/
    eERR_ID_L0RE_EXP   = 78,            /*KM1-回检异常(主正接触器LS回检异常)*/
    eERR_ID_L2RE_EXP   = 79,            /*KM3-回检异常(负极接触器LS回检异常)*/

    //以下为主控外围故障ID(80-95对应[32-47])
    eERR_ID_K0MAI_EXP  = 80,            /*主正接触器状态异常(可能主接触器烧结或不能吸合)*/
    eERR_ID_K1PRE_EXP  = 81,            /*预充接触器异常(可能预充电阻断开或预充接触器不能吸合)*/
    eERR_ID_K2NEG_EXP  = 82,            /*负极接触器异常(可能负极接触器烧结或不能吸合)*/

    eERR_ID_FLOOD_ERR  = 83,            /*水浸告警*/
    eERR_ID_FUSE_OFF   = 84,            /*电池组熔断器熔断*/
    eERR_ID_BATT_SMOG  = 85,            /*电池组烟雾报警*/

    eERR_ID_STARTUP_VL  = 86,           /*电池组启动预充未满(可能带载启动)*/
    eERR_ID_STARTUP_TH  = 87,           /*电池组启动预充过温(预充电阻过热)*/
    eERR_ID_STARTUP_ERR = 88,           /*电池组启动失败(系统故障)*/
    eERR_ID_STOP_CH     = 89,           /*电池组停机带载超时*/
    eERR_ID_STOP_ERR    = 90,           /*电池组停机失败(系统故障)*/

    eERR_ID_IO_EMERG    = 91,           /*电池组按钮紧急停机*/
    eERR_ID_ISO_OFF     = 92,           /*断路器未合闸*/
    eERR_ID_DC_HV_DIFF  = 93,           /*电池组内外压差过大*/
    eERR_ID_SWHON_CH    = 94,           /*电池组带载闭合*/
    eERR_ID_SWHOFF_CH   = 95,           /*电池组带载断开*/

    eERR_ID_FINISH      = 96            /*最大96个故障诊断(故障和告警)*/
}e_ERR_ID;

/*=================================================================================================
** @Interface function declaration
**===============================================================================================*/
/*=================================================================================================
** @Name      : void DiagErrFilterInit(void)
** @Input     : swhSort:接触器名称[0,11] state:控制接触器状态 0:断开 1:闭合
** @Output    : void
** @Function  : 故障诊断滤波初始化
** @The notes : 滤波处理数组清零
**===============================================================================================*/
extern void DiagErrFilterInit(void);

/*=================================================================================================
** @Name      : void DiagErrFilterTask(u8 from, u8 to)
** @Input     : from-to:检测故障滤波起始和结束ID(包括from不包to)
** @Output    : void
** @Function  : 故障诊断滤波任务
** @The notes : 50ms周期调用,与DIAG_FILTER_TICK一致
**===============================================================================================*/
extern void DiagErrFilterTask(e_ERR_ID from, e_ERR_ID to);

/*=================================================================================================
** @Name      : void DiagErrFilStartAPI(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : void
** @Function  : 启动该故障诊断滤波
** @The notes :
**===============================================================================================*/
extern void DiagErrFilStartAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : void DiagErrFilStopAPI(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : void
** @Function  : 停止该故障诊断滤波
** @The notes :
**===============================================================================================*/
extern void DiagErrFilStopAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : void DiagSetErrNowStateAPI(e_ERR_ID id, e_ErrState state)
** @Input     : id:故障ID state:目标故障状态
** @Output    : void
** @Function  : 设置故障诊断滤波当前瞬时状态
** @The notes :
**===============================================================================================*/
extern void DiagSetErrNowStateAPI(e_ERR_ID id, e_ErrState state);

/*=================================================================================================
** @Name      : void DiagSetErrFilStateAPI(e_ERR_ID id, e_ErrState state)
** @Input     : id:故障ID state:目标故障状态
** @Output    : void
** @Function  : 设置故障诊断滤波当前稳定状态
** @The notes : 只能eErr_A或eErr_B
**===============================================================================================*/
extern void DiagSetErrFilStateAPI(e_ERR_ID id, e_ErrState state);

/*=================================================================================================
** @Name      : void DiagClrErrNorStateAPI(e_ERR_ID id)
** @Input     : id:故障ID,0xff所有故障
** @Output    : void
** @Function  : 清除故障诊断滤波当前故障状态
** @The notes :
**===============================================================================================*/
extern void DiagClrErrNorStateAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : e_ErrSort DiagGetFilErrSortAPI(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : 故障类型[0,8]
** @Function  : 获取故障类型
** @The notes :
**===============================================================================================*/
extern e_ErrSort DiagGetFilErrSortAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : e_ErrState DiagGetErrNowStateAPI(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : 当前瞬时故障状态
** @Function  : 获取故障当前瞬时状态
** @The notes : 不包括过渡状态
**===============================================================================================*/
extern e_ErrState DiagGetErrNowStateAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : e_ErrState DiagGetErrFilStateAPI(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : 当前滤波故障状态
** @Function  : 获取故障当前滤波状态
** @The notes : 包括过渡状态
**===============================================================================================*/
extern e_ErrState DiagGetErrFilStateAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : e_ErrState DiagGetErrLastStateAPI(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : 当前稳定故障状态
** @Function  : 获取故障当前稳定状态
** @The notes : 不包括过渡状态
**===============================================================================================*/
extern e_ErrState DiagGetErrLastStateAPI(e_ERR_ID id);

/*=================================================================================================
** @Name      : u16 DiagGetFilAtoBTimeAPI(u8 id)
** @Input     : id:故障ID
** @Output    : 故障滤波故障发生检测时长 0.1s
** @Function  : 获取故障滤波故障发生检测时长
** @The notes : 故障发生延时
**===============================================================================================*/
extern u16 DiagGetFilAtoBTimeAPI(u8 id);

/*=================================================================================================
** @Name      : e_ErrSort DiagGetGroupNowErrLevelAPI(u8 type)
** @Input     : type:故障类别:0::全部故障 1;充电类故障 2:放电类故障
** @Output    : 电池组当前故障级别[0,8]
** @Function  : 获取电池组当前故障级别
** @The notes : 当前故障的最高级别
**===============================================================================================*/
extern e_ErrSort DiagGetGroupNowErrLevelAPI(u8 type);

/*=================================================================================================
** @Name      : void DiagRcvDevMsgAddAPI(u8 addr)
** @Input     : addr:设备地址
** @Output    : void
** @Function  : 接收外设通信信息报文计数
** @The notes : 接收到报文时调用
**===============================================================================================*/
extern void DiagRcvDevMsgAddAPI(u8 addr);

/*=================================================================================================
** @Name      : void DiagRcvCellMissCheckAPI(u8 type, u8 num)
** @Input     : type:单体类型[0:单体电压 1:单体温度] num:单体信息编号
** @Output    : void
** @Function  : 判断是否接收所有单体信息
** @The notes :
**===============================================================================================*/
extern void DiagRcvCellMissCheckAPI(u8 type, u8 num);

/*=================================================================================================
** @Name      : void DiagRcvEcuRepCheckAPI(u8 addr)
** @Input     : addr:设备地址
** @Output    : void
** @Function  : 判断主控设备地址是否重复冲突
** @The notes : 出现相同的设备地址
**===============================================================================================*/
extern void DiagRcvEcuRepCheckAPI(u8 addr);

/*=================================================================================================
** @Name      : void DiagCommuCheckTask(void)
** @Input     : void
** @Output    : void
** @Function  : 检测通信状态任务
** @The notes : 1s周期调用
**===============================================================================================*/
extern void DiagCommuCheckTask(void);

/*=================================================================================================
** @Name      : void DiagPerDevCheckTask(void)
** @Input     : void
** @Output    : void
** @Function  : 检测外围设备故障状态任务
** @The notes : 500ms周期调用
**===============================================================================================*/
extern void DiagPerDevCheckTask(void);

/*=============================================================================================
** @Name      : void DiagSwhChangCStateCheckTask(void)
** @Input     : void
** @Output    : void
** @Function  : 检测接触器动作时电流状态(是否带载动作)
** @The notes : 100ms调用,检测主正/主负接触器
**===========================================================================================*/
extern void DiagSwhChangCStateCheckTask(void);

/*=============================================================================================
** @Name      : void DiagClrPerDevExpFlagAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除外部设备检测异常标志
** @The notes : 高压侧器件故障标志
**===========================================================================================*/
extern void DiagClrPerDevExpFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetHigVoltExpFlagAPI(void)
** @Input     : void
** @Output    : 按位表示高压采样值异常[bit0:总电压,1:预充电压]
** @Function  : 获取高压采样值异常标志
** @The notes :
**===============================================================================================*/
extern u8 DiagGetHigVoltExpFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetHigVSubDiffFlagAPI(void)
** @Input     : void
** @Output    : 高压内外压差过大标志[0:正常,1:压差过大]
** @Function  : 获取高压内外压差过大标志
** @The notes :
**===============================================================================================*/
extern u8 DiagGetHigVSubDiffFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetSwhStateVExpFlagAPI(void)
** @Input     : void
** @Output    : 按位表示各接触器状态电压值异常[bit0:正极接触器断开状态,bit1:预充接触器断开状态,bit2:负极接触器断开状态;bit4:正极接触器闭合状态,bit5:预充接触器闭合状态,bit6:负极接触器闭合状态]
** @Function  : 获取各接触器状态电压值异常标志
** @The notes : 高4位闭合状态电压异常,低4位断开状态电压异常
**===============================================================================================*/
extern u8 DiagGetSwhStateVExpFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetSwhChangCExpFlagAPI(void)
** @Input     : void
** @Output    : 按位表示各接触器动作带载异常[bit0:正极接触器断开,bit1:预充接触器断开,bit2:负极接触器断开;bit4:正极接触器闭合,bit5:预充接触器闭合,bit6:负极接触器闭合]
** @Function  : 获取各接触器带载动作异常标志
** @The notes : 高4位闭合带载异常,低4位断开带载异常
**===============================================================================================*/
extern u8 DiagGetSwhChangCExpFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetPeripDevExpFlagAPI(void)
** @Input     : void
** @Output    : 按位表示各外围器件异常[Bit0:熔断器 bit1:断路器 [0:正常 1:异常]]
** @Function  : 获取各外围器件异常标志
** @The notes :
**===============================================================================================*/
extern u8 DiagGetPeripDevExpFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetDcSideLeakFlagAPI(void)
** @Input     : void
** @Output    : 绝缘检测异常标志[0:正常 1:一级故障(严重) 2:二级告警(轻微) 3:检测失效]
** @Function  : 获取高压侧绝缘检测异常标志
** @The notes :
**===============================================================================================*/
extern u8 DiagGetDcSideLeakFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetRcvAllSlaveFlagAPI(void)
** @Input     : void
** @Output    : 接收到全部从控报文标志[0:未接收,1:正在接收,2:全部接收]
** @Function  : 获取接收到全部从控报文标志
** @The notes : 任一帧报文
**===============================================================================================*/
extern u8 DiagGetRcvAllSlaveFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetRcvAllCellFlagAPI(void)
** @Input     : void
** @Output    : 接收到全部单体信息报文标志[0:未接收,1:正在接收,2:全部接收]
** @Function  : 获取接收到全部单体信息报文标志
** @The notes : 全部单体电压和温度
**===============================================================================================*/
extern u8 DiagGetRcvAllCellFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetRcvAllPeripFlagAPI(void)
** @Input     : void
** @Output    : 接收到全部外设报文标志[0:未接收,1:正在接收,2:全部接收]
** @Function  : 获取接收到全部外设报文标志
** @The notes : 高压模块
**===============================================================================================*/
extern u8 DiagGetRcvAllPeripFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetRcvSlaveMsgSlaveIdAPI(void)
** @Input     : void
** @Output    : 未接收到从控信息报文的从控序号[1,32]
** @Function  : 获取未接收到从控信息报文从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
extern u8 DiagGetRcvSlaveMsgSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetRcvCellInfoSlaveIdAPI(void)
** @Input     : void
** @Output    : 未接收到单体信息的从控序号[1,32]
** @Function  : 获取未接收到单体信息从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
extern u8 DiagGetRcvCellInfoSlaveIdAPI(void);

/*=================================================================================================
** 从控采样异常检测
**===============================================================================================*/
/*=================================================================================================
** @Name      : void DiagRecordAFESampErrFlagAPI(u8 slave, u8 flag)
** @Input     : slave:从控序号[0,31] flag:异常标志(0:电压正常 1:电压异常 2:温度正常 3:温度异常)
** @Output    : void
** @Function  : 记录模拟前端检测到的采样异常标志
** @The notes : 芯片读取到的数据异常
**===============================================================================================*/
extern void DiagRecordAFESampErrFlagAPI(u8 slave, u8 flag);

/*=================================================================================================
** @Name      : void DiagRecordAFEVOffLFlagAPI(u8 slave, u32 offCell)
** @Input     : slave:从控序号[0,31] offCell:断线的电池(按位表示1节电池)
** @Output    : void
** @Function  : 记录模拟前端检测到的单体电压断线标志
** @The notes : 芯片处理判断
**===============================================================================================*/
extern void DiagRecordAFEVOffLFlagAPI(u8 slave, u32 offCell);

/*=================================================================================================
** @Name      : void DiagCheckCellVOffLFlagAPI(u8 slave, u8 cellNum, u16 volt)
** @Input     : slave:从控序号[0,31] cellNum:从控内电池号[0,17] volt:电压值[0,5000]mv
** @Output    : void
** @Function  : 检测单体电压采样断线标志
** @The notes : 采样电压判断
**===============================================================================================*/
extern void DiagCheckCellVOffLFlagAPI(u8 slave, u8 cellNum, u16 volt);

/*=================================================================================================
** @Name      : void DiagCheckCellTOffLFlagAPI(u8 slave, u8 cellNum, s8 temp)
** @Input     : slave:从控序号[0,31] cellNum:从控内电池号[0,15] temp:温度值[-40,105]℃
** @Output    : void
** @Function  : 检测单体电压采样断线标志
** @The notes : 单体电芯温度和均衡板温
**===============================================================================================*/
extern void DiagCheckCellTOffLFlagAPI(u8 slave, u8 cellNum, s8 temp);

/*=================================================================================================
 ** @Name      : void DiagRecordBalErrFlagAPI(u8 slave, u16 offCell)
 ** @Input     : slave:从控序号[0,31] errCell:均衡故障的电池通道(按位表示1节电池通道)
 ** @Output    : void
 ** @Function  : 记录均衡故障的电池通道标志
 ** @The notes : 只记录1个从控
 **===============================================================================================*/
extern void DiagRecordBalErrFlagAPI(u8 slave, u16 errCell);

/*=================================================================================================
** @Name      : u8 DiagGetCellSErrSlaveIdAPI(void)
** @Input     : void
** @Output    : 单体信息采样异常的从控序号[1,32]
** @Function  : 获取单体信息采样异常从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
extern u8 DiagGetCellSErrSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u16 DiagGetCellSampErrFlagAPI(void)
** @Input     : void
** @Output    : 按bit位表示单体信息采样异常标志[bit0:单体电压 bit1:单体温度](0正常,1异常)
** @Function  : 获取单体信息采样异常标志
** @The notes :
**===============================================================================================*/
extern u16 DiagGetCellSampErrFlagAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetCellTOffSlaveIdAPI(void)
** @Input     : void
** @Output    : 单体电压采样线断线的从控序号[1,32]
** @Function  : 获取均单体电压采样线断线从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
extern u8 DiagGetCellVOffSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u32 DiagGetCellVOffCellBitAPI(void)
** @Input     : void
** @Output    : 单体电压采样线断线的从控内电压通道(按位表示1个电压通道[0正常,1异常])
** @Function  : 获取单体电压采样线断线的从控内电压通道
** @The notes : 按位表示1个电压通道
**===============================================================================================*/
extern u32 DiagGetCellVOffCellBitAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetCellTOffSlaveIdAPI(void)
** @Input     : void
** @Output    : 单体温度采样线断线的从控序号[1,32]
** @Function  : 获取均单体温度采样线断线从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
extern u8 DiagGetCellTOffSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u16 DiagGetCellTOffCellBitAPI(void)
** @Input     : void
** @Output    : 单体温度采样线断线的从控内温度点位(按位表示1个温度点[0正常,1异常])
** @Function  : 获取单体温度采样线断线的从控内温度点位
** @The notes : 按位表示1个温度点
**===============================================================================================*/
extern u16 DiagGetCellTOffCellBitAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetBalTOffSlaveIdAPI(void)
** @Input     : void
** @Output    : 均衡板温采样线断线的从控序号[1,32]
** @Function  : 获取均衡板温采样线断线从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
extern u8 DiagGetBalTOffSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u16 DiagGetBalTOffCellBitAPI(void)
** @Input     : void
** @Output    : 均衡板温采样线断线的从控内温度点位(按位表示1个温度点[0正常,1异常])
** @Function  : 获取均衡板温采样线断线的从控内温度点位
** @The notes : 按位表示1个温度点
**===============================================================================================*/
extern u16 DiagGetBalTOffCellBitAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetBalErrSlaveIdAPI(void)
** @Input     : void
** @Output    : 均衡控制失败的从控序号[1,32]
** @Function  : 获取均衡控制失败从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
extern u8 DiagGetBalErrSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u16 DiagGetBalErrCellBitAPI(void)
** @Input     : void
** @Output    : 均衡控制失败的从控内通道位(按位表示1个通道[0,1])
** @Function  : 获取均衡控制失败的从控内通道位
** @The notes : 按位表示1个通道
**===============================================================================================*/
extern u16 DiagGetBalErrCellBitAPI(void);

/*=================================================================================================
** @Name      : u8 GetTempOffLineNum(void)
** @Input     : void
** @Output    : 均衡板温采样线断线的从控序号[1,32]
** @Function  : 获取均衡板温采样线断线从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
extern u8 DiagGetBalTOffSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u16 DiagGetBalTOffCellBitAPI(void)
** @Input     : void
** @Output    : 均衡板温采样线断线的从控内温度点位(按位表示1个温度点[0正常,1异常])
** @Function  : 获取均衡板温采样线断线的从控内温度点位
** @The notes : 按位表示1个温度点
**===============================================================================================*/
extern u16 DiagGetBalTOffCellBitAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetBalErrSlaveIdAPI(void)
** @Input     : void
** @Output    : 均衡控制失败的从控序号[1,32]
** @Function  : 获取均衡控制失败从控序号
** @The notes : 只记录1个从控
**===============================================================================================*/
extern u8 DiagGetBalErrSlaveIdAPI(void);

/*=================================================================================================
** @Name      : u16 DiagGetBalErrCellBitAPI(void)
** @Input     : void
** @Output    : 均衡控制失败的从控内通道位(按位表示1个通道[0,1])
** @Function  : 获取均衡控制失败的从控内通道位
** @The notes : 按位表示1个通道
**===============================================================================================*/
extern u16 DiagGetBalErrCellBitAPI(void);

/*=================================================================================================
** @Name      : void DiagVoltLimFilMakerTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电压限制类故障诊断任务
** @The notes : 100ms周期
**===============================================================================================*/
extern void DiagVoltLimFilMakerTask(void);

/*=================================================================================================
** @Name      : void DiagTempLimFilMakerTask(void)
** @Input     : void
** @Output    : void
** @Function  : 温度限制类故障诊断任务
** @The notes : 100ms周期
**===============================================================================================*/
extern void DiagTempLimFilMakerTask(void);

/*=================================================================================================
** @Name      : void DiagCurrLimFilMakerTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电流限制类故障诊断任务
** @The notes : 100ms周期
**===============================================================================================*/
extern void DiagCurrLimFilMakerTask(void);

/*=================================================================================================
** @Name      : void DiagPortExpFilMakerTask(void)
** @Input     : void
** @Output    : void
** @Function  : 输入输出端口异常类故障诊断任务
** @The notes : 100ms周期
**===============================================================================================*/
extern void DiagPortExpFilMakerTask(void);

/*=================================================================================================
** @Name      : void DiagInfoExpFilMakerTask(void)
** @Input     : void
** @Output    : void
** @Function  : 数据信息异常类故障诊断任务
** @The notes : 100ms周期
**===============================================================================================*/
extern void DiagInfoExpFilMakerTask(void);

/*=================================================================================================
** @Name      : void DiagStateExpFilMakerTask(void)
** @Input     : void
** @Output    : void
** @Function  : 状态信息异常类故障诊断任务
** @The notes : 100ms周期
**===============================================================================================*/
extern void DiagStateExpFilMakerTask(void);

/*=================================================================================================
** @Name      : void DiagErrDisplayTask(void)
** @Input     : void
** @Output    : void
** @Function  : 故障显示任务
** @The notes : 100ms周期,将滤波故障转入故障显示位
**===============================================================================================*/
extern void DiagErrDisplayTask(void);

/*=================================================================================================
** @Name      : void DiagUserSelfErrRecord(u8 code, eErr_RcdSort sort, u16 rcdInfo0,  u16 rcdInfo1)
** @Input     : id:用户故障码  sort:记录故障类型  1告警产生 3故障产生 rcdInfo0:需记录的信息0 rcdInfo1:需记录的信息1
** @Output    : void
** @Function  : 用户增加自定义故障记录(用户自定义仅记录故障告警产生)
** @The notes : 用户需要产生自定义故障时调用
**===============================================================================================*/
extern void DiagUserSelfErrRecord(u8 code, eErr_RcdSort sort, u16 rcdInfo0,  u16 rcdInfo1);

/*=================================================================================================
** @Name      : void DiagChangHisErrDisplayAPI(u8 date, u8 home)
** @Input     : date:历史故障日期[0,30]:0-30天前记录 home:读首页标志 0:读当前记录 1:读当日首页记录
** @Output    : void
** @Function  : 切换历史故障显示信息
** @The notes : 按照日期读取指定时间的历史故障显示(读30条)
**===============================================================================================*/
extern void DiagChangHisErrDisplayAPI(u8 date, u8 home);

/*=================================================================================================
** @Name      : void DiagClrHisErrDisplayAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除历史故障显示信息
** @The notes : 显示区域清零
**===============================================================================================*/
extern void DiagClrHisErrDisplayAPI(void);

/*=================================================================================================
** @Name      : void DiagChangHisWaveDisplayAPI(u8 date, u8 home)
** @Input     : date:历史故障录波日期[0,30]:0-30天前记录 home:读首页标志 0:读当前记录 1:读当日首页记录
** @Output    : void
** @Function  : 切换历史故障录波显示信息
** @The notes : 按照日期读取指定时间的历史故障录波显示(读1条)
**===============================================================================================*/
extern void DiagChangHisWaveDisplayAPI(u8 date, u8 home);

/*=================================================================================================
** @Name      : void DiagClrHisWaveDisplayAPI(void)
** @Input     : void
** @Output    : void
** @Function  : 清除历史故障录波显示信息
** @The notes : 显示区域清零
**===============================================================================================*/
extern void DiagClrHisWaveDisplayAPI(void);

/*=================================================================================================
** @Name      : u8 DiagGetErrProMaskStateHOOK(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : 故障是否屏蔽故障保护 0不屏蔽 1屏蔽
** @Function  : 获取对应ID故障是否屏蔽故障保护
** @The notes : 用户完善
**===============================================================================================*/
extern u8 DiagGetErrProMaskStateHOOK(e_ERR_ID id);

/*=================================================================================================
** @Name      : u8 DiagCheckErrNeedDispHOOK(e_ERR_ID id)
** @Input     : id:故障ID
** @Output    : 是否需要显示:TRUE:显示 FALSE:不显示
** @Function  : 判断对应故障告警是否向客户显示
** @The notes : 仅检测默认不显示的提示类告警
**===============================================================================================*/
extern u8 DiagCheckErrNeedDispHOOK(e_ERR_ID id);

/*=================================================================================================
** @Name      : u8 DiagGetCellVTExpStateHOOKk(void)
** @Input     : void
** @Output    : 电池组单体采样异常状态: 0:正常 1:异常
** @Function  : 获取电池组单体采样异常状态
** @The notes : 从控电压采样失效/断线/CAN断线时从控采样异常
**===============================================================================================*/
extern u8 DiagGetCellVTExpStateHOOKk(void);

/*=============================================================================================
** @Name      : void DiagGroupSosInit(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组安全等级SOS诊断初始化
** @The notes : 读取是否到达锁定等级
**===========================================================================================*/
extern void DiagGroupSosInit(void);

/*=============================================================================================
** @Name      : void DiagGroupSosTask(void)
** @Input     : void
** @Output    : void
** @Function  : 电池组安全等级SOS诊断任务
** @The notes : 100ms
**===========================================================================================*/
extern void DiagGroupSosTask(void);

/*=============================================================================================
** @Name      : u8 DiagGetGroupSosLevel(void)
** @Input     : void
** @Output    : void
** @Function  : 获取电池组总安全等级SOS
** @The notes : 包括当前等级和推断等级
**===========================================================================================*/
extern u8 DiagGetGroupSosLevel(void);

/*=============================================================================================
** @Name      : void DiagClrGroupSosLevel(void)
** @Input     : void
** @Output    : void
** @Function  : 清除电池组总安全等级SOS
** @The notes : 包括当前等级和推断等级
**===========================================================================================*/
extern void DiagClrGroupSosLevel(void);

/*=================================================================================================
** @Name      : u8 DiagGetCellVoltExpStateHOOK(void)
** @Input     : void
** @Output    : 单体电压异常状态 0正常 1异常
** @Function  : 获取单体电压异常状态
** @The notes : 用户完善
**===============================================================================================*/
u8 DiagGetCellVoltExpStateHOOK(void);

/*=================================================================================================
** @Name      : u8 DiagGetCellTempExpStateHOOK(void)
** @Input     : void
** @Output    : 单体温度异常状态 0正常 1异常
** @Function  : 获取单体温度异常状态
** @The notes : 用户完善
**===============================================================================================*/
u8 DiagGetCellTempExpStateHOOK(void);

/*=================================================================================================
** @Name      : u16 DiagGetCellVDiffSubVHOOK(u16 value)
** @Input     : 转换前的单体电压压差过大压差
** @Output    : 转换后的单体电压压差过大压差 1mV
** @Function  : 获取单体电压压差过大压差值
** @The notes : 根据电压区间转换
**===============================================================================================*/
u16 DiagGetCellVDiffSubVHOOK(u16 value);

#endif
