/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : CoolMsg.c
** @Founder      : SBK326
** @Date         : 2019.11.1
** @Function     : 兼容液冷系统CAN报文模块
** @Instructions : 
**===============================================================================================*/

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"
#include "PublicInfo.h"
#include "GroupPara.h"
#include "GroupInfo.h"
#include "CoolMsg.h"

//使能CATL液冷PACK系统
#if(5 == PRJ_PARA_NUM_INFO)
/*=================================================================================================
** @Global variable definition
**===============================================================================================*/

/*=================================================================================================
** @Static function declaration
**===============================================================================================*/

/*=================================================================================================
** @Interface function definition
**===============================================================================================*/
/*=================================================================================================
** @Name      : void SendUpCoolBMSMsg98ff45f4(void)
** @Input     : void
** @Output    : void
** @Function  : 上传水冷系统所需BMS报文信息
** @The notes : 500ms周期
**===============================================================================================*/
void SendUpCoolBMSMsg98ff45f4(void)
{
	u16 data = 0;
    t_CANMSG msg;
    static u8 sAlive = 0;

    msg.ID = 0x98ff45f4;

    msg.Len = 8;

    /*水冷系统运行模式*/
    data = 1;			/*0x00:待机   0x01:制冷  0x02:加热    0x03:自循环*/
    msg.Data[0] = data;

    /*水冷系统高压请求*/
    data = 1;
    msg.Data[0] |= (data << 2);

    /*水冷系统电池充电状态*/
    if(eCURR_CHG == GetGChgDhgStateAPI())
    {
    	data = 1;
    }
    else
    {
    	data = 0;
    }
    msg.Data[0] |= (data << 4);

    /*水冷系统空调接触器状态*/
    data = 1;
    msg.Data[0] |= (data << 6);

    /*电池高压值 1V*/
    data = GetGSampSumVoltAPI() / 10;
    msg.Data[2] = data & 0xff;
    msg.Data[3] = (data >> 8) & 0xff;

    /*设置温度命令 -40℃*/
    data = 65;
    msg.Data[4] = data & 0xff;

    /*生命帧计数*/
    sAlive++;
    msg.Data[6] = sAlive & 0xff;

    /*CRC(无效)*/
    msg.Data[7] = 0xff;

    /*向CAN1通道发送*/
    (void)BSPCANSendQin(eCAN1, &msg);
}

/*=================================================================================================
** @Static function definition
**===============================================================================================*/

#endif
